{
  "recipes": [
    {
      "id": 1,
      "title": "Pizza",
      "ingredients": "2 servings, 12-inch round of pizza dough, stretched (see recipe), 3 tablespoons tomato sauce (see note), Extra-virgin olive oil, 2¾ ounces fresh mozzarella, 4 to 5 basil leaves, roughly torn",
      "prepare": "Step 1: Place a pizza stone or tiles on the middle rack of your oven and turn the heat to its highest setting. Let it heat for at least an hour.\nStep 2: Put the sauce in the center of the stretched dough and use the back of a spoon to spread it evenly across the surface, stopping approximately ½ inch from the edges.\nStep 3: Drizzle a little olive oil over the pie. Break the cheese into large pieces and place them gently on the sauce. Scatter basil leaves over the top.\nStep 4: Using a pizza peel, pick up the pie and slide it onto the heated stone or tiles in the oven. Bake until the crust is golden brown and the cheese is bubbling, approximately 4 to 8 minutes.\nTIP: In a food processor, whiz together whole, drained canned tomatoes, a splash of olive oil, and a sprinkle of salt. Keep leftover sauce refrigerated!",
      "img": "https://www.recipetineats.com/wp-content/uploads/2020/05/Pizza-Crust-without-yeast_5-SQ.jpg"
    },
    {
      "id": 2,
      "title": "Homemade Sushi",
      "ingredients": "1⅓ cups water, ⅔ cup uncooked short-grain white rice, 3 tablespoons rice vinegar, 3 tablespoons white sugar, 1½ teaspoons salt, 4 sheets nori seaweed sheets, ½ pound imitation crabmeat, flaked, 1 avocado - peeled, pitted, and sliced, ½ cucumber, peeled, cut into small strips, 2 tablespoons pickled ginger",
      "prepare": "Step 1: Bring water to a boil in a medium pot; stir in rice. Reduce heat to medium-low, cover, and simmer until rice is tender and water has been absorbed, 20 to 25 minutes.\nStep 2: Mix rice vinegar, sugar, and salt in a small bowl. Gently stir into cooked rice in the pot and set aside.\nStep 3: Lay nori sheets on a baking sheet.\nStep 4: Heat nori in the preheated oven until warm, 1 to 2 minutes.\nStep 5: Center 1 nori sheet on a bamboo sushi mat. Use wet hands to spread a thin layer of rice on top. Arrange 1/4 of the crabmeat, avocado, cucumber, and pickled ginger over rice in a line down the center. Lift one end of the mat and roll it tightly over filling to make a complete roll. Repeat with remaining ingredients.\nStep 6: Use a wet, sharp knife to cut each roll into 4 to 6 slices.\nTips: If you do not have a bamboo sushi mat, the easiest way to roll sushi is with a clean dish towel.",
      "img": "https://www.happyfoodstube.com/wp-content/uploads/2016/03/homemade-sushi-image-500x500.jpg"
    },
    {
      "id": 3,
      "title": "Tacos",
      "ingredients": "1 lb. 90% to 93% lean ground beef, 1 Tablespoon chili powder, 1 teaspoon ground cumin, 3/4 teaspoon salt, 1/2 teaspoon dried oregano, 1/2 teaspoon garlic powder, 1/4 teaspoon ground black pepper, 1/2 cup tomato sauce, 1/4 cup water, 12 taco shells - either hard shells or small 6-inch soft flour tortillas will work, Optional Taco Toppings: shredded cheese, shredded lettuce, chopped tomatoes, diced red onion, taco sauce, sour cream, guacamole, etc.",
      "prepare": "Break apart lean ground beef in a skillet over medium-high heat. Add chili powder, cumin, salt, oregano, garlic powder, and pepper. Cook until the beef is browned.\nAdd tomato sauce and water to the meat. Cook until some liquid has evaporated, but the meat is still saucy.\nSpoon 2 tablespoons of the taco meat into hard taco shells or small soft tortillas. Top the tacos with your favorite traditional taco toppings.",
      "img": "https://hips.hearstapps.com/goodhousekeeping-uk/main/embedded/35802/caramelized-pork-tacos-600x900.jpg"
    },
    {
      "id": 4,
      "title": "Paella",
      "ingredients": "2 tablespoons olive oil, 1 onion, chopped, 3 cloves garlic, minced, 1 red bell pepper, sliced, 1 yellow bell pepper, sliced, 2 cups Arborio rice, 1 teaspoon smoked paprika, 1 teaspoon saffron threads, 4 cups chicken or vegetable broth, 1 cup white wine, 1 pound chicken thighs, boneless and skinless, cut into bite-sized pieces, 1 pound shrimp, peeled and deveined, 1 pound mussels, cleaned, 1 cup frozen peas, 1 lemon, cut into wedges, salt and pepper to taste",
      "prepare": "Step 1: Preheat the oven to 375°F (190°C). Heat olive oil in a large paella pan or a wide, shallow skillet. Add the chopped onion and sauté until softened. Add the minced garlic and sliced bell peppers. Cook for another 2 minutes.\nStep 2: Add the Arborio rice, smoked paprika, and saffron threads. Stir to coat the rice with the oil and spices.\nStep 3: Pour in the chicken or vegetable broth and white wine. Bring to a simmer and let cook for 10 minutes, stirring occasionally.\nStep 4: Nestle the chicken pieces into the rice mixture and cook for 10 minutes.\nStep 5: Add the shrimp, mussels, and frozen peas to the pan. Cover and cook for an additional 5 minutes, or until the shrimp is cooked through and the mussels have opened.\nStep 6: Remove from heat and let rest for 5 minutes before serving. Garnish with lemon wedges and season with salt and pepper to taste.",
      "img": "https://hips.hearstapps.com/hmg-prod/images/paella-recipe-2-648b59db017b7.jpg?crop=0.502xw:1.00xh;0.101xw,0&resize=1200:*"
    },
    {
      "id": 5,
      "title": "Chicken Tikka Masala",
      "ingredients": "For the chicken marinade: 1 cup plain yogurt, 2 tablespoons lemon juice, 2 teaspoons ground cumin, 2 teaspoons ground paprika, 2 teaspoons ground coriander, 1 teaspoon ground turmeric, 1 teaspoon ground ginger, 2 teaspoons garam masala, 2 teaspoons garlic paste, 1 teaspoon chili powder, 1 teaspoon salt, 1.5 lbs (700g) boneless skinless chicken thighs, cut into bite-sized pieces. For the sauce: 3 tablespoons butter, 1 large onion, finely chopped, 4 cloves garlic, minced, 1 tablespoon ginger paste, 1 teaspoon ground cumin, 1 teaspoon ground coriander, 1 teaspoon ground paprika, 1 teaspoon garam masala, 1 teaspoon chili powder, 1 teaspoon ground turmeric, 1 cup tomato puree, 1 cup heavy cream, 1 teaspoon sugar, Salt, to taste, Fresh cilantro, chopped, for garnish",
      "prepare": "Step 1: In a bowl, combine all the marinade ingredients. Add the chicken pieces and coat them well. Marinate for at least 1 hour, preferably overnight.\nStep 2: Preheat the grill or broiler to medium-high heat. Cook the chicken pieces for 5-6 minutes on each side until cooked through and slightly charred. Set aside.\nStep 3: In a large skillet, melt the butter over medium heat. Add the chopped onion and sauté until golden brown.\nStep 4: Add the minced garlic and ginger paste. Cook for an additional 1-2 minutes.\nStep 5: Add the ground cumin, ground coriander, ground paprika, garam masala, chili powder, and ground turmeric. Stir well to combine the spices with the onion mixture.\nStep 6: Add the tomato puree and cook for 2-3 minutes.\nStep 7: Reduce the heat to low and stir in the heavy cream. Simmer for 5 minutes.\nStep 8: Add the cooked chicken pieces to the sauce. Stir well and cook for an additional 5 minutes.\nStep 9: Season with salt and sugar to taste.\nStep 10: Garnish with fresh cilantro and serve with steamed rice or naan bread.",
      "img": "https://www.daringgourmet.com/wp-content/uploads/2019/12/Chicken-Tikka-Masala-10-square-500x500.jpg"
    },
    {
      "id": 6,
      "title": "Pad Thai",
      "ingredients": "8 ounces dried rice noodles, 2 tablespoons vegetable oil, 2 cloves garlic, minced, 8 ounces shrimp, peeled and deveined, 2 eggs, lightly beaten, 2 tablespoons fish sauce, 1 tablespoon tamarind paste, 1 tablespoon sugar, 1 cup bean sprouts, 4 green onions, chopped, ¼ cup chopped peanuts, Lime wedges, for serving, Fresh cilantro, for garnish",
      "prepare": "Step 1: Cook rice noodles according to package instructions. Drain and set aside.\nStep 2: Heat vegetable oil in a large skillet or wok over medium-high heat. Add garlic and sauté for 1 minute.\nStep 3: Add shrimp to the skillet and cook until pink and cooked through, about 3-4 minutes. Push the shrimp to one side of the skillet.\nStep 4: Pour the beaten eggs into the other side of the skillet. Scramble the eggs until cooked, then mix them together with the shrimp.\nStep 5: In a small bowl, whisk together fish sauce, tamarind paste, and sugar until well combined. Pour the sauce over the shrimp and eggs in the skillet.\nStep 6: Add the cooked rice noodles to the skillet. Toss everything together until well coated in the sauce.\nStep 7: Add bean sprouts and green onions to the skillet. Cook for an additional 2 minutes, until heated through.\nStep 8: Remove from heat and sprinkle chopped peanuts over the top.\nStep 9: Serve Pad Thai with lime wedges and garnish with fresh cilantro.",
      "img": "https://www.recipetineats.com/wp-content/uploads/2020/01/Chicken-Pad-Thai_9-SQ.jpg"
    },
    {
      "id": 7,
      "title": "Moussaka",
      "ingredients": "2 eggplants, sliced lengthwise, 1 lb ground beef or lamb, 1 onion, chopped, 2 cloves garlic, minced, 1 can crushed tomatoes (14 oz), 2 tablespoons tomato paste, 1 teaspoon dried oregano, 1 teaspoon ground cinnamon, 1/4 teaspoon ground nutmeg, 1/4 cup red wine (optional), 1/4 cup chopped fresh parsley, Salt and pepper, to taste, For the béchamel sauce: 3 tablespoons butter, 3 tablespoons all-purpose flour, 2 cups milk, 1/4 teaspoon ground nutmeg, 1/4 cup grated Parmesan cheese, 2 eggs, beaten",
      "prepare": "Step 1: Preheat the oven to 375°F (190°C). Heat olive oil in a large skillet over medium heat. Add the sliced eggplants and cook until lightly browned. Remove from heat and set aside.\nStep 2: In the same skillet, cook the ground beef or lamb until browned. Add the chopped onion and minced garlic. Cook until the onion is softened.\nStep 3: Stir in the crushed tomatoes, tomato paste, dried oregano, ground cinnamon, ground nutmeg, red wine (if using), chopped fresh parsley, salt, and pepper. Simmer for 10 minutes.\nStep 4: In a separate saucepan, melt the butter over medium heat. Stir in the flour and cook for 1 minute.\nStep 5: Gradually whisk in the milk until smooth. Cook, stirring constantly, until the sauce thickens.\nStep 6: Remove the saucepan from heat and stir in the ground nutmeg, grated Parmesan cheese, and beaten eggs.\nStep 7: Arrange half of the sliced eggplants in a greased baking dish. Pour half of the meat sauce over the eggplants.\nStep 8: Arrange the remaining sliced eggplants over the meat sauce and top with the remaining meat sauce.\nStep 9: Pour the béchamel sauce over the top, spreading it evenly.\nStep 10: Bake in the preheated oven for 45-50 minutes, or until the top is golden brown and bubbling.\nStep 11: Allow the moussaka to cool for a few minutes before serving. Serve warm.",
      "img": "https://www.recipetineats.com/wp-content/uploads/2019/03/Greek-Moussaka_3-re-edited-SQ.jpg"
    },
    {
      "id": 8,
      "title": "Pho",
      "ingredients": "For the broth: 2 lbs beef bones, 1 onion, halved, 2-inch piece fresh ginger, sliced, 5 star anise, 2 cinnamon sticks, 3 cloves, 1 tablespoon coriander seeds, 1 tablespoon fish sauce, 1 tablespoon sugar, Salt, to taste, For the soup: 8 oz rice noodles, 8 oz beef sirloin, thinly sliced, ½ onion, thinly sliced, 4 green onions, sliced, ¼ cup chopped fresh cilantro, Bean sprouts, Thai basil leaves, lime wedges, hoisin sauce, and sriracha, for serving",
      "prepare": "Step 1: Preheat the oven to 425°F (220°C). Place the beef bones, onion, and ginger on a baking sheet and roast for 30 minutes.\nStep 2: Transfer the roasted bones, onion, and ginger to a large pot. Add star anise, cinnamon sticks, cloves, and coriander seeds.\nStep 3: Fill the pot with water, enough to cover the bones. Bring to a boil, then reduce the heat to low and simmer for 4-6 hours, skimming off any impurities that rise to the surface.\nStep 4: Strain the broth into another pot, discarding the solids. Stir in fish sauce, sugar, and salt to taste.\nStep 5: Cook the rice noodles according to package instructions. Drain and set aside.\nStep 6: Divide the cooked rice noodles among serving bowls. Top with thinly sliced beef sirloin, onion slices, green onions, and chopped cilantro.\nStep 7: Ladle the hot broth over the noodles and beef, allowing the heat of the broth to cook the beef.\nStep 8: Serve pho with bean sprouts, Thai basil leaves, lime wedges, hoisin sauce, and sriracha on the side. Let each person customize their bowl with their preferred toppings.",
      "img": "https://www.recipetineats.com/wp-content/uploads/2020/05/Chicken-Pho_2-SQ.jpg"
    },
    {
      "id": 9,
      "title": "Poutine",
      "ingredients": "3 lbs russet potatoes, cut into fries, Vegetable oil, for frying, 2 cups cheese curds, Gravy: 4 tablespoons unsalted butter, 4 tablespoons all-purpose flour, 4 cups beef or chicken broth, Salt and pepper, to taste",
      "prepare": "Step 1: Heat vegetable oil in a deep fryer or large pot to 325°F (165°C).\nStep 2: Fry the potato fries in batches until they are golden and crisp. Transfer to a paper towel-lined plate to drain excess oil.\nStep 3: In a saucepan, melt butter over medium heat. Stir in flour until well combined to make a roux.\nStep 4: Gradually whisk in the broth, stirring constantly, until the gravy thickens. Season with salt and pepper to taste.\nStep 5: To assemble the poutine, place a layer of fries on a serving plate or in a shallow dish. Sprinkle cheese curds over the fries. Pour hot gravy over the top, allowing the cheese curds to melt.\nStep 6: Serve poutine immediately while the fries are still hot and the cheese is gooey.",
      "img": "https://thecozycook.com/wp-content/uploads/2018/11/Poutine-Recipe-f.jpg"
    },
    {
      "id": 10,
      "title": "Croissant",
      "ingredients": "For the dough: 2 cups all-purpose flour, 2 tablespoons granulated sugar, 1½ teaspoons instant yeast, 1½ teaspoons salt, ½ cup warm milk, 2 tablespoons unsalted butter, melted, ½ cup cold unsalted butter, For the egg wash: 1 egg, beaten, 1 tablespoon water",
      "prepare": "Step 1: In a large bowl, whisk together flour, sugar, instant yeast, and salt.\nStep 2: Add warm milk and melted butter to the dry ingredients. Stir until a soft dough forms.\nStep 3: Transfer the dough to a lightly floured surface and knead for about 5 minutes, until smooth and elastic.\nStep 4: Shape the dough into a square. Wrap it in plastic wrap and refrigerate for 30 minutes.\nStep 5: Meanwhile, place the cold butter between two sheets of plastic wrap and pound it with a rolling pin to flatten and soften it.\nStep 6: Roll out the chilled dough into a large rectangle. Place the flattened butter in the center of the dough.\nStep 7: Fold the dough over the butter, sealing the edges.\nStep 8: Roll out the dough into a long rectangle. Fold the dough into thirds, like a letter.\nStep 9: Turn the dough 90 degrees and roll it out again into a long rectangle. Fold the dough into thirds.\nStep 10: Wrap the dough in plastic wrap and refrigerate for 30 minutes.\nStep 11: Repeat the rolling and folding process two more times, chilling the dough for 30 minutes between each fold.\nStep 12: After the final fold, wrap the dough in plastic wrap and refrigerate overnight.\nStep 13: Preheat the oven to 425°F (220°C).\nStep 14: Roll out the chilled dough into a large rectangle. Cut triangles from the dough and roll them up tightly, starting from the wider end.\nStep 15: Place the croissants on a baking sheet lined with parchment paper. Brush them with the egg wash.\nStep 16: Bake the croissants for 15-20 minutes, until golden brown.\nStep 17: Allow the croissants to cool on a wire rack before serving.",
      "img": "https://static.toiimg.com/thumb/61912818.cms?imgsize=772945&width=800&height=800"
    },
    {
      "id": 11,
      "title": "Sushi Rolls",
      "ingredients": "2 cups sushi rice, 1/2 cup rice vinegar, 2 tablespoons sugar, 1 tablespoon salt, Nori seaweed sheets, Assorted fillings (such as sliced avocado, cucumber, imitation crab, cooked shrimp, etc.), Soy sauce, Wasabi, Pickled ginger",
      "prepare": "Step 1: Rinse the sushi rice under cold water until the water runs clear. Drain well.\nStep 2: In a saucepan, combine the rinsed rice and 2 cups of water. Bring to a boil, then reduce the heat to low and cover. Cook for 15-20 minutes, or until the rice is tender and the water is absorbed.\nStep 3: In a small bowl, combine the rice vinegar, sugar, and salt. Microwave for 30 seconds, or until the sugar and salt dissolve.\nStep 4: Transfer the cooked rice to a large bowl and drizzle the vinegar mixture over the top. Gently fold the rice to combine, being careful not to mash the grains.\nStep 5: Lay a sheet of nori seaweed on a bamboo sushi mat or a clean dish towel.\nStep 6: Moisten your hands with water to prevent sticking, then grab a handful of sushi rice and spread it evenly over the nori, leaving a 1-inch border at the top.\nStep 7: Arrange your desired fillings in a line down the center of the rice.\nStep 8: Using the bamboo mat or dish towel, roll the sushi tightly from bottom to top, applying gentle pressure to shape it.\nStep 9: Moisten the top border of the nori with water to seal the roll.\nStep 10: Use a sharp knife to slice the sushi roll into bite-sized pieces.\nStep 11: Serve the sushi rolls with soy sauce, wasabi, and pickled ginger.",
      "img": "https://veganheaven.org/wp-content/uploads/2018/08/Vegan-Sushi-31-500x500.jpg"
    },
    {
      "id": 12,
      "title": "Goulash",
      "ingredients": "2 lbs beef stew meat, cut into bite-sized pieces, 2 tablespoons vegetable oil, 2 onions, chopped, 3 cloves garlic, minced, 2 tablespoons sweet paprika, 1 teaspoon caraway seeds, 1 teaspoon dried thyme, 1 can diced tomatoes (14 oz), 2 cups beef broth, Salt and pepper, to taste, Sour cream, for serving, Chopped fresh parsley, for garnish",
      "prepare": "Step 1: Heat vegetable oil in a large pot or Dutch oven over medium heat. Add the chopped onions and minced garlic. Sauté until the onions are soft and translucent.\nStep 2: Add the beef stew meat to the pot and cook until browned on all sides.\nStep 3: Stir in the sweet paprika, caraway seeds, and dried thyme. Cook for an additional 1-2 minutes.\nStep 4: Add the diced tomatoes and beef broth to the pot. Season with salt and pepper to taste.\nStep 5: Bring the mixture to a boil, then reduce the heat to low. Cover and simmer for 1.5-2 hours, or until the beef is tender.\nStep 6: Serve the goulash hot, topped with a dollop of sour cream and a sprinkle of chopped fresh parsley.",
      "img": "https://www.thecabindiary.com/ezoimgfmt/b2694474.smushcdn.com/2694474/wp-content/uploads/2021/01/americangoulashrecipe-1-6-1.jpg?lossy=1&strip=1&webp=1&ezimgfmt=rs:371x371/rscb1/ngcb1/notWebP"
    },
    {
      "id": 13,
      "title": "Fish and Chips",
      "ingredients": "4 cod fillets, 1 cup all-purpose flour, 1 teaspoon baking powder, 1 teaspoon salt, 1 cup cold water, Vegetable oil, for frying, 4 large potatoes, cut into thick fries, Salt, to taste, Malt vinegar, for serving",
      "prepare": "Step 1: In a large bowl, whisk together flour, baking powder, and salt. Gradually add the cold water, whisking until a smooth batter forms.\nStep 2: Heat vegetable oil in a deep fryer or large pot to 375°F (190°C).\nStep 3: Dip each cod fillet into the batter, allowing any excess to drip off. Carefully place the battered fillets into the hot oil.\nStep 4: Fry the fish for 5-6 minutes, or until golden brown and crispy. Remove from the oil and drain on a paper towel-lined plate.\nStep 5: In the same hot oil, fry the potato fries in batches until they are golden and crisp. Transfer to a paper towel-lined plate to drain excess oil.\nStep 6: Season the fish and chips with salt to taste.\nStep 7: Serve the fish and chips hot with malt vinegar for dipping.",
      "img": "https://tastesbetterfromscratch.com/wp-content/uploads/2022/03/Fish-and-Chips-Web-8-500x500.jpg"
    },
    {
      "id": 14,
      "title": "Hummus",
      "ingredients": "1 can chickpeas (15 oz), drained and rinsed, 3 tablespoons tahini, 3 tablespoons lemon juice, 2 tablespoons olive oil, 2 cloves garlic, minced, ½ teaspoon ground cumin, Salt, to taste, 2 tablespoons water, Paprika, for garnish, Extra-virgin olive oil, for drizzling",
      "prepare": "Step 1: In a food processor, combine the chickpeas, tahini, lemon juice, olive oil, minced garlic, ground cumin, and salt.\nStep 2: Process the mixture until smooth and creamy, scraping down the sides of the bowl as needed.\nStep 3: With the food processor running, gradually add water, 1 tablespoon at a time, until the desired consistency is reached.\nStep 4: Transfer the hummus to a serving bowl. Sprinkle with paprika and drizzle with extra-virgin olive oil.\nStep 5: Serve the hummus with pita bread, fresh vegetables, or your favorite dippers.",
      "img": "https://veenaazmanov.com/wp-content/uploads/2020/07/Homemade-Healthy-Hummus-Recipe1-900x900.jpg"
    },
    {
      "id": 15,
      "title": "Beef Stroganoff",
      "ingredients": "1 lb beef sirloin, thinly sliced, Salt and pepper, to taste, 2 tablespoons vegetable oil, 1 onion, thinly sliced, 8 ounces mushrooms, sliced, 2 cloves garlic, minced, 1 tablespoon all-purpose flour, 1 cup beef broth, 1 tablespoon Dijon mustard, 1 tablespoon Worcestershire sauce, ½ cup sour cream, Chopped fresh parsley, for garnish",
      "prepare": "Step 1: Season the thinly sliced beef sirloin with salt and pepper.\nStep 2: Heat vegetable oil in a large skillet over medium-high heat. Add the sliced onion and sliced mushrooms. Sauté until the vegetables are softened.\nStep 3: Add the minced garlic to the skillet and cook for an additional minute.\nStep 4: Push the vegetables to one side of the skillet and add the beef slices. Cook until the beef is browned on all sides.\nStep 5: Sprinkle all-purpose flour over the beef and vegetables. Stir to coat.\nStep 6: Gradually add beef broth, stirring constantly, until the mixture thickens.\nStep 7: Stir in Dijon mustard and Worcestershire sauce.\nStep 8: Reduce the heat to low and simmer for 5 minutes.\nStep 9: Remove the skillet from heat and stir in sour cream.\nStep 10: Serve the beef stroganoff over cooked egg noodles or rice.\nStep 11: Garnish with chopped fresh parsley.",
      "img": "https://themom100.com/wp-content/uploads/2020/10/beef-stroganoff-287-768x768.jpg"
    },
    {
      "id": 16,
      "title": "Chicken Parmesan",
      "ingredients": "2 boneless, skinless chicken breasts, Salt and pepper, to taste, ½ cup all-purpose flour, 2 eggs, beaten, 1 cup breadcrumbs, ½ cup grated Parmesan cheese, 2 tablespoons olive oil, 1 cup marinara sauce, 1 cup shredded mozzarella cheese, Fresh basil leaves, for garnish",
      "prepare": "Step 1: Preheat the oven to 400°F (200°C).\nStep 2: Season the chicken breasts with salt and pepper.\nStep 3: Dredge the chicken breasts in flour, shaking off any excess.\nStep 4: Dip the chicken breasts in beaten eggs, allowing any excess to drip off.\nStep 5: In a shallow dish, combine breadcrumbs and grated Parmesan cheese. Coat the chicken breasts with the breadcrumb mixture.\nStep 6: Heat olive oil in a large skillet over medium heat. Add the breaded chicken breasts and cook until golden brown on both sides.\nStep 7: Transfer the chicken breasts to a baking dish. Spoon marinara sauce over the top.\nStep 8: Sprinkle shredded mozzarella cheese over the sauce.\nStep 9: Bake in the preheated oven for 15-20 minutes, or until the cheese is melted and bubbly.\nStep 10: Garnish with fresh basil leaves before serving.",
      "img": "https://www.foodandwine.com/thmb/P5ebl_oWTxx6Yr75r093YcV4reI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/200912-r-xl-chicken-parmigiana-50327e2498184f60a8053dd76eaf951b.jpg"
    },
    {
      "id": 17,
      "title": "Falafel",
      "ingredients": "1 cup dried chickpeas, soaked overnight, 1 onion, chopped, 4 cloves garlic, minced, ½ cup fresh parsley, chopped, ½ cup fresh cilantro, chopped, 1 teaspoon ground cumin, 1 teaspoon ground coriander, ½ teaspoon baking powder, Salt and pepper, to taste, Vegetable oil, for frying",
      "prepare": "Step 1: Drain and rinse the soaked chickpeas.\nStep 2: In a food processor, combine chickpeas, chopped onion, minced garlic, chopped parsley, chopped cilantro, ground cumin, ground coriander, baking powder, salt, and pepper.\nStep 3: Process the mixture until it forms a coarse paste. Scrape down the sides of the processor bowl as needed.\nStep 4: Transfer the falafel mixture to a bowl. Cover and refrigerate for at least 1 hour, or until firm.\nStep 5: Heat vegetable oil in a deep fryer or large pot to 375°F (190°C).\nStep 6: Form the falafel mixture into small patties or balls, about 1 inch in diameter.\nStep 7: Fry the falafel in batches until golden brown and crispy, about 3-4 minutes.\nStep 8: Remove the falafel from the oil and drain on a paper towel-lined plate.\nStep 9: Serve the falafel hot with tahini sauce, pita bread, and fresh vegetables.",
      "img": "https://i0.wp.com/feastinthemiddleeast.com/wp-content/uploads/2021/06/Falafel.jpg?resize=900%2C900&ssl=1"
    },
    {
      "id": 18,
      "title": "Ratatouille",
      "ingredients": "2 tablespoons olive oil, 1 onion, chopped, 2 cloves garlic, minced, 1 eggplant, diced, 2 zucchinis, diced, 1 red bell pepper, diced, 1 yellow bell pepper, diced, 1 can diced tomatoes (14 oz), 1 teaspoon dried thyme, 1 teaspoon dried oregano, Salt and pepper, to taste, Fresh basil leaves, chopped, for garnish",
      "prepare": "Step 1: Heat olive oil in a large skillet or Dutch oven over medium heat. Add the chopped onion and minced garlic. Sauté until the onions are soft and translucent.\nStep 2: Add the diced eggplant, diced zucchinis, diced red bell pepper, and diced yellow bell pepper to the skillet. Cook until the vegetables are tender.\nStep 3: Stir in the diced tomatoes, dried thyme, dried oregano, salt, and pepper.\nStep 4: Reduce the heat to low and simmer for 15-20 minutes to allow the flavors to blend.\nStep 5: Remove from heat and garnish with chopped fresh basil leaves before serving.",
      "img": "https://i.pinimg.com/564x/f1/7f/d2/f17fd2137d7fd4b9da8511c989fd6f19.jpg"
    },
    {
      "id": 19,
      "title": "Chicken Fried Rice",
      "ingredients": "2 cups cooked white rice, chilled, 2 tablespoons vegetable oil, 2 boneless, skinless chicken breasts, diced, Salt and pepper, to taste, 2 cloves garlic, minced, 1 cup frozen mixed vegetables, 2 eggs, beaten, 2 tablespoons soy sauce, 1 tablespoon oyster sauce, 1 green onion, sliced",
      "prepare": "Step 1: Heat vegetable oil in a large skillet or wok over medium-high heat.\nStep 2: Season diced chicken breasts with salt and pepper. Add the chicken to the hot skillet and cook until browned and cooked through.\nStep 3: Add minced garlic and frozen mixed vegetables to the skillet. Cook until the vegetables are heated through.\nStep 4: Push the chicken and vegetables to one side of the skillet. Pour beaten eggs into the other side of the skillet.\nStep 5: Scramble the eggs until cooked, then mix them together with the chicken and vegetables.\nStep 6: Add chilled cooked rice to the skillet. Stir-fry everything together until well combined.\nStep 7: Stir in soy sauce and oyster sauce, coating the rice and ingredients.\nStep 8: Cook for an additional 2-3 minutes, until heated through.\nStep 9: Garnish with sliced green onions before serving.",
      "img": "https://i.pinimg.com/564x/ba/bb/0f/babb0f997cb098c26c01c65ae6a5a79a.jpg"
    },
    {
      "id": 20,
      "title": "Chicken Noodle Soup",
      "ingredients": "2 tablespoons butter, 1 onion, chopped, 2 carrots, sliced, 2 stalks celery, sliced, 4 cups chicken broth, 2 cups cooked chicken, shredded, 2 cups egg noodles, Salt and pepper, to taste, Fresh parsley, chopped, for garnish",
      "prepare": "Step 1: In a large pot, melt butter over medium heat. Add the chopped onion, sliced carrots, and sliced celery. Sauté until the vegetables are softened.\nStep 2: Pour chicken broth into the pot and bring to a boil.\nStep 3: Add shredded cooked chicken and egg noodles to the pot. Reduce the heat to low and simmer for 8-10 minutes, or until the noodles are cooked.\nStep 4: Season with salt and pepper to taste.\nStep 5: Remove the pot from heat and garnish with chopped fresh parsley before serving.",
      "img": "https://i.pinimg.com/564x/0e/b6/2c/0eb62c99caaca2e9fc5f43f101feebcf.jpg"
    },
    {
      "id": 21,
      "title": "Chicken Satay",
      "ingredients": "1 lb boneless, skinless chicken thighs, cut into thin strips, 2 tablespoons soy sauce, 2 tablespoons vegetable oil, 2 tablespoons honey, 2 tablespoons peanut butter, 1 tablespoon curry powder, 1 tablespoon lime juice, 1 clove garlic, minced, Wooden skewers, soaked in water for 30 minutes",
      "prepare": "Step 1: In a bowl, combine soy sauce, vegetable oil, honey, peanut butter, curry powder, lime juice, and minced garlic. Stir until well combined.\nStep 2: Add the chicken strips to the bowl and toss to coat them in the marinade. Let the chicken marinate for at least 30 minutes.\nStep 3: Preheat a grill or grill pan to medium-high heat.\nStep 4: Thread the marinated chicken strips onto soaked wooden skewers.\nStep 5: Grill the chicken skewers for 3-4 minutes per side, or until cooked through and slightly charred.\nStep 6: Serve the chicken satay hot with peanut sauce or your favorite dipping sauce.",
      "img": "https://i.pinimg.com/564x/49/ad/7f/49ad7f484e6e0f3a0f67e73351a9d572.jpg"
    },
    {
      "id": 22,
      "title": "Chicken Caesar Salad",
      "ingredients": "2 boneless, skinless chicken breasts, Salt and pepper, to taste, 2 tablespoons olive oil, 1 head romaine lettuce, chopped, ½ cup Caesar dressing, ¼ cup grated Parmesan cheese, Croutons, for garnish",
      "prepare": "Step 1: Season the chicken breasts with salt and pepper.\nStep 2: Heat olive oil in a skillet over medium heat. Add the seasoned chicken breasts and cook until browned and cooked through.\nStep 3: Remove the cooked chicken from the skillet and let it rest for a few minutes. Slice the chicken into thin strips.\nStep 4: In a large bowl, combine chopped romaine lettuce, Caesar dressing, and grated Parmesan cheese. Toss to coat the lettuce evenly.\nStep 5: Divide the dressed lettuce among serving plates. Top with sliced chicken.\nStep 6: Garnish the salad with croutons before serving.",
      "img": "https://i.pinimg.com/564x/4b/56/dc/4b56dcbd952eb0aaa0f2e90adb362ace.jpg"
    },
    {
      "id": 23,
      "title": "Lasagna",
      "ingredients": "8 lasagna noodles, cooked and drained, 1 lb ground beef, 1 onion, chopped, 2 cloves garlic, minced, 1 can crushed tomatoes (14 oz), 1 can tomato sauce (8 oz), 1 can tomato paste (6 oz), 1 teaspoon dried basil, 1 teaspoon dried oregano, Salt and pepper, to taste, 2 cups ricotta cheese, 1 egg, beaten, 2 cups shredded mozzarella cheese, ½ cup grated Parmesan cheese",
      "prepare": "Step 1: Preheat the oven to 375°F (190°C).\nStep 2: In a large skillet, cook the ground beef, chopped onion, and minced garlic until the beef is browned. Drain any excess fat.\nStep 3: Stir in the crushed tomatoes, tomato sauce, tomato paste, dried basil, dried oregano, salt, and pepper. Simmer for 10 minutes.\nStep 4: In a bowl, combine ricotta cheese and beaten egg.\nStep 5: Spread a thin layer of the meat sauce in the bottom of a greased baking dish.\nStep 6: Arrange a layer of cooked lasagna noodles over the sauce.\nStep 7: Spread half of the ricotta cheese mixture over the noodles.\nStep 8: Sprinkle shredded mozzarella cheese over the ricotta layer.\nStep 9: Repeat the layers with meat sauce, noodles, ricotta cheese mixture, and mozzarella cheese.\nStep 10: Finish with a layer of meat sauce on top. Sprinkle grated Parmesan cheese over the sauce.\nStep 11: Cover the baking dish with foil and bake in the preheated oven for 25 minutes.\nStep 12: Remove the foil and bake for an additional 10 minutes, or until the cheese is bubbly and golden.\nStep 13: Let the lasagna cool for a few minutes before serving.",
      "img": "https://i.pinimg.com/564x/2d/34/2f/2d342f1ac0fd0b9fb57c3035c0dba708.jpg"
    },
    {
      "id": 24,
      "title": "Chicken Enchiladas",
      "ingredients": "2 boneless, skinless chicken breasts, cooked and shredded, 1 onion, chopped, 2 cloves garlic, minced, 1 can diced tomatoes with green chilies (10 oz), 1 can enchilada sauce (10 oz), 1 teaspoon ground cumin, Salt and pepper, to taste, 8 flour tortillas, 2 cups shredded cheddar cheese, Fresh cilantro, chopped, for garnish",
      "prepare": "Step 1: Preheat the oven to 375°F (190°C).\nStep 2: In a skillet, sauté chopped onion and minced garlic until the onion is softened.\nStep 3: Add the shredded chicken, diced tomatoes with green chilies, enchilada sauce, ground cumin, salt, and pepper. Cook for 5 minutes.\nStep 4: Spoon a portion of the chicken mixture onto each flour tortilla. Roll up the tortillas and place them seam-side down in a greased baking dish.\nStep 5: Pour any remaining sauce over the rolled tortillas. Sprinkle shredded cheddar cheese over the top.\nStep 6: Bake in the preheated oven for 20-25 minutes, or until the cheese is melted and bubbly.\nStep 7: Garnish with chopped fresh cilantro before serving.",
      "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTs7lbhuSw5kEEQ1-aYWBdcaz-sIFK6HO9u-g&usqp=CAU"
    },
    {
      "id": 25,
      "title": "Pancakes",
      "ingredients": "1 cup all-purpose flour, 2 tablespoons granulated sugar, 2 teaspoons baking powder, ½ teaspoon salt, 1 cup milk, 1 egg, 2 tablespoons melted butter, Additional melted butter or cooking spray, for greasing the skillet",
      "prepare": "Step 1: In a large bowl, whisk together flour, sugar, baking powder, and salt.\nStep 2: In a separate bowl, whisk together milk, egg, and melted butter.\nStep 3: Pour the wet ingredients into the dry ingredients. Stir until just combined. Do not overmix; it's okay if there are a few lumps.\nStep 4: Preheat a skillet or griddle over medium heat. Grease it with melted butter or cooking spray.\nStep 5: Pour ¼ cup of the pancake batter onto the hot skillet for each pancake. Cook until bubbles form on the surface, then flip and cook the other side until golden brown.\nStep 6: Remove the pancakes from the skillet and keep them warm. Repeat with the remaining batter.\nStep 7: Serve the pancakes hot with maple syrup, fresh fruits, or your favorite toppings.",
      "img": "https://static.sscontent.com/thumb/500/500/products/124/v1122225_prozis_zero-instant-pancake-900-g_cappuccino_flavor_27.jpg"
    },
    {
      "id": 26,
      "title": "Miso Soup",
      "ingredients": "4 cups dashi stock, 3 tablespoons miso paste, 1 block silken tofu, diced, 2 green onions, thinly sliced, Wakame seaweed (optional),",
      "prepare": "Step 1: In a saucepan, bring the dashi stock to a simmer.\nStep 2: In a small bowl, whisk miso paste with a small amount of the hot stock until dissolved. Add the miso mixture to the saucepan.\nStep 3: Add diced tofu and wakame seaweed (if using) to the soup.\nStep 4: Simmer gently for a few minutes until heated through.\nStep 5: Serve the miso soup hot, garnished with sliced green onions.",
      "img": "https://assets.bonappetit.com/photos/58a6240fa9bc8a7a3f1cfada/1:1/w_3332,h_3332,c_limit/classic-miso-soup.jpg"
    },
    {
      "id": 27,
      "title": "Churrasco",
      "ingredients": "Yield: 4 servings FOR THE STEAK 1½pounds skirt steak or tri-tip (see Tip) 3large garlic cloves 1tablespoon fresh oregano leaves, finely chopped 1tablespoon white vinegar 2teaspoons olive oil 1tablespoon adobo seasoning (preferably Loísa or Badía brands) 1teaspoon kosher salt (such as Diamond Crystal), plus more to taste FOR THE WASAKAKA ⅓cup fresh lime juice ½cup fresh flat-leaf parsley leaves, finely chopped ¼cup fresh cilantro leaves, finely chopped ¼cup fresh oregano leaves, finely chopped ¼cup extra-virgin olive oil 2garlic cloves, minced ½teaspoon kosher salt (such as Diamond Crystal) ¼teaspoon freshly ground black pepper",
      "prepare": "Step 1 Pat the steaks dry and place in a large zip-top bag. Step 2 Combine the garlic, oregano, vinegar, olive oil, adobo seasoning and salt in the bowl of a pilón or mortar and pestle, or a small food processor. Grind into a thin paste, then pour the marinade over the steak. Zip the bag then shake well to coat the meat, rubbing in gently as needed. Let rest on the counter for 10 to 20 minutes, or refrigerate overnight if you have time. Be sure to let the steak come to room temperature before grilling. Step 3 If using a charcoal grill, start by building a fire with hardwood and kindling, then adding lump hardwood charcoal once the fire is kicking. Allow the fire to mellow. If using a gas grill, set the temperature to 500 degrees. Step 4 Meanwhile, make the wasakaka: Combine the lime juice, parsley, cilantro, oregano, olive oil, garlic, salt and pepper in a small bowl and whisk to incorporate. If you’d like a creamier sauce, blend in a small food processor or blender. (Wasakaka will keep for 3 or 4 days in a sealed jar in the refrigerator.) Step 5 Once the grill is ready, remove skirt steak from the bag and shake off excess marinade. Place on the grill and sear for 1 to 3 minutes. Using tongs, pull up the corner to ensure the steak has a good dark char, bordering on burned in places, before flipping, then cook for 1 more minute for rare, 2 minutes for medium-rare. Be careful not to overcook or steak will be tough. Step 6 Remove steak from grill and let rest for 5 to 7 minutes. Slice into strips and pour over wasakaka, or serve sauce on the side. Taste and sprinkle with additional salt, if desired.",
      "img": "https://www.foodandwine.com/thmb/neTnqsAufFlCoknUHD7uWdtZ1H8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/201307-xl-churrasco-with-chimichurri-2000-018a7d52dce54c60ba0fa9e03a156e49.jpg"
    },
    {
      "id": 28,
      "title": "Empanadas",
      "ingredients": "2 cups all-purpose flour, 1/2 teaspoon salt, 1/2 cup unsalted butter, chilled and diced, 1/4 cup ice water, 1 lb ground beef, 1 onion, chopped, 2 cloves garlic, minced, 1/2 teaspoon ground cumin, 1/2 teaspoon paprika, 1/4 teaspoon cayenne pepper (optional), Salt and pepper, to taste, 1/4 cup chopped olives, 2 boiled eggs, chopped, Egg wash (1 egg beaten with 1 tablespoon water),",
      "prepare": "Step 1: In a large bowl, combine flour and salt. Cut in the chilled butter until the mixture resembles coarse crumbs.\nStep 2: Gradually add ice water, mixing with a fork until the dough comes together.\nStep 3: Turn the dough out onto a lightly floured surface and knead gently until smooth. Wrap in plastic wrap and refrigerate for 30 minutes.\nStep 4: In a skillet, cook ground beef, chopped onion, and minced garlic until the beef is browned. Drain any excess fat.\nStep 5: Stir in ground cumin, paprika, cayenne pepper (if using), salt, and pepper. Cook for a few minutes.\nStep 6: Remove the skillet from heat and stir in chopped olives and boiled eggs.\nStep 7: Preheat the oven to 400°F (200°C) and line a baking sheet with parchment paper.\nStep 8: Roll out the chilled dough on a floured surface to a thickness of about 1/8 inch.\nStep 9: Cut out circles using a round cutter or a glass. Place a spoonful of the beef filling in the center of each circle.\nStep 10: Fold the circles in half and seal the edges by pressing with a fork.\nStep 11: Place the empanadas on the prepared baking sheet. Brush the tops with egg wash.\nStep 12: Bake for 20-25 minutes, or until golden brown.\nStep 13: Serve the empanadas hot as an appetizer or main dish.",
      "img": "https://www.foodandwine.com/thmb/ciU9ep7W0cgwvCqZP-b_yzEnphA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/200905-xl-mini-panamanian-beef-empanadas-f456fd1a540a45c992df0b1629c0cea0.jpg"
    },
    {
      "id": 29,
      "title": "Biryani",
      "ingredients": "2 cups basmati rice, 1 lb chicken, cut into pieces, 1 large onion, sliced, 2 cloves garlic, minced, 1-inch piece ginger, grated, 1 cup plain yogurt, 2 tablespoons biryani masala, 1/2 teaspoon turmeric powder, 1/2 teaspoon red chili powder, Salt, to taste, 2 tablespoons ghee or vegetable oil, 1 cinnamon stick, 2 cardamom pods, 4 cloves, 1 bay leaf, 1/2 cup chopped cilantro, 1/2 cup chopped mint leaves, Saffron strands soaked in milk (optional), Fried onions (optional),",
      "prepare": "Step 1: Rinse basmati rice under cold water until the water runs clear. Soak the rice in water for 30 minutes, then drain.\nStep 2: In a bowl, marinate chicken pieces with sliced onion, minced garlic, grated ginger, plain yogurt, biryani masala, turmeric powder, red chili powder, and salt. Let it marinate for at least 1 hour.\nStep 3: In a large pot, heat ghee or vegetable oil over medium heat. Add cinnamon stick, cardamom pods, cloves, and bay leaf. Sauté for a minute until fragrant.\nStep 4: Add the marinated chicken to the pot and cook until the chicken is browned and cooked through.\nStep 5: Remove the chicken from the pot and set aside.\nStep 6: In the same pot, add soaked and drained rice. Sauté for a few minutes until the rice is coated with the remaining spices and ghee/oil.\nStep 7: Add 4 cups of water to the pot and bring to a boil. Reduce the heat to low, cover the pot, and simmer for about 10-15 minutes, or until the rice is cooked and the water is absorbed.\nStep 8: In a serving dish, layer the cooked rice and the cooked chicken. Sprinkle chopped cilantro and mint leaves on top.\nStep 9: If desired, drizzle saffron-infused milk over the rice for added color and aroma. Top with fried onions.\nStep 10: Cover the dish and let it rest for 10 minutes before serving. Gently mix the layers together before serving.",
      "img": "https://norecipes.com/wp-content/uploads/2017/05/chicken-biryani-006.jpg"
    },
    {
      "id": 30,
      "title": "Sauerbraten",
      "ingredients": "3 lb beef roast (such as rump roast or bottom round), 1 onion, chopped, 2 carrots, chopped, 2 celery stalks, chopped, 2 cloves garlic, minced, 1 cup red wine vinegar, 1 cup water, 2 tablespoons brown sugar, 2 tablespoons whole grain mustard, 1 tablespoon pickling spices, Salt and pepper, to taste, 2 tablespoons vegetable oil, 1 cup beef broth, 1/2 cup sour cream, Chopped fresh parsley, for garnish",
      "prepare": "Step 1: In a large bowl, combine chopped onion, chopped carrots, chopped celery, minced garlic, red wine vinegar, water, brown sugar, whole grain mustard, pickling spices, salt, and pepper.\nStep 2: Place the beef roast in a resealable plastic bag or a glass dish. Pour the marinade mixture over the beef, ensuring it is fully covered. Marinate in the refrigerator for at least 24 hours, turning the meat occasionally.\nStep 3: Preheat the oven to 325°F (160°C).\nStep 4: Remove the beef from the marinade, reserving the marinade.\nStep 5: In a Dutch oven or oven-safe pot, heat vegetable oil over medium-high heat. Add the beef and brown on all sides.\nStep 6: Pour the reserved marinade and beef broth into the pot. Bring to a simmer.\nStep 7: Cover the pot and transfer it to the preheated oven. Cook for about 3-4 hours, or until the beef is tender and can be easily shredded with a fork.\nStep 8: Remove the beef from the pot and set aside. Strain the cooking liquid and discard the solids.\nStep 9: Return the strained liquid to the pot and bring to a simmer. Cook until the liquid is reduced and thickened.\nStep 10: Stir in sour cream until well combined.\nStep 11: Slice the beef and serve it with the sauce.\nStep 12: Garnish with chopped fresh parsley.",
      "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR99T6vmF0N1LEkldhvNotpfp-N-AX5BnGpU00qYvkoAaZAnc4ZxBUghZIQDDwORzIcuTw&usqp=CAU"
    },
    {
      "id": 31,
      "title": "Chicken Adobo",
      "ingredients": "2 lb chicken pieces (legs and thighs), 1/2 cup soy sauce, 1/2 cup vinegar, 1 cup water, 4 cloves garlic, minced, 2 bay leaves, 1 teaspoon whole black peppercorns, 1 tablespoon vegetable oil",
      "prepare": "Step 1: In a large pot or Dutch oven, combine soy sauce, vinegar, water, minced garlic, bay leaves, and whole black peppercorns.\nStep 2: Add the chicken pieces to the pot and bring the liquid to a boil.\nStep 3: Reduce the heat to low, cover the pot, and simmer for about 30-40 minutes, or until the chicken is cooked through and tender.\nStep 4: Remove the chicken from the pot and set aside.\nStep 5: In a separate skillet, heat vegetable oil over medium heat. Add the chicken pieces and cook until browned and crispy on both sides.\nStep 6: Serve the chicken adobo hot with steamed rice and the sauce spooned over the top.",
      "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTD3hEkMYbVgCFH4-Ym510cYcQzidR29yBMZF_Vfda4eNpcp0Uupxg7wER0b8OiooEsctE&usqp=CAU"
    },
    {
      "id": 32,
      "title": "Kimchi",
      "ingredients": "4 cups chicken or vegetable broth, 2 lemongrass stalks, bruised and chopped, 3-4 kaffir lime leaves, torn, 3 slices galangal or ginger, 8 oz shrimp, peeled and deveined, 8 oz mushrooms, sliced, 2 tablespoons fish sauce, 2 tablespoons lime juice, 1 tablespoon chili paste, 1 teaspoon sugar, Fresh cilantro leaves, for garnish",
      "prepare": "Step 1: In a large pot, bring the chicken or vegetable broth to a boil.\nStep 2: Add lemongrass, kaffir lime leaves, and galangal or ginger slices to the pot. Simmer for about 5 minutes to infuse the flavors.\nStep 3: Add shrimp and mushrooms to the pot. Cook until the shrimp are pink and cooked through.\nStep 4: Stir in fish sauce, lime juice, chili paste, and sugar. Taste and adjust the seasoning if needed.\nStep 5: Remove the pot from heat and ladle the soup into serving bowls.\nStep 6: Garnish with fresh cilantro leaves before serving.",
      "img": "https://i.pinimg.com/564x/c2/2f/c5/c22fc50681732f5281db565482576452.jpg"
    },
    {
      "id": 33,
      "title": "Baklava",
      "ingredients": "1 lb phyllo pastry sheets, 1 1/2 cups unsalted butter, melted, 2 cups chopped nuts (such as walnuts, pistachios, or almonds), 1 teaspoon ground cinnamon, 1/2 cup granulated sugar, 1/2 cup water, 1/2 cup honey, 1 teaspoon lemon juice",
      "prepare": "Step 1: Preheat the oven to 325°F (160°C).\nStep 2: In a bowl, combine chopped nuts, ground cinnamon, and granulated sugar.\nStep 3: Brush a baking dish with melted butter.\nStep 4: Place a sheet of phyllo pastry in the baking dish and brush it with melted butter.\nStep 5: Repeat the process, layering and buttering each sheet of phyllo pastry.\nStep 6: Sprinkle a layer of the nut mixture over the phyllo pastry.\nStep 7: Continue layering phyllo pastry and nuts until all the ingredients are used, ending with a final layer of phyllo pastry.\nStep 8: Using a sharp knife, cut the baklava into diamond or square shapes.\nStep 9: Bake in the preheated oven for about 45-50 minutes, or until golden brown.\nStep 10: While the baklava is baking, combine water, honey, and lemon juice in a saucepan. Bring to a boil and simmer for a few minutes.\nStep 11: Remove the baklava from the oven and immediately pour the honey syrup over the hot pastry.\nStep 12: Allow the baklava to cool completely before serving.",
      "img": "https://www.allrecipes.com/thmb/LC_td-hRsYLeMiOF6Y4Z9Ocv19E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9454-greek-baklava-s-tuttle-71eff77a5e3e4ceb94c1d48bafec55f1.jpeg"
    },
    {
      "id": 34,
      "title": "Rendang",
      "ingredients": "2 lb beef chuck or round, cut into cubes, 2 cans coconut milk (13.5 oz each), 4 tablespoons rendang curry paste, 2 lemongrass stalks, bruised, 4 kaffir lime leaves, torn, 2 tablespoons tamarind paste, 2 tablespoons brown sugar, Salt, to taste, Toasted coconut flakes, for garnish",
      "prepare": "Step 1: In a large pot, combine beef cubes, coconut milk, rendang curry paste, bruised lemongrass stalks, torn kaffir lime leaves, tamarind paste, brown sugar, and salt.\nStep 2: Bring the mixture to a boil, then reduce the heat to low and simmer for about 2-3 hours, or until the beef is tender and the sauce has thickened.\nStep 3: Stir occasionally to prevent sticking.\nStep 4: Remove the pot from heat and let the rendang rest for a few minutes.\nStep 5: Serve the rendang hot, garnished with toasted coconut flakes.\nStep 6: Rendang is traditionally served with steamed rice.",
      "img": "https://rasamalaysia.com/wp-content/uploads/2018/04/beef-rendang-thumb.jpg"
    },
    {
      "id": 35,
      "title": "Cacio e Pepe",
      "ingredients": "8 oz spaghetti or bucatini, 2 tablespoons unsalted butter, 1 tablespoon extra-virgin olive oil, 1 cup grated Parmesan cheese, 1/2 cup grated Pecorino Romano cheese, Freshly ground black pepper, to taste",
      "prepare": "Step 1: Cook spaghetti or bucatini according to package instructions until al dente. Reserve 1 cup of the pasta cooking water.\nStep 2: In a skillet, melt butter and olive oil over medium heat.\nStep 3: Add cooked pasta to the skillet, along with grated Parmesan cheese, grated Pecorino Romano cheese, and freshly ground black pepper.\nStep 4: Toss the pasta until the cheeses are melted and the sauce is creamy. Add pasta cooking water as needed to achieve the desired consistency.\nStep 5: Serve the cacio e pepe immediately, garnished with additional black pepper.",
      "img": "https://www.recipesfromitaly.com/wp-content/uploads/2022/04/spaghetti-cacio-e-pepe-recipe-1x1-1200x1200-b.jpg"
    },
    {
      "id": 36,
      "title": "Peking Duck",
      "ingredients": "1 whole duck (about 4-5 lb), 2 tablespoons Chinese five-spice powder, Salt, to taste, 1 tablespoon honey, 1 tablespoon soy sauce, 1 tablespoon hoisin sauce, 1 cucumber, julienned, 8-12 Mandarin pancakes or tortillas",
      "prepare": "Step 1: Preheat the oven to 300°F (150°C).\nStep 2: Rinse the whole duck inside and out, then pat dry with paper towels.\nStep 3: Rub Chinese five-spice powder and salt all over the duck, including the cavity.\nStep 4: Place the duck on a rack in a roasting pan and roast in the preheated oven for about 2-3 hours, or until the skin is crispy and the meat is tender.\nStep 5: In a small bowl, mix honey, soy sauce, and hoisin sauce.\nStep 6: Remove the duck from the oven and brush the honey-soy mixture over the skin.\nStep 7: Let the duck rest for a few minutes, then carve into thin slices.\nStep 8: Serve the Peking duck with julienned cucumber and Mandarin pancakes or tortillas.\nStep 9: To eat, spread hoisin sauce on a pancake or tortilla, top with slices of duck and cucumber, and roll it up.",
      "img": "https://redhousespice.com/wp-content/uploads/2022/01/sliced-peking-duck-with-pancakes-scaled.jpg"
    },
    {
      "id": 37,
      "title": "Fajitas",
      "ingredients": "1 lb chicken or beef, sliced, 1 onion, sliced, 1 bell pepper, sliced, 2 tablespoons vegetable oil, 2 cloves garlic, minced, 1 teaspoon chili powder, 1/2 teaspoon cumin, 1/2 teaspoon paprika, Salt and pepper, to taste, Flour tortillas, Salsa, Guacamole, Sour cream, Shredded cheese, Chopped cilantro, for garnish",
      "prepare": "Step 1: In a skillet, heat vegetable oil over medium-high heat.\nStep 2: Add sliced chicken or beef to the skillet and cook until browned and cooked through.\nStep 3: Remove the cooked meat from the skillet and set aside.\nStep 4: In the same skillet, add sliced onion, sliced bell pepper, minced garlic, chili powder, cumin, paprika, salt, and pepper. Sauté until the vegetables are softened.\nStep 5: Return the cooked meat to the skillet and toss with the sautéed vegetables.\nStep 6: Warm flour tortillas in a dry skillet or microwave.\nStep 7: Serve the fajita filling on warm tortillas.\nStep 8: Garnish with salsa, guacamole, sour cream, shredded cheese, and chopped cilantro.\nStep 9: Roll up the tortillas and enjoy the fajitas.",
      "img": "https://joyfoodsunshine.com/wp-content/uploads/2022/03/chicken-fajitas-recipe-square.jpg"
    },
    {
      "id": 38,
      "title": "Chicken Shawarma",
      "ingredients": "1 lb boneless, skinless chicken thighs, 1/4 cup Greek yogurt, 2 tablespoons olive oil, 2 tablespoons lemon juice, 4 cloves garlic, minced, 1 tablespoon ground cumin, 1 tablespoon ground coriander, 1 teaspoon paprika, 1/2 teaspoon turmeric, Salt and pepper, to taste, Pita bread, Tzatziki sauce, Chopped tomatoes, Chopped cucumbers, Chopped lettuce, Chopped parsley,",
      "prepare": "Step 1: In a bowl, combine Greek yogurt, olive oil, lemon juice, minced garlic, ground cumin, ground coriander, paprika, turmeric, salt, and pepper.\nStep 2: Add boneless, skinless chicken thighs to the bowl and toss to coat the chicken in the marinade.\nStep 3: Cover the bowl and marinate the chicken in the refrigerator for at least 1 hour, or overnight for more flavor.\nStep 4: Preheat a grill or grill pan over medium-high heat.\nStep 5: Remove the chicken from the marinade and grill for about 6-8 minutes per side, or until cooked through.\nStep 6: Remove the chicken from the grill and let it rest for a few minutes.\nStep 7: Slice the chicken into thin strips.\nStep 8: Warm pita bread and spread tzatziki sauce on each pita.\nStep 9: Fill the pita with sliced chicken, chopped tomatoes, chopped cucumbers, chopped lettuce, and chopped parsley.\nStep 10: Roll up the pita and serve the chicken shawarma immediately.",
      "img": "https://www.thechunkychef.com/wp-content/uploads/2021/03/Chicken-Shawarma-recipe-card.jpg"
    },
    {
      "id": 39,
      "title": "Chimichurri",
      "ingredients": "1 cup fresh parsley, packed, 1/2 cup fresh cilantro, packed, 4 cloves garlic, minced, 2 tablespoons fresh oregano leaves, 1/4 cup red wine vinegar, 1/2 cup extra-virgin olive oil, 1 teaspoon red pepper flakes, Salt and pepper, to taste",
      "prepare": "Step 1: In a food processor, combine fresh parsley, fresh cilantro, minced garlic, fresh oregano leaves, red wine vinegar, extra-virgin olive oil, red pepper flakes, salt, and pepper.\nStep 2: Pulse the ingredients until well blended and the sauce reaches your desired consistency.\nStep 3: Taste and adjust the seasoning if needed.\nStep 4: Transfer the chimichurri sauce to a jar or bowl and let it sit at room temperature for at least 30 minutes to allow the flavors to meld.\nStep 5: Serve the chimichurri sauce as a condiment or marinade for grilled meats.",
      "img": "https://natashaskitchen.com/wp-content/uploads/2022/07/Chimichurri-Sauce-SQ-1.jpg"
    },
    {
      "id": 40,
      "title": "Tom Kha Gai",
      "ingredients": "4 cups chicken or vegetable broth, 2 cans coconut milk (13.5 oz each), 2 lemongrass stalks, bruised and chopped, 4 kaffir lime leaves, torn, 2 slices galangal or ginger, 1 lb chicken breast, thinly sliced, 8 oz mushrooms, sliced, 2 tablespoons fish sauce, 2 tablespoons lime juice, 1 tablespoon brown sugar, Thai chilies, sliced (optional), Fresh cilantro leaves, for garnish",
      "prepare": "Step 1: In a large pot, bring chicken or vegetable broth to a boil.\nStep 2: Add coconut milk, lemongrass, kaffir lime leaves, and galangal or ginger slices to the pot. Simmer for about 5 minutes to infuse the flavors.\nStep 3: Add thinly sliced chicken breast and sliced mushrooms to the pot. Cook until the chicken is cooked through.\nStep 4: Stir in fish sauce, lime juice, brown sugar, and Thai chilies (if using). Taste and adjust the seasoning if needed.\nStep 5: Remove the pot from heat and ladle the soup into serving bowls.\nStep 6: Garnish with fresh cilantro leaves before serving.",
      "img": "https://hot-thai-kitchen.com/wp-content/uploads/2014/06/Tom-kha-gai-new-sq.jpg"
    },
    {
      "id": 41,
      "title": "Sauerbraten, do tommor the recipe inside",
      "ingredients": "1 head romaine lettuce, torn into bite-sized pieces, 1/2 cup Caesar dressing, 1/4 cup grated Parmesan cheese, 1/2 cup croutons",
      "prepare": "Step 1: In a large salad bowl, combine torn romaine lettuce, Caesar dressing, and grated Parmesan cheese.\nStep 2: Toss the salad until the lettuce leaves are evenly coated with dressing.\nStep 3: Add croutons and toss again.\nStep 4: Serve the Caesar salad immediately.",
      "img": "https://houseofnasheats.com/wp-content/uploads/2022/09/German-Sauerbraten-Recipe-Square-1.jpg"
    },
    {
      "id": 42,
      "title": "Risotto",
      "ingredients": "4 cups chicken or vegetable broth, 2 tablespoons unsalted butter, 1 small onion, finely chopped, 1 1/2 cups Arborio rice, 1/2 cup dry white wine, 1/2 cup grated Parmesan cheese, Salt and pepper, to taste",
      "prepare": "Step 1: In a saucepan, bring chicken or vegetable broth to a simmer.\nStep 2: In a large skillet or saucepan, melt unsalted butter over medium heat. Add finely chopped onion and sauté until translucent.\nStep 3: Add Arborio rice to the skillet and stir to coat the rice with the melted butter.\nStep 4: Pour in dry white wine and cook until it is absorbed by the rice.\nStep 5: Begin adding the simmering broth to the skillet, about 1/2 cup at a time, stirring frequently. Allow the broth to be absorbed before adding more.\nStep 6: Continue adding broth and stirring until the rice is cooked al dente and creamy in texture. This process will take about 20-25 minutes.\nStep 7: Remove the skillet from heat and stir in grated Parmesan cheese. Season with salt and pepper to taste.\nStep 8: Let the risotto rest for a few minutes before serving.",
      "img": "https://hips.hearstapps.com/hmg-prod/images/delish-191112-risotto-rice-0151-landscape-pf-1574723947.jpg?crop=0.668xw:1.00xh;0.151xw,0&resize=1200:*"
    },
    {
      "id": 43,
      "title": "Jerk Chicken",
      "ingredients": "2 lb chicken pieces (legs and thighs), 1/4 cup soy sauce, 1/4 cup lime juice, 2 tablespoons brown sugar, 2 tablespoons vegetable oil, 2 tablespoons jerk seasoning, 2 cloves garlic, minced, 1 teaspoon dried thyme, 1 teaspoon ground allspice, 1 teaspoon paprika, 1/2 teaspoon cayenne pepper, Salt and pepper, to taste",
      "prepare": "Step 1: In a bowl, combine soy sauce, lime juice, brown sugar, vegetable oil, jerk seasoning, minced garlic, dried thyme, ground allspice, paprika, cayenne pepper, salt, and pepper.\nStep 2: Add chicken pieces to the bowl and toss to coat the chicken in the marinade.\nStep 3: Cover the bowl and marinate the chicken in the refrigerator for at least 1 hour, or overnight for more flavor.\nStep 4: Preheat a grill or grill pan over medium-high heat.\nStep 5: Remove the chicken from the marinade and grill for about 6-8 minutes per side, or until cooked through and charred.\nStep 6: Remove the chicken from the grill and let it rest for a few minutes before serving.",
      "img": "https://foreignfork.com/wp-content/uploads/2023/03/Jerkchicken-FEATURE.jpg"
    },
    {
      "id": 44,
      "title": "Sashimi",
      "ingredients": "Assorted fresh fish (such as tuna, salmon, yellowtail), Soy sauce, Wasabi paste, Pickled ginger",
      "prepare": "Step 1: Use a sharp knife to thinly slice fresh fish into bite-sized pieces.\nStep 2: Arrange the sliced fish on a serving platter.\nStep 3: Serve the sashimi with soy sauce, wasabi paste, and pickled ginger on the side.\nStep 4: Dip the sashimi in soy sauce and add a small amount of wasabi and pickled ginger as desired.",
      "img": "https://aubreyskitchen.com/wp-content/uploads/2021/01/salmon-sashimi-recipe.jpg"
    },
    {
      "id": 45,
      "title": "GGoulash (Czech Republic)",
      "ingredients": "2 lb beef chuck, cut into cubes, 2 onions, chopped, 2 cloves garlic, minced, 2 tablespoons paprika, 1 teaspoon caraway seeds, 2 tablespoons tomato paste, 4 cups beef broth, Salt and pepper, to taste, Sour cream, Chopped fresh parsley, for garnish",
      "prepare": "Step 1: In a large pot or Dutch oven, heat oil over medium-high heat. Add beef cubes and brown on all sides.\nStep 2: Remove the beef from the pot and set aside.\nStep 3: In the same pot, add chopped onions and minced garlic. Sauté until the onions are softened.\nStep 4: Stir in paprika, caraway seeds, and tomato paste. Cook for a minute.\nStep 5: Return the beef to the pot and add beef broth.\nStep 6: Season with salt and pepper to taste.\nStep 7: Bring the mixture to a boil, then reduce the heat to low. Cover the pot and simmer for about 2-3 hours, or until the beef is tender and the flavors have melded together.\nStep 8: Serve the goulash hot, garnished with a dollop of sour cream and chopped fresh parsley.\nStep 9: Goulash is traditionally served with crusty bread or spaetzle.",
      "img": "https://iwashyoudry.com/wp-content/uploads/2021/01/American-Goulash-Recipe.jpg"
    },
    {
      "id": 46,
      "title": "Lobster Thermidor",
      "ingredients": "2 lobster tails, 2 tablespoons unsalted butter, 2 tablespoons all-purpose flour, 1 cup milk, 1/4 cup grated Parmesan cheese, 2 tablespoons Dijon mustard, 2 tablespoons chopped fresh parsley, Salt and pepper, to taste,",
      "prepare": "Step 1: Preheat the oven to 400°F (200°C).\nStep 2: Cut the lobster tails in half lengthwise, exposing the meat.\nStep 3: In a skillet, melt butter over medium heat. Stir in all-purpose flour to make a roux.\nStep 4: Gradually whisk in milk and cook until the mixture thickens.\nStep 5: Stir in grated Parmesan cheese, Dijon mustard, chopped fresh parsley, salt, and pepper.\nStep 6: Place the lobster tails, cut side up, in a baking dish.\nStep 7: Spoon the sauce over the lobster meat.\nStep 8: Bake in the preheated oven for about 12-15 minutes, or until the lobster is cooked through and the sauce is bubbly and golden.\nStep 9: Serve the lobster thermidor hot, garnished with additional chopped parsley.",
      "img": "https://www.allrecipes.com/thmb/TJGN4XRTzS-Od50oun5I8uPMx20=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3697243-cea8737b5a3e48bc8bb0a94bbf50ad94.jpg"
    },
    {
      "id": 47,
      "title": "Chicken Rice",
      "ingredients": "1 lb chicken thighs, 2 cups jasmine rice, 4 cups chicken broth, 2 tablespoons vegetable oil, 2 cloves garlic, minced, 1 thumb-sized piece of ginger, grated, Salt, to taste, Sliced cucumber, for serving, Chopped cilantro, for garnish",
      "prepare": "Step 1: In a pot, bring chicken broth to a boil.\nStep 2: Add chicken thighs to the pot and simmer for about 20 minutes, or until cooked through. Remove the chicken from the pot and set aside.\nStep 3: Rinse jasmine rice under cold water until the water runs clear. Drain well.\nStep 4: In a separate pot, heat vegetable oil over medium heat. Add minced garlic and grated ginger. Sauté until fragrant.\nStep 5: Add the drained jasmine rice to the pot and stir to coat the rice with the garlic and ginger.\nStep 6: Pour the chicken broth (from cooking the chicken) into the pot with the rice. Bring to a boil.\nStep 7: Reduce the heat to low, cover the pot, and simmer for about 15-20 minutes, or until the rice is cooked and the liquid is absorbed.\nStep 8: While the rice is cooking, shred the cooked chicken into bite-sized pieces.\nStep 9: Serve the chicken rice hot, garnished with sliced cucumber and chopped cilantro.",
      "img": "https://keytomylime.com/wp-content/uploads/2021/08/Best-Southern-Chicken-and-Rice-Recipe-735x735.jpg"
    },
    {
      "id": 48,
      "title": "Cannoli",
      "ingredients": "1 cup all-purpose flour, 1 tablespoon granulated sugar, 1/4 teaspoon salt, 2 tablespoons unsalted butter, melted, 1/4 cup white wine, 1 egg white, beaten, 1 cup ricotta cheese, 1/2 cup powdered sugar, 1/4 cup mini chocolate chips, Candied fruit or pistachios, for garnish",
      "prepare": "Step 1: In a bowl, combine all-purpose flour, granulated sugar, and salt.\nStep 2: Add melted butter and white wine to the bowl and mix until a dough forms.\nStep 3: On a lightly floured surface, knead the dough until smooth.\nStep 4: Wrap the dough in plastic wrap and let it rest for 30 minutes.\nStep 5: Preheat the oil in a deep fryer or a large pot to 375°F (190°C).\nStep 6: Roll out the dough on a floured surface to a thickness of about 1/8 inch.\nStep 7: Cut the dough into circles or rectangles, depending on your preference.\nStep 8: Wrap each piece of dough around a cannoli tube, sealing the edges with beaten egg white.\nStep 9: Carefully place the wrapped cannoli tubes into the hot oil and fry until golden brown and crisp. This will take about 2-3 minutes.\nStep 10: Remove the fried cannoli shells from the oil and let them cool on a wire rack.\nStep 11: In a bowl, combine ricotta cheese, powdered sugar, and mini chocolate chips.\nStep 12: Fill the cooled cannoli shells with the ricotta mixture, using a piping bag or a spoon.\nStep 13: Garnish the cannoli with candied fruit or pistachios.\nStep 14: Serve the cannoli immediately.",
      "img": "https://www.barleyandsage.com/wp-content/uploads/2021/07/40-1.jpg"
    },
    {
      "id": 49,
      "title": "Moules Frites",
      "ingredients": "2 lb mussels, cleaned and debearded, 2 tablespoons unsalted butter, 1 onion, finely chopped, 2 cloves garlic, minced, 1 cup white wine, 1 cup chicken or vegetable broth, 1/2 cup heavy cream, Chopped fresh parsley, for garnish, French fries, for serving",
      "prepare": "Step 1: In a large pot or Dutch oven, melt butter over medium heat.\nStep 2: Add finely chopped onion and minced garlic to the pot. Sauté until the onions are softened.\nStep 3: Add cleaned and debearded mussels to the pot.\nStep 4: Pour in white wine and chicken or vegetable broth.\nStep 5: Cover the pot and cook for about 5-7 minutes, or until the mussels have opened. Discard any mussels that remain closed.\nStep 6: Remove the mussels from the pot with a slotted spoon and set them aside.\nStep 7: Stir in heavy cream into the cooking liquid.\nStep 8: Cook the liquid for a few minutes until it thickens slightly.\nStep 9: Return the mussels to the pot and toss them in the sauce to coat.\nStep 10: Sprinkle chopped fresh parsley over the mussels.\nStep 11: Serve the moules frites hot, accompanied by French fries.",
      "img": "https://www.eatingwell.com/thmb/DGoyd1RLAAC3p5X4HjqD6PN2pkQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/moules-frites-443a548a335a4b97936aa050feabeee1.jpg"
    },
    {
      "id": 50,
      "title": "Ravioli",
      "ingredients": "1 package store-bought ravioli, 2 tablespoons unsalted butter, 2 cloves garlic, minced, 1 cup heavy cream, 1/2 cup grated Parmesan cheese, Salt and pepper, to taste, Chopped fresh parsley, for garnish",
      "prepare": "Step 1: Cook the store-bought ravioli according to package instructions.\nStep 2: In a skillet, melt butter over medium heat. Add minced garlic and sauté until fragrant.\nStep 3: Pour in heavy cream and bring to a simmer.\nStep 4: Stir in grated Parmesan cheese and cook until the sauce thickens.\nStep 5: Season the sauce with salt and pepper to taste.\nStep 6: Drain the cooked ravioli and add them to the skillet with the sauce.\nStep 7: Toss the ravioli in the sauce until well coated.\nStep 8: Serve the ravioli hot, garnished with chopped fresh parsley.",
      "img": "https://tmbidigitalassetsazure.blob.core.windows.net/rms3-prod/attachments/37/1200x1200/exps41527_CS143613B11_11_8b.jpg"
    },
    {
      "id": 51,
      "title": "Carbonara (Italy)",
      "ingredients": "Ingredients:\n- 12 ounces spaghetti\n- 4 large eggs\n- 1 cup grated Pecorino Romano cheese\n- 1 cup grated Parmesan cheese\n- 6 ounces pancetta or guanciale, diced\n- 4 cloves garlic, minced\n- Freshly ground black pepper\n- Salt to taste",
      "prepare": "Preparation:\n1. Cook spaghetti in a large pot of boiling salted water until al dente. Drain, reserving 1/2 cup of pasta water.\n2. In a bowl, whisk together eggs, Pecorino Romano cheese, and Parmesan cheese. Season with black pepper.\n3. In a skillet, cook pancetta or guanciale over medium heat until crispy. Add minced garlic and cook for another minute.\n4. Add cooked spaghetti to the skillet and toss to coat with the pancetta and garlic.\n5. Remove from heat and quickly stir in the egg and cheese mixture. The heat from the pasta will cook the eggs, creating a creamy sauce.\n6. If the sauce is too thick, add some of the reserved pasta water to achieve the desired consistency.\n7. Serve immediately with extra grated cheese and black pepper on top.",
      "img": "https://www.eatingwell.com/thmb/yL0Cp83QzS8uPIj-c04yGb5nfoE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4177366-7c61e0b04ab6490584e4b9f7556bdc0e.jpg"
    },
    {
      "id": 52,
      "title": "Chicken Adobo (Philippines)",
      "ingredients": "Ingredients:\n- 2 pounds chicken thighs and/or drumsticks\n- 1/2 cup soy sauce\n- 1/2 cup vinegar (cane or rice vinegar preferred)\n- 1 cup water\n- 4-6 cloves garlic, minced\n- 1 bay leaf\n- 1 teaspoon black peppercorns\n- 1 tablespoon cooking oil\n- Optional: 1 teaspoon brown sugar for a slightly sweeter adobo",
      "prepare": "Preparation:\n1. In a large bowl or ziplock bag, combine chicken, soy sauce, vinegar, water, minced garlic, bay leaf, and black peppercorns.\n2. Marinate the chicken in the refrigerator for at least 1 hour (overnight for best results).\n3. Heat oil in a large skillet or pot over medium-high heat. Remove the chicken from the marinade and reserve the marinade.\n4. Brown the chicken on all sides until it develops a nice caramelized color.\n5. Pour in the reserved marinade and bring it to a boil. Reduce the heat to low, cover, and let it simmer for about 30-40 minutes or until the chicken is tender.\n6. If using, add the brown sugar and stir until it dissolves.\n7. Serve the chicken adobo with steamed rice and drizzle with some of the adobo sauce.",
      "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTv0sC1OOLE80wF1ZUqTAYtz-kznhXlhmYZFMIRhKc5JnhDXyk3iPSo7hKNr4J50I8DVr4&usqp=CAU"
    },
    {
      "id": 53,
      "title": "Spanakopita (Greece)",
      "ingredients": "Ingredients:\n- 1 pound fresh spinach, chopped\n- 1/2 cup feta cheese, crumbled\n- 1/2 cup ricotta cheese\n- 1/4 cup grated Parmesan cheese\n- 2 green onions, finely chopped\n- 2 tablespoons fresh dill, chopped\n- 2 tablespoons fresh parsley, chopped\n- 2 eggs, lightly beaten\n- Salt and pepper to taste\n- 1 package phyllo dough\n- 1/2 cup melted butter or olive oil",
      "prepare": "Preparation:\n1. Preheat the oven to 350°F (175°C).\n2. In a large bowl, mix together chopped spinach, feta cheese, ricotta cheese, grated Parmesan cheese, green onions, dill, parsley, and beaten eggs.\n3. Season the mixture with salt and pepper to taste.\n4. Unroll the phyllo dough and cover it with a damp towel to prevent it from drying out.\n5. Take one sheet of phyllo dough and brush it with melted butter or olive oil. Place another sheet on top and repeat the process until you have a stack of 4-5 sheets.\n6. Spoon some of the spinach and cheese mixture onto the phyllo stack and spread it evenly.\n7. Roll up the phyllo stack into a log, folding in the sides to seal the filling.\n8. Repeat the process with the remaining phyllo dough and filling.\n9. Place the spanakopita rolls on a baking sheet and brush the tops with more melted butter or olive oil.\n10. Bake in the preheated oven for about 25-30 minutes or until the spanakopita is golden and crispy.\n11. Serve warm as an appetizer or side dish.",
      "img": "https://meltemicatering.com/wp-content/uploads/2019/11/spanakopita3.jpg"
    },
    {
      "id": 54,
      "title": "Beef Stroganoff (Russia)",
      "ingredients": "Ingredients:\n- 1 pound beef sirloin or tenderloin, thinly sliced\n- 1 onion, finely chopped\n- 2 tablespoons butter\n- 2 cups mushrooms, sliced\n- 1 cup beef broth\n- 1 tablespoon Dijon mustard\n- 1 tablespoon all-purpose flour\n- 1 cup sour cream\n- Salt and pepper to taste\n- Chopped fresh parsley for garnish\n- Cooked egg noodles or rice for serving",
      "prepare": "Preparation:\n1. In a large skillet, melt the butter over medium-high heat. Add the chopped onion and cook until it becomes translucent.\n2. Add the sliced beef to the skillet and cook until it is browned on all sides. Season with salt and pepper.\n3. Stir in the sliced mushrooms and cook until they are tender and lightly browned.\n4. Sprinkle the flour over the meat and mushrooms and stir to coat everything evenly.\n5. Pour in the beef broth and Dijon mustard. Stir well and bring the mixture to a simmer.\n6. Lower the heat to medium and let the stroganoff simmer for about 5 minutes.\n7. Stir in the sour cream, making sure it is well incorporated into the sauce.\n8. Adjust the seasoning with salt and pepper to taste.\n9. Serve the beef stroganoff over cooked egg noodles or rice.\n10. Garnish with chopped fresh parsley before serving.",
      "img": "https://www.slimmingeats.com/blog/wp-content/uploads/2010/01/beef-stroganoff-5-1.jpg"
    },
    {
      "id": 55,
      "title": "Tandoori Chicken (India)",
      "ingredients": "Ingredients:\n- 2 pounds chicken drumsticks or thighs\n- 1 cup plain yogurt\n- 2 tablespoons tandoori masala spice mix\n- 1 tablespoon paprika\n- 1 tablespoon ground cumin\n- 1 tablespoon ground coriander\n- 1 tablespoon garam masala\n- 2 tablespoons lemon juice\n- 4 cloves garlic, minced\n- 1-inch piece of ginger, grated\n- 1/4 cup vegetable oil\n- Salt to taste\n- Lemon wedges and cilantro for garnish",
      "prepare": "Preparation:\n1. In a large bowl, combine yogurt, tandoori masala, paprika, ground cumin, ground coriander, garam masala, lemon juice, minced garlic, grated ginger, vegetable oil, and salt.\n2. Make deep cuts in the chicken pieces with a knife to allow the marinade to penetrate.\n3. Add the chicken to the marinade, making sure each piece is coated. Cover the bowl and let it marinate in the refrigerator for at least 2 hours (overnight is best).\n4. Preheat the oven to 450°F (230°C).\n5. Place a wire rack on a baking sheet and arrange the marinated chicken pieces on the rack.\n6. Bake the chicken in the preheated oven for about 25-30 minutes or until it is cooked through and has a slightly charred appearance.\n7. Serve the tandoori chicken with lemon wedges and garnish with fresh cilantro.",
      "img": "https://images.getrecipekit.com/20221111163822-2.png?aspect_ratio=1:1&quality=90&"
    },
    {
      "id": 56,
      "title": "Shrimp Scampi (Italy)",
      "ingredients": "Ingredients:\n- 1 pound large shrimp, peeled and deveined\n- 8 ounces linguine or spaghetti\n- 4 tablespoons unsalted butter\n- 2 tablespoons olive oil\n- 4 cloves garlic, minced\n- 1/4 teaspoon red pepper flakes (optional)\n- 1/4 cup dry white wine\n- 1/4 cup chicken broth\n- 1 tablespoon lemon juice\n- Zest of 1 lemon\n- 1/4 cup chopped fresh parsley\n- Salt and pepper to taste",
      "prepare": "Preparation:\n1. Cook the linguine or spaghetti according to package instructions until al dente. Drain and set aside.\n2. In a large skillet, melt butter with olive oil over medium heat.\n3. Add minced garlic and red pepper flakes (if using) to the skillet. Cook for about 1 minute until the garlic becomes fragrant.\n4. Add the shrimp to the skillet and cook for 2-3 minutes on each side until they turn pink and are cooked through. Season with salt and pepper.\n5. Remove the shrimp from the skillet and set aside.\n6. Pour white wine and chicken broth into the skillet, scraping the bottom to deglaze it.\n7. Let the liquid simmer for a minute or two until it reduces slightly.\n8. Stir in lemon juice and lemon zest.\n9. Return the cooked shrimp to the skillet and toss everything together.\n10. Add the cooked linguine or spaghetti to the skillet and toss until it is well coated with the sauce.\n11. Remove the skillet from heat and sprinkle chopped fresh parsley over the shrimp scampi.\n12. Serve immediately as a delicious and flavorful pasta dish.",
      "img": "https://images.slurrp.com/prod/recipe_images/eatingwell/fennel-shrimp-fra-diavolo-1621865361_CHLVJ6LZEYFH7EA7G9WE.webp?impolicy=slurrp-20210601&width=1200&height=900&q=75"
    },
    {
      "id": 57,
      "title": "Bibimbap (Korea)",
      "ingredients": "Ingredients:\n- 2 cups cooked short-grain rice\n- 1 cup sliced beef (bulgogi) or tofu for a vegetarian option\n- 1 carrot, julienned\n- 1 zucchini, julienned\n- 1 cup spinach\n- 1 cup bean sprouts\n- 2 tablespoons sesame oil\n- 2 tablespoons soy sauce\n- 2 cloves garlic, minced\n- 2 teaspoons sugar\n- 2 tablespoons gochujang (Korean red pepper paste)\n- 2 teaspoons sesame seeds\n- 2 fried eggs\n- Thinly sliced cucumber and radish for garnish",
      "img": "https://www.196flavors.com/wp-content/uploads/2012/11/dolsot-bibimbap-FP1.jpg"
    },
    {
      "id": 58,
      "title": "Chicken Paprikash (Hungary)",
      "ingredients": "Ingredients:\n- 2 pounds chicken thighs and/or drumsticks\n- 2 large onions, finely chopped\n- 2 tablespoons vegetable oil\n- 2 tablespoons sweet Hungarian paprika\n- 1 teaspoon hot Hungarian paprika (optional)\n- 2 cups chicken broth\n- 1 cup sour cream\n- Salt and pepper to taste\n- Cooked egg noodles or rice for serving\n- Chopped fresh parsley for garnish",
      "prepare": "Preparation:\n1. Season the chicken thighs and drumsticks with salt and pepper.\n2. In a large pot or Dutch oven, heat vegetable oil over medium-high heat.\n3. Add chopped onions and sauté until they become translucent.\n4. Stir in sweet Hungarian paprika and optional hot Hungarian paprika, and cook for a minute to release the flavors.\n5. Add the chicken pieces to the pot and brown them on all sides.\n6. Pour in the chicken broth, cover the pot, and let the chicken simmer for about 25-30 minutes or until it is cooked through and tender.\n7. Remove the chicken from the pot and set it aside.\n8. Stir in the sour cream into the sauce, whisking until it is smooth.\n9. Return the chicken to the pot and coat it with the creamy paprika sauce.\n10. Serve the chicken paprikash over cooked egg noodles or rice.\n11. Garnish with chopped fresh parsley before serving.",
      "img": "https://i.pinimg.com/564x/01/5b/d1/015bd1d5d5a505115d33df910a4a189b.jpg"
    },
    {
      "id": 59,
      "title": "Goulash (Hungary)",
      "ingredients": "Ingredients:\n- 2 pounds beef stew meat, cubed\n- 2 large onions, finely chopped\n- 2 tablespoons vegetable oil\n- 2 tablespoons sweet Hungarian paprika\n- 1 teaspoon caraway seeds\n- 3 cloves garlic, minced\n- 2 tablespoons tomato paste\n- 4 cups beef broth\n- 2 large potatoes, peeled and cubed\n- 1 red bell pepper, chopped\n- 1 green bell pepper, chopped\n- Salt and pepper to taste\n- Sour cream for serving\n- Chopped fresh parsley for garnish",
      "prepare": "Preparation:\n1. In a large pot or Dutch oven, heat vegetable oil over medium-high heat.\n2. Add chopped onions and sauté until they become translucent.\n3. Stir in sweet Hungarian paprika, caraway seeds, and minced garlic, and cook for a minute to release the flavors.\n4. Add the beef stew meat to the pot and brown it on all sides.\n5. Stir in tomato paste and cook for another minute.\n6. Pour in the beef broth and bring the mixture to a boil.\n7. Reduce the heat to low, cover the pot, and let the goulash simmer for about 1.5 to 2 hours or until the beef is tender.\n8. Add the cubed potatoes, red bell pepper, and green bell pepper to the pot.\n9. Continue to simmer for another 30 minutes or until the vegetables are cooked through.\n10. Adjust the seasoning with salt and pepper to taste.\n11. Serve the goulash hot, garnished with a dollop of sour cream and chopped fresh parsley.\n12. Enjoy this hearty and flavorful Hungarian stew!",
      "img": "https://i.pinimg.com/564x/48/dd/b3/48ddb36e490778d7762c813a7c6de3c7.jpg"
    },
    {
      "id": 60,
      "title": "Chicken Tandoori (India)",
      "ingredients": "Ingredients:\n- 2 pounds chicken drumsticks or thighs\n- 1 cup plain yogurt\n- 2 tablespoons lemon juice\n- 4 cloves garlic, minced\n- 1-inch piece of ginger, grated\n- 1 tablespoon garam masala\n- 1 tablespoon ground cumin\n- 1 tablespoon ground coriander\n- 1 tablespoon ground turmeric\n- 1 tablespoon paprika\n- 1/2 teaspoon cayenne pepper (adjust to your spice preference)\n- 1 teaspoon salt\n- Vegetable oil for brushing\n- Lemon wedges and cilantro for garnish",
      "img": "https://i.pinimg.com/564x/2c/56/16/2c5616accfc0a66e2e1654b6a9ad0078.jpg"
    },
    {
      "id": 61,
      "title": "Caesar Salad (United States)",
      "ingredients": "Ingredients:\n- 1 head romaine lettuce, washed and torn into bite-sized pieces\n- 1/2 cup Caesar dressing (store-bought or homemade)\n- 1/4 cup grated Parmesan cheese\n- 1 cup croutons\n- 2 tablespoons lemon juice\n- 1 tablespoon Dijon mustard\n- 2 cloves garlic, minced\n- 1/4 cup olive oil\n- Salt and pepper to taste\n- Optional: anchovies and boiled egg for additional toppings",
      "prepare": "Preparation:\n1. In a small bowl, whisk together lemon juice, Dijon mustard, minced garlic, olive oil, salt, and pepper to create the Caesar dressing.\n2. In a large salad bowl, add torn romaine lettuce, grated Parmesan cheese, and croutons.\n3. Pour the Caesar dressing over the salad and toss everything together until the lettuce is evenly coated.\n4. Optional: Add anchovies and sliced boiled egg on top for additional toppings.\n5. Serve the Caesar salad immediately as a refreshing and classic side dish.",
      "img": "https://i.pinimg.com/564x/86/44/89/864489a2882623bb7244a68cc2c4db9f.jpg"
    },
    {
      "id": 62,
      "title": "Croque Monsieur (France)",
      "ingredients": "Ingredients:\n- 8 slices of bread\n- 4 slices ham\n- 2 cups grated Gruyère cheese\n- 2 cups milk\n- 2 tablespoons unsalted butter\n- 2 tablespoons all-purpose flour\n- 1/4 teaspoon nutmeg\n- Salt and pepper to taste\n- Dijon mustard for spreading\n- 2 tablespoons grated Parmesan cheese\n- Optional: 4 fried eggs for Croque Madame variation",
      "prepare": "Preparation:\n1. Preheat the oven to 375°F (190°C).\n2. Make a béchamel sauce: In a saucepan, melt the butter over medium heat. Add the flour and cook, stirring constantly, for about 2 minutes to create a roux. Slowly whisk in the milk, nutmeg, salt, and pepper. Cook the sauce until it thickens and becomes smooth.\n3. Lay out 4 slices of bread and spread Dijon mustard on each slice.\n4. Place a slice of ham on top of the mustard on each slice of bread.\n5. Sprinkle a generous amount of grated Gruyère cheese over the ham.\n6. Top each stack with another slice of bread to make a sandwich.\n7. Pour the béchamel sauce over the sandwiches, making sure they are fully covered.\n8. Sprinkle grated Parmesan cheese on top of the sauce.\n9. Place the Croque Monsieur sandwiches on a baking sheet and bake in the preheated oven for about 15-20 minutes or until the cheese is melted and bubbly, and the sandwiches are heated through.\n10. Optional: For a Croque Madame variation, fry 4 eggs in a pan and place one egg on top of each sandwich.\n11. Serve the Croque Monsieur (or Madame) hot and enjoy this delightful French comfort food!",
      "img": "https://i.pinimg.com/564x/52/f5/ff/52f5ff5cea0b95db2801366ba5ed836c.jpg"
    },
    {
      "id": 63,
      "title": "Chicken Marsala (Italy)",
      "ingredients": "Ingredients:\n- 4 boneless, skinless chicken breasts\n- 1/2 cup all-purpose flour\n- Salt and pepper to taste\n- 2 tablespoons olive oil\n- 1/4 cup unsalted butter\n- 8 ounces mushrooms, sliced\n- 1/2 cup Marsala wine\n- 1/2 cup chicken broth\n- 1/2 cup heavy cream\n- Chopped fresh parsley for garnish\n- Cooked fettuccine or mashed potatoes for serving",
      "prepare": "Preparation:\n1. Place the chicken breasts between two sheets of plastic wrap and pound them with a meat mallet until they are evenly thin.\n2. Season the chicken breasts with salt and pepper.\n3. Dredge the chicken in flour, shaking off any excess.\n4. In a large skillet, heat olive oil over medium-high heat.\n5. Add the chicken breasts and cook for about 3-4 minutes on each side until they are browned and cooked through. Remove the chicken from the skillet and set it aside.\n6. In the same skillet, melt the butter over medium heat.\n7. Add sliced mushrooms and sauté until they become tender and lightly browned.\n8. Pour in the Marsala wine and chicken broth, scraping the bottom of the skillet to deglaze it.\n9. Let the liquid simmer for a few minutes until it reduces slightly.\n10. Stir in the heavy cream and bring the sauce to a gentle simmer.\n11. Return the cooked chicken breasts to the skillet and coat them with the Marsala sauce.\n12. Serve the chicken Marsala over cooked fettuccine or mashed potatoes.\n13. Garnish with chopped fresh parsley before serving.",
      "img": "https://i.pinimg.com/564x/63/88/92/63889293890ff681651765f96502a465.jpg"
    },
    {
      "id": 64,
      "title": "Chicken Fajitas",
      "ingredients": "Ingredients:\n- 1 pound chicken breasts, thinly sliced\n- 1 red bell pepper, thinly sliced\n- 1 green bell pepper, thinly sliced\n- 1 onion, thinly sliced\n- 2 tablespoons vegetable oil\n- 1 tablespoon chili powder\n- 1 teaspoon ground cumin\n- 1/2 teaspoon smoked paprika\n- 1/2 teaspoon garlic powder\n- 1/4 teaspoon cayenne pepper (adjust to your spice preference)\n- Salt and pepper to taste\n- Flour tortillas\n- Optional toppings: sour cream, guacamole, shredded cheese, salsa",
      "img": "https://i.pinimg.com/564x/e3/df/57/e3df572f5046297f5e1f03cc03f35af8.jpg"
    },
    {
      "id": 65,
      "title": "Chicken Parmesan (Italy)",
      "ingredients": "Ingredients:\n- 4 boneless, skinless chicken breasts\n- 1 cup all-purpose flour\n- 2 large eggs, beaten\n- 2 cups breadcrumbs\n- 1/2 cup grated Parmesan cheese\n- 2 cups marinara sauce\n- 2 cups shredded mozzarella cheese\n- 1/4 cup chopped fresh basil\n- Salt and pepper to taste\n- Olive oil for frying\n- Cooked spaghetti or fettuccine for serving",
      "prepare": "Preparation:\n1. Preheat the oven to 375°F (190°C).\n2. Place the chicken breasts between two sheets of plastic wrap and pound them with a meat mallet until they are evenly thin.\n3. Season the chicken breasts with salt and pepper.\n4. Dredge each chicken breast in flour, shaking off any excess.\n5. Dip the floured chicken breasts in beaten eggs, coating them evenly.\n6. In a separate bowl, mix breadcrumbs and grated Parmesan cheese.\n7. Press each chicken breast into the breadcrumb mixture, ensuring they are well coated.\n8. Heat olive oil in a large skillet over medium-high heat.\n9. Fry the breaded chicken breasts for about 3-4 minutes on each side until they are golden brown and cooked through. Remove the chicken from the skillet and set them on a paper towel to drain excess oil.\n10. In a baking dish, spread a thin layer of marinara sauce on the bottom.\n11. Place the fried chicken breasts on top of the sauce.\n12. Spoon more marinara sauce over each chicken breast.\n13. Sprinkle shredded mozzarella cheese on top of the chicken.\n14. Bake the Chicken Parmesan in the preheated oven for about 15-20 minutes or until the cheese is melted and bubbly.\n15. Optional: Broil the Chicken Parmesan for a few minutes to achieve a golden crust on the cheese.\n16. Serve the Chicken Parmesan over cooked spaghetti or fettuccine.\n17. Garnish with chopped fresh basil before serving.",
      "img": "https://i0.wp.com/hangryhanna.com/wp-content/uploads/2023/03/cheesy-Chicken-Parmesan-1024x1024.png?resize=900%2C900&ssl=1"
    },
    {
      "id": 66,
      "title": "Mango Sticky Rice (Thailand)",
      "ingredients": "Ingredients:\n- 1 cup glutinous rice\n- 1 1/2 cups coconut milk\n- 1/2 cup sugar\n- 1/4 teaspoon salt\n- 2 ripe mangoes, peeled and sliced\n- Toasted sesame seeds for garnish",
      "prepare": "Preparation:\n1. Rinse the glutinous rice in cold water until the water runs clear.\n2. In a pot or rice cooker, combine the rinsed rice, coconut milk, sugar, and salt.\n3. Cook the rice mixture according to the rice cooker instructions or bring it to a simmer on the stove, stirring occasionally to prevent sticking.\n4. Once the rice is cooked and the liquid is absorbed, remove it from the heat and let it sit for a few minutes to steam.\n5. Meanwhile, make the coconut sauce: In a small saucepan, heat the remaining coconut milk over low heat.\n6. Stir the coconut milk constantly until it thickens slightly.\n7. Serve the sticky rice on plates or in bowls, topped with the sliced mangoes.\n8. Drizzle the coconut sauce over the mango sticky rice.\n9. Optional: Sprinkle toasted sesame seeds on top for added flavor and presentation.\n10. Enjoy this sweet and tropical Thai dessert!",
      "img": "https://www.thailanguagehut.com/wp-content/uploads/2010/06/mango_sticky_rice.jpg"
    },
    {
      "id": 67,
      "title": "Shakshuka (Middle East/North Africa)",
      "ingredients": "Ingredients:\n- 1 tablespoon olive oil\n- 1 onion, chopped\n- 1 red bell pepper, chopped\n- 2 cloves garlic, minced\n- 1 teaspoon ground cumin\n- 1 teaspoon ground paprika\n- 1 teaspoon ground cayenne pepper\n- 1 teaspoon ground coriander\n- 1 can (28 ounces) crushed tomatoes\n- 4-6 large eggs\n- Salt and pepper to taste\n- Fresh parsley for garnish\n- Crusty bread for serving",
      "img": "https://i.pinimg.com/564x/30/74/66/307466cadcbbd3afc5172c8e62037f0b.jpg"
    },
    {
      "id": 68,
      "title": "Ramen (Japan)",
      "ingredients": "Ingredients:\n- 4 packs of ramen noodles (discard the seasoning packets if using instant ramen)\n- 6 cups chicken or vegetable broth\n- 2 tablespoons soy sauce\n- 1 tablespoon miso paste\n- 1 tablespoon sesame oil\n- 1 tablespoon vegetable oil\n- 4 soft-boiled eggs, halved\n- 1 cup sliced cooked pork (chashu) or cooked shredded chicken\n- 2 cups fresh spinach leaves\n- 1 cup sliced bamboo shoots\n- 1 cup sliced green onions\n- Nori seaweed sheets for garnish\n- Toasted sesame seeds for garnish\n- Chili oil or Sriracha for added heat (optional)",
      "prepare": "Preparation:\n1. In a large pot, bring the chicken or vegetable broth to a boil.\n2. In a separate pot, cook the ramen noodles according to package instructions. Drain and set aside.\n3. In a small bowl, mix together soy sauce, miso paste, sesame oil, and vegetable oil to create the soup seasoning.\n4. Stir the seasoning mixture into the boiling broth.\n5. Divide the cooked ramen noodles among serving bowls.\n6. Ladle the hot broth over the noodles in each bowl.\n7. Top the ramen with halved soft-boiled eggs, sliced cooked pork or shredded chicken, fresh spinach leaves, sliced bamboo shoots, and sliced green onions.\n8. Optional: Drizzle chili oil or Sriracha on top for added heat.\n9. Garnish with torn nori seaweed sheets and toasted sesame seeds.\n10. Serve the ramen hot and enjoy this comforting Japanese noodle soup!",
      "img": "https://uploads.prod01.london.platform-os.com/instances/232/assets/images/recipes/CN_JapaneseRamenSoupSquare.jpg?updated=1574697083"
    },
    {
      "id": 69,
      "title": "Thai green curry",
      "ingredients": [
        "1 lb (450g) boneless chicken or tofu, sliced",
        "1 can (14 oz/400ml) coconut milk",
        "2 tbsp Thai green curry paste",
        "1 cup mixed vegetables (bell peppers, broccoli, carrots)",
        "1 tbsp fish sauce (or soy sauce for a vegetarian option)",
        "1 tbsp vegetable oil",
        "1 tsp sugar",
        "Fresh basil leaves",
        "Cooked jasmine rice, for serving"
      ],
      "prepare": [
        "In a large pan or wok, heat the vegetable oil over medium heat.",
        "Add the green curry paste and stir-fry for a minute until fragrant.",
        "Add the sliced chicken or tofu and cook until browned.",
        "Pour in the coconut milk and bring it to a simmer.",
        "Add the mixed vegetables, fish sauce (or soy sauce), and sugar.",
        "Simmer for about 10 minutes or until the vegetables are tender and the sauce thickens slightly.",
        "Garnish with fresh basil leaves.",
        "Serve hot with jasmine rice."
      ],
      "img": "https://hot-thai-kitchen.com/wp-content/uploads/2022/05/green-curry-new-sq-2.jpg"
    },
    {
      "id": 70,
      "title": "Beef and vegetable soup",
      "ingredients": [
        "1 lb (450g) beef stew meat, cubed",
        "6 cups beef broth",
        "1 onion, chopped",
        "2 carrots, peeled and sliced",
        "2 potatoes, peeled and diced",
        "1 cup green beans, trimmed and cut",
        "2 cloves garlic, minced",
        "1 bay leaf",
        "1 tsp dried thyme",
        "Salt and pepper to taste",
        "2 tbsp vegetable oil",
        "Fresh parsley, chopped, for garnish"
      ],
      "prepare": [
        "In a large pot, heat the vegetable oil over medium-high heat.",
        "Add the beef cubes and brown them on all sides.",
        "Add the chopped onion and minced garlic, sauté until fragrant.",
        "Pour in the beef broth and add the bay leaf and dried thyme.",
        "Bring the soup to a boil, then reduce heat and let it simmer for 1 hour, or until the beef is tender.",
        "Add the sliced carrots, diced potatoes, and green beans. Simmer for an additional 20 minutes.",
        "Season with salt and pepper to taste.",
        "Garnish with chopped fresh parsley before serving."
      ],
      "img": "https://www.cookingclassy.com/wp-content/uploads/2018/07/vegetable-beef-soup-12-500x500.jpg"
    },
    {
      "id": 71,
      "title": "Grilled salmon",
      "ingredients": [
        "4 salmon fillets",
        "2 tbsp olive oil",
        "2 cloves garlic, minced",
        "1 lemon, juiced",
        "1 tsp dried oregano",
        "1 tsp dried thyme",
        "Salt and pepper to taste",
        "Fresh dill, for garnish"
      ],
      "prepare": [
        "Preheat the grill to medium-high heat.",
        "In a small bowl, mix the olive oil, minced garlic, lemon juice, dried oregano, dried thyme, salt, and pepper.",
        "Brush the salmon fillets with the marinade on both sides.",
        "Place the salmon on the grill and cook for about 4-5 minutes per side, or until the fish is cooked through and has grill marks.",
        "Garnish with fresh dill before serving."
      ],
      "img": "https://thekitchengirl.com/wp-content/uploads/Grilled-Salmon-a_19-1.jpg"
    },
    {
      "id": 73,
      "title": "Ratatouille with baked eggs",
      "ingredients": [
        "1 eggplant, diced",
        "1 zucchini, diced",
        "1 yellow bell pepper, diced",
        "1 red bell pepper, diced",
        "1 onion, chopped",
        "3 cloves garlic, minced",
        "1 can (14 oz/400g) diced tomatoes",
        "1 tsp dried thyme",
        "1 tsp dried oregano",
        "1/2 tsp red pepper flakes (optional, for heat)",
        "Salt and pepper to taste",
        "4 eggs",
        "Fresh basil, chopped, for garnish"
      ],
      "prepare": [
        "Preheat the oven to 375°F (190°C).",
        "In an oven-safe skillet or casserole dish, sauté the chopped onion and minced garlic until softened.",
        "Add the diced eggplant, zucchini, yellow and red bell peppers. Cook for a few minutes until the vegetables start to soften.",
        "Stir in the diced tomatoes, dried thyme, dried oregano, and red pepper flakes (if using). Season with salt and pepper.",
        "Let the mixture simmer for about 10-15 minutes to meld the flavors.",
        "Using a spoon, create small wells in the vegetable mixture and crack the eggs into each well.",
        "Transfer the skillet or dish to the preheated oven and bake for about 12-15 minutes or until the eggs are cooked to your liking.",
        "Garnish with chopped fresh basil before serving."
      ],
      "img": "https://i.pinimg.com/564x/e9/3c/f9/e93cf91e8cc318d2a11ffe29d30204a5.jpg"
    },
    {
      "id": 74,
      "title": "Greek-style stuffed peppers",
      "ingredients": [
        "4 large bell peppers (any color)",
        "1 cup cooked rice (white or brown)",
        "1 lb (450g) ground beef or lamb",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1 can (14 oz/400g) diced tomatoes",
        "1/2 cup crumbled feta cheese",
        "2 tbsp chopped fresh parsley",
        "1 tsp dried oregano",
        "Salt and pepper to taste",
        "2 tbsp olive oil",
        "1 cup chicken or vegetable broth"
      ],
      "prepare": [
        "Preheat the oven to 375°F (190°C).",
        "Cut the tops off the bell peppers and remove the seeds and membranes.",
        "In a skillet, heat the olive oil over medium heat.",
        "Add the chopped onion and minced garlic, sauté until translucent.",
        "Add the ground beef or lamb and cook until browned.",
        "Stir in the cooked rice, diced tomatoes, crumbled feta cheese, chopped fresh parsley, dried oregano, salt, and pepper.",
        "Fill each bell pepper with the meat and rice mixture.",
        "Place the stuffed peppers in a baking dish and pour the chicken or vegetable broth into the bottom of the dish.",
        "Cover the baking dish with foil and bake in the preheated oven for about 25-30 minutes, or until the peppers are tender.",
        "Remove the foil and bake for an additional 10 minutes to brown the tops of the peppers.",
        "Serve the Greek-style stuffed peppers hot."
      ],
      "img": "https://i.pinimg.com/564x/9b/37/21/9b3721e45ba2b5d1da1c177d3691abf2.jpg"
    },
    {
      "id": 75,
      "title": "Beef and broccoli stir-fry",
      "ingredients": [
        "1 lb (450g) beef sirloin, thinly sliced",
        "2 cups broccoli florets",
        "1/2 cup sliced carrots",
        "3 cloves garlic, minced",
        "1/4 cup soy sauce",
        "2 tbsp oyster sauce",
        "1 tbsp cornstarch",
        "1 tsp sesame oil",
        "2 tbsp vegetable oil",
        "2 green onions, sliced (for garnish)",
        "Toasted sesame seeds (for garnish)",
        "Cooked white rice, for serving"
      ],
      "prepare": [
        "In a bowl, mix the soy sauce, oyster sauce, cornstarch, and sesame oil to make the stir-fry sauce.",
        "In a wok or large skillet, heat the vegetable oil over high heat.",
        "Add the minced garlic and sliced beef, stir-fry until the beef is browned.",
        "Add the broccoli florets and sliced carrots to the wok and continue to stir-fry for a few minutes until the vegetables are tender-crisp.",
        "Pour the stir-fry sauce over the beef and vegetables, stirring to coat everything evenly.",
        "Cook for another minute until the sauce thickens and coats the ingredients.",
        "Garnish with sliced green onions and toasted sesame seeds.",
        "Serve the beef and broccoli stir-fry over cooked white rice."
      ],
      "img": "https://i.pinimg.com/564x/6c/32/f1/6c32f18a6a2d6f978e5d99b0d7cc5a14.jpg"
    },
    {
      "id": 76,
      "title": "Pad see ew",
      "ingredients": [
        "8 oz (225g) flat rice noodles",
        "1 lb (450g) chicken, shrimp, or tofu",
        "2 cups broccoli florets",
        "2 cloves garlic, minced",
        "2 eggs, lightly beaten",
        "1/4 cup soy sauce",
        "2 tbsp oyster sauce",
        "1 tbsp fish sauce",
        "1 tbsp vegetable oil",
        "1 tbsp brown sugar",
        "Crushed peanuts (for garnish)",
        "Lime wedges (for serving)"
      ],
      "prepare": [
        "Cook the flat rice noodles according to the package instructions. Drain and set aside.",
        "In a wok or large skillet, heat the vegetable oil over medium-high heat.",
        "Add the minced garlic and cook for a minute until fragrant.",
        "Add the chicken, shrimp, or tofu (whichever you're using) and cook until the protein is cooked through.",
        "Push the cooked protein to one side of the wok and pour the beaten eggs on the other side. Scramble the eggs until they're just set.",
        "Add the broccoli florets to the wok and stir-fry for a few minutes until tender-crisp.",
        "In a small bowl, mix the soy sauce, oyster sauce, fish sauce, and brown sugar.",
        "Pour the sauce over the ingredients in the wok and stir to combine everything.",
        "Add the cooked rice noodles to the wok and toss everything together until the noodles are well coated in the sauce.",
        "Serve hot, garnished with crushed peanuts and lime wedges on the side."
      ],
      "img": "https://christieathome.com/wp-content/uploads/2021/12/Shrimp-Pad-See-Ew-3x4-16.jpg"
    },
    {
      "id": 77,
      "title": "Korean beef bulgogi",
      "ingredients": [
        "1 lb (450g) beef sirloin, thinly sliced",
        "1/4 cup soy sauce",
        "2 tbsp brown sugar",
        "2 tbsp sesame oil",
        "3 cloves garlic, minced",
        "1 inch (2.5cm) piece of ginger, grated",
        "2 green onions, chopped",
        "1 tbsp vegetable oil",
        "Toasted sesame seeds (for garnish)",
        "Cooked white rice, for serving",
        "Lettuce leaves (for serving)"
      ],
      "prepare": [
        "In a bowl, mix the soy sauce, brown sugar, sesame oil, minced garlic, grated ginger, and chopped green onions to make the marinade.",
        "Add the thinly sliced beef to the marinade and let it marinate for at least 30 minutes, or preferably overnight for better flavor.",
        "In a large skillet or grill pan, heat the vegetable oil over medium-high heat.",
        "Add the marinated beef and cook for a few minutes until browned and cooked through.",
        "Sprinkle with toasted sesame seeds for garnish.",
        "Serve the Korean beef bulgogi over cooked white rice, and wrap the beef in lettuce leaves for a refreshing twist."
      ],
      "img": "https://i.pinimg.com/564x/d0/0d/a3/d00da3f2e3c94786eee5477984aa906e.jpg"
    },
    {
      "id": 78,
      "title": "Baked teriyaki chicken",
      "ingredients": [
        "4 boneless, skinless chicken breasts",
        "1/2 cup soy sauce",
        "1/4 cup honey",
        "2 tbsp rice vinegar",
        "2 cloves garlic, minced",
        "1 tsp grated ginger",
        "1 tbsp cornstarch",
        "1/4 cup water",
        "1 tbsp sesame seeds (optional, for garnish)",
        "Sliced green onions (optional, for garnish)",
        "Cooked white rice, for serving"
      ],
      "prepare": [
        "In a bowl, whisk together the soy sauce, honey, rice vinegar, minced garlic, and grated ginger to make the teriyaki sauce.",
        "Place the chicken breasts in a shallow dish and pour half of the teriyaki sauce over them. Reserve the remaining sauce for later.",
        "Marinate the chicken in the sauce for at least 30 minutes.",
        "Preheat the oven to 400°F (200°C).",
        "Transfer the marinated chicken to a baking dish and bake for about 20-25 minutes or until the chicken is cooked through.",
        "In a small saucepan, mix the cornstarch and water until smooth. Stir in the reserved teriyaki sauce.",
        "Cook the sauce over medium heat, stirring constantly until it thickens and bubbles.",
        "Brush the thickened teriyaki sauce over the baked chicken.",
        "Garnish with sesame seeds and sliced green onions if desired.",
        "Serve the baked teriyaki chicken over cooked white rice."
      ],
      "img": "https://i.pinimg.com/564x/59/0e/52/590e5274214952a4127f9685140a5709.jpg"
    },
    {
      "id": 79,
      "title": "Chicken enchilada casserole",
      "ingredients": [
        "2 cups cooked and shredded chicken",
        "1 can (10 oz/280g) red enchilada sauce",
        "1 can (15 oz/425g) black beans, drained and rinsed",
        "1 cup corn kernels (fresh, frozen, or canned)",
        "1 cup shredded cheddar cheese",
        "8 small corn tortillas",
        "1/4 cup chopped fresh cilantro",
        "1/2 cup diced tomatoes",
        "Sour cream (for serving)",
        "Sliced green onions (for garnish)"
      ],
      "prepare": [
        "Preheat the oven to 375°F (190°C).",
        "In a mixing bowl, combine the shredded chicken with half of the enchilada sauce.",
        "In a separate bowl, mix the black beans, corn, and half of the shredded cheese.",
        "In a baking dish, spread a thin layer of the enchilada sauce at the bottom.",
        "Layer 4 corn tortillas on top of the sauce.",
        "Spread half of the chicken mixture over the tortillas.",
        "Add another layer of 4 tortillas on top of the chicken mixture.",
        "Add the black bean and corn mixture on top of the tortillas.",
        "Add a final layer of 4 tortillas on top of the black bean and corn mixture.",
        "Pour the remaining enchilada sauce over the top layer of tortillas.",
        "Sprinkle the remaining shredded cheese on top.",
        "Bake in the preheated oven for about 25 minutes, or until the cheese is melted and bubbly.",
        "Garnish with chopped cilantro, diced tomatoes, sliced green onions, and a dollop of sour cream before serving."
      ],
      "img": "https://www.fivehearthome.com/wp-content/uploads/2022/03/Chicken-Enchilada-Casserole-Recipe-by-Five-Heart-Home_1200pxSquare.jpg"
    },
    {
      "id": 80,
      "title": "Spanish tortilla",
      "ingredients": [
        "4 large potatoes, peeled and thinly sliced",
        "1 onion, thinly sliced",
        "6 large eggs",
        "1/4 cup olive oil",
        "Salt and pepper to taste",
        "Fresh parsley, chopped (for garnish)"
      ],
      "prepare": [
        "Heat the olive oil in a large non-stick skillet over medium heat.",
        "Add the thinly sliced potatoes and onions to the skillet.",
        "Cook, stirring occasionally, until the potatoes are tender but not browned. This should take about 15-20 minutes.",
        "In a separate bowl, whisk the eggs and season them with salt and pepper.",
        "Remove the cooked potatoes and onions from the skillet and let them cool slightly.",
        "Gently mix the potatoes and onions with the beaten eggs in the bowl.",
        "Wipe the skillet clean and add a little more olive oil. Heat the skillet over medium heat again.",
        "Pour the potato and egg mixture back into the skillet, spreading it out evenly.",
        "Cook the tortilla for about 5-7 minutes on one side until it starts to set.",
        "Place a large plate over the skillet and carefully flip the tortilla onto the plate.",
        "Slide the tortilla back into the skillet to cook the other side for another 5-7 minutes until fully set.",
        "Slide the cooked tortilla onto a serving plate and let it cool slightly before slicing.",
        "Garnish with chopped fresh parsley before serving. The Spanish tortilla can be enjoyed warm or at room temperature."
      ],
      "img": "https://www.unicornsinthekitchen.com/wp-content/uploads/2020/02/Spanish-Tortilla-.jpg"
    },
    {
      "id": 81,
      "title": "Chicken and dumplings",
      "ingredients": [
        "1 lb (450g) boneless, skinless chicken thighs or breasts",
        "4 cups chicken broth",
        "1 cup all-purpose flour",
        "2 tbsp butter",
        "1/2 cup milk",
        "1/2 cup frozen peas",
        "1/2 cup diced carrots",
        "1/2 cup diced celery",
        "1 tsp baking powder",
        "1/2 tsp baking soda",
        "1/4 tsp salt",
        "1/4 tsp black pepper",
        "1/4 tsp dried thyme",
        "1/4 cup chopped fresh parsley (for garnish)"
      ],
      "prepare": [
        "In a large pot, bring the chicken broth to a boil.",
        "Add the chicken thighs or breasts to the pot and simmer for about 15-20 minutes, or until the chicken is fully cooked.",
        "Remove the cooked chicken from the pot and shred it into bite-sized pieces. Set aside.",
        "In a separate bowl, mix the flour, baking powder, baking soda, salt, black pepper, and dried thyme.",
        "Cut the butter into small pieces and add it to the flour mixture. Use your fingers to rub the butter into the flour until it resembles coarse crumbs.",
        "Stir in the milk until a dough forms.",
        "Return the pot with the chicken broth to the stove over medium heat.",
        "Add the frozen peas, diced carrots, and diced celery to the pot and bring it to a simmer.",
        "Drop spoonfuls of the dumpling dough into the simmering broth.",
        "Cover the pot and let the dumplings cook for about 15 minutes, or until they are cooked through and puffed up.",
        "Add the shredded chicken back into the pot and stir everything together.",
        "Garnish with chopped fresh parsley before serving."
      ],
      "img": "https://kristineskitchenblog.com/wp-content/uploads/2022/11/homemade-chicken-and-dumplings-recipe-28.jpg"
    },
    {
      "id": 82,
      "title": "Ratatouille tart",
      "ingredients": [
        "1 sheet store-bought puff pastry, thawed",
        "1 small eggplant, thinly sliced",
        "1 small zucchini, thinly sliced",
        "1 small yellow squash, thinly sliced",
        "1 red bell pepper, thinly sliced",
        "1 yellow bell pepper, thinly sliced",
        "1/4 cup tomato sauce",
        "2 cloves garlic, minced",
        "2 tbsp olive oil",
        "1 tsp dried thyme",
        "Salt and pepper to taste",
        "1/4 cup crumbled feta cheese (optional, for garnish)",
        "Fresh basil leaves (for garnish)"
      ],
      "prepare": [
        "Preheat the oven to 400°F (200°C).",
        "On a lightly floured surface, roll out the thawed puff pastry sheet to fit a tart pan or a baking sheet.",
        "Transfer the rolled-out puff pastry to the tart pan or baking sheet.",
        "In a small bowl, mix the minced garlic, olive oil, dried thyme, salt, and pepper.",
        "Brush the puff pastry with the garlic and olive oil mixture.",
        "Spread the tomato sauce evenly over the puff pastry.",
        "Arrange the thinly sliced eggplant, zucchini, yellow squash, and bell peppers in an overlapping pattern on top of the tomato sauce.",
        "Drizzle the remaining garlic and olive oil mixture over the vegetables.",
        "Bake the ratatouille tart in the preheated oven for about 25-30 minutes, or until the puff pastry is golden and the vegetables are tender.",
        "Optional: Sprinkle crumbled feta cheese over the tart during the last few minutes of baking for added flavor.",
        "Garnish with fresh basil leaves before serving."
      ],
      "img": "https://www.foodandwine.com/thmb/1iY9EaPj-ePYR5uLidBt8qp-j0Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/201504-xl-ratatouille-tart-2000-17535a27e34b45128d05e717d4c4a4e7.jpg"
    },
    {
      "id": 83,
      "title": "Baked frittata",
      "ingredients": [
        "8 large eggs",
        "1/4 cup milk",
        "1 cup chopped spinach",
        "1 cup diced bell peppers (any color)",
        "1/2 cup diced onion",
        "1/2 cup diced tomatoes",
        "1/2 cup shredded cheddar cheese",
        "2 tbsp chopped fresh basil",
        "2 tbsp vegetable oil",
        "Salt and pepper to taste"
      ],
      "prepare": [
        "Preheat the oven to 375°F (190°C).",
        "In a large mixing bowl, whisk together the eggs, milk, salt, and pepper.",
        "Stir in the chopped spinach, diced bell peppers, diced onion, diced tomatoes, shredded cheddar cheese, and chopped fresh basil.",
        "Heat the vegetable oil in a large oven-safe skillet over medium heat.",
        "Pour the egg mixture into the skillet and spread it out evenly.",
        "Cook the frittata on the stovetop for about 2 minutes until the edges start to set.",
        "Transfer the skillet to the preheated oven and bake for 15-20 minutes, or until the frittata is set and lightly browned on top.",
        "Remove the frittata from the oven and let it cool slightly before slicing.",
        "Serve the baked frittata warm as a delicious breakfast or brunch option."
      ],
      "img": "https://i0.wp.com/www.kidseatbyshanai.com/wp-content/uploads/2019/06/frittata_tomato_spinach_sq1.jpg?fit=1200%2C1200&ssl=1"
    },
    {
      "id": 84,
      "title": "Quinoa and black bean salad",
      "ingredients": [
        "1 cup quinoa",
        "2 cups water or vegetable broth",
        "1 can (15 oz/425g) black beans, drained and rinsed",
        "1 cup cherry tomatoes, halved",
        "1 cucumber, diced",
        "1 bell pepper (any color), diced",
        "1/4 cup chopped red onion",
        "1/4 cup chopped fresh cilantro",
        "1/4 cup lime juice",
        "2 tbsp olive oil",
        "1 clove garlic, minced",
        "1 tsp ground cumin",
        "Salt and pepper to taste",
        "Avocado slices (for garnish)"
      ],
      "prepare": [
        "Rinse the quinoa under cold water and drain well.",
        "In a medium saucepan, bring 2 cups of water or vegetable broth to a boil.",
        "Add the rinsed quinoa and a pinch of salt to the boiling water.",
        "Reduce the heat to low, cover the saucepan, and let the quinoa simmer for about 15-20 minutes, or until the liquid is absorbed and the quinoa is fluffy.",
        "In a large mixing bowl, combine the cooked quinoa, black beans, cherry tomatoes, diced cucumber, diced bell pepper, chopped red onion, and chopped cilantro.",
        "In a separate small bowl, whisk together the lime juice, olive oil, minced garlic, ground cumin, salt, and pepper to make the dressing.",
        "Pour the dressing over the quinoa and black bean mixture and toss everything together until well coated.",
        "Garnish the salad with slices of avocado before serving.",
        "This salad can be served warm or cold and makes a nutritious and satisfying meal on its own or as a side dish."
      ],
      "img": "https://www.bowlofdelicious.com/wp-content/uploads/2014/09/Quinoa-and-Black-Beans-square.jpg"
    },
    {
      "id": 85,
      "title": "Mediterranean chicken and vegetable skewers",
      "ingredients": [
        "1 lb (450g) boneless, skinless chicken breasts, cut into chunks",
        "1 red bell pepper, cut into chunks",
        "1 yellow bell pepper, cut into chunks",
        "1 red onion, cut into chunks",
        "1 zucchini, sliced",
        "1/4 cup olive oil",
        "2 cloves garlic, minced",
        "1 tsp dried oregano",
        "1 tsp dried thyme",
        "1/2 tsp dried rosemary",
        "1/4 cup lemon juice",
        "Salt and pepper to taste",
        "Wooden or metal skewers"
      ],
      "prepare": [
        "If using wooden skewers, soak them in water for at least 30 minutes to prevent burning.",
        "In a mixing bowl, combine the olive oil, minced garlic, dried oregano, dried thyme, dried rosemary, lemon juice, salt, and pepper to make the marinade.",
        "Add the chicken chunks to the marinade and let them marinate for at least 30 minutes.",
        "Thread the marinated chicken chunks, along with the bell peppers, red onion, and zucchini, onto the skewers in an alternating pattern.",
        "Preheat the grill or grill pan to medium-high heat.",
        "Cook the skewers on the preheated grill, turning occasionally, until the chicken is cooked through and the vegetables are tender and slightly charred.",
        "Serve the Mediterranean chicken and vegetable skewers hot, and optionally, you can serve them with a side of rice or a fresh salad."
      ],
      "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ5yztq9hChbTs36rg_T98oNQCmWVB3HcMtRQ&usqp=CAU"
    },
    {
      "id": 86,
      "title": "Spicy shrimp and rice",
      "ingredients": [
        "1 lb (450g) large shrimp, peeled and deveined",
        "2 cups cooked white rice",
        "1 bell pepper (any color), diced",
        "1 small onion, diced",
        "3 cloves garlic, minced",
        "2 tbsp soy sauce",
        "1 tbsp Sriracha sauce (adjust to your spice preference)",
        "1 tbsp vegetable oil",
        "1/4 cup chopped green onions (for garnish)",
        "Lime wedges (for serving)"
      ],
      "prepare": [
        "In a bowl, mix the shrimp with soy sauce and Sriracha sauce. Let it marinate for 10-15 minutes.",
        "In a large skillet or wok, heat the vegetable oil over medium-high heat.",
        "Add the diced onion and minced garlic to the skillet, and sauté until fragrant.",
        "Add the marinated shrimp to the skillet and cook for about 2-3 minutes on each side until they turn pink and are fully cooked.",
        "Add the diced bell pepper to the skillet and stir-fry for another 2 minutes.",
        "Add the cooked white rice to the skillet and toss everything together until well combined.",
        "Garnish the spicy shrimp and rice with chopped green onions.",
        "Serve hot with lime wedges on the side for an extra burst of flavor."
      ],
      "img": "https://www.skinnytaste.com/wp-content/uploads/2009/06/Spicy-Shrimp-Fried-Rice-3-500x500.jpg"
    },

    {
      "id": 87,
      "title": "Chicken katsu",
      "ingredients": [
        "4 boneless, skinless chicken breasts",
        "1/2 cup all-purpose flour",
        "2 large eggs, beaten",
        "1 cup panko breadcrumbs",
        "Salt and pepper to taste",
        "Vegetable oil for frying",
        "Cabbage, shredded (for serving)",
        "Tonkatsu sauce or bulldog sauce (for serving)",
        "Cooked white rice (for serving)"
      ],
      "prepare": [
        "Season the chicken breasts with salt and pepper.",
        "Dredge each chicken breast in flour, shaking off the excess.",
        "Dip the floured chicken breasts into the beaten eggs, coating them evenly.",
        "Coat the chicken breasts with panko breadcrumbs, pressing the breadcrumbs onto the chicken to adhere.",
        "In a large skillet or frying pan, heat enough vegetable oil to cover the bottom of the pan over medium-high heat.",
        "Fry the breaded chicken breasts for about 4-5 minutes on each side, or until they are golden brown and cooked through.",
        "Remove the chicken katsu from the pan and drain on paper towels.",
        "Slice the chicken katsu into strips.",
        "Serve the chicken katsu with shredded cabbage and a side of tonkatsu sauce or bulldog sauce for dipping.",
        "Accompany with cooked white rice to complete the meal."
      ],
      "img": "https://static01.nyt.com/images/2021/05/23/dining/kc-chicken-katsu/merlin_185308080_a60a6563-292e-4f52-a33b-386113aca0b2-mediumSquareAt3X.jpg"
    },
    {
      "id": 88,
      "title": "Grilled lamb chops",
      "ingredients": [
        "8 lamb chops",
        "2 tbsp olive oil",
        "4 cloves garlic, minced",
        "1 tsp dried rosemary",
        "1 tsp dried thyme",
        "1/2 tsp dried oregano",
        "Salt and pepper to taste",
        "Lemon wedges (for serving)",
        "Fresh mint leaves (for garnish)"
      ],
      "prepare": [
        "In a bowl, mix the olive oil, minced garlic, dried rosemary, dried thyme, dried oregano, salt, and pepper to make the marinade.",
        "Rub the marinade all over the lamb chops, coating them evenly.",
        "Cover the lamb chops and let them marinate in the refrigerator for at least 30 minutes, or preferably overnight for better flavor.",
        "Preheat the grill to medium-high heat.",
        "Grill the lamb chops for about 4-5 minutes on each side, or until they reach your desired level of doneness.",
        "Remove the lamb chops from the grill and let them rest for a few minutes.",
        "Garnish the grilled lamb chops with fresh mint leaves.",
        "Serve the lamb chops hot with lemon wedges on the side for an extra zesty touch."
      ],
      "img": "https://www.wholesomeyum.com/wp-content/uploads/2022/04/wholesomeyum-Grilled-Lamb-Chops-17.jpg"
    },
    {
      "id": 89,
      "title": "Buttered noodles with Parmesan cheese",
      "ingredients": [
        "8 oz (225g) egg noodles or pasta of your choice",
        "4 tbsp unsalted butter",
        "1/4 cup grated Parmesan cheese",
        "2 tbsp chopped fresh parsley",
        "Salt and pepper to taste"
      ],
      "prepare": [
        "Cook the egg noodles or pasta according to the package instructions until al dente.",
        "Drain the cooked noodles, reserving about 1/2 cup of the pasta water.",
        "In a large skillet, melt the butter over medium heat.",
        "Add the drained noodles to the skillet and toss them in the melted butter.",
        "If the noodles seem dry, add some of the reserved pasta water to create a creamy sauce.",
        "Stir in the grated Parmesan cheese, chopped fresh parsley, salt, and pepper.",
        "Toss everything together until the noodles are well coated in the butter and Parmesan mixture.",
        "Serve the buttered noodles with Parmesan cheese immediately as a simple and comforting side dish."
      ],
      "img": "https://onedishkitchen.com/wp-content/uploads/2020/05/buttered-noodles-one-dish-kitchen-3-1200x1200.webp"
    },
    {
      "id": 90,
      "title": "Ratatouille lasagna",
      "ingredients": [
        "9 lasagna noodles, cooked according to package instructions",
        "2 cups ratatouille (cooked eggplant, zucchini, bell peppers, tomatoes, and onions in tomato sauce)",
        "2 cups ricotta cheese",
        "1 cup shredded mozzarella cheese",
        "1/2 cup grated Parmesan cheese",
        "2 tbsp chopped fresh basil",
        "1 tbsp chopped fresh oregano",
        "Salt and pepper to taste"
      ],
      "prepare": [
        "Preheat the oven to 375°F (190°C).",
        "In a bowl, mix the ricotta cheese with chopped fresh basil, chopped fresh oregano, salt, and pepper.",
        "In a greased baking dish, spread a thin layer of ratatouille at the bottom.",
        "Place 3 lasagna noodles over the ratatouille layer.",
        "Spread half of the ricotta mixture over the noodles.",
        "Add another layer of ratatouille on top of the ricotta.",
        "Place 3 more lasagna noodles over the ratatouille layer.",
        "Spread the remaining ricotta mixture over the noodles.",
        "Add a final layer of ratatouille on top of the ricotta.",
        "Sprinkle shredded mozzarella cheese and grated Parmesan cheese over the top layer of ratatouille.",
        "Cover the baking dish with foil and bake in the preheated oven for about 25-30 minutes.",
        "Remove the foil and continue baking for an additional 10 minutes, or until the cheese is melted and bubbly.",
        "Let the ratatouille lasagna cool slightly before serving."
      ],
      "img": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/119049.jpg?resize=1200:*"
    },
    {
      "id": 91,
      "title": "Tomato and mozzarella salad",
      "ingredients": [
        "4 large ripe tomatoes, sliced",
        "8 oz (225g) fresh mozzarella cheese, sliced",
        "1/4 cup fresh basil leaves",
        "2 tbsp balsamic vinegar",
        "2 tbsp extra-virgin olive oil",
        "Salt and pepper to taste"
      ],
      "prepare": [
        "Alternate the slices of tomatoes and mozzarella cheese on a serving platter.",
        "Tuck fresh basil leaves between the slices of tomatoes and mozzarella.",
        "In a small bowl, whisk together the balsamic vinegar, extra-virgin olive oil, salt, and pepper to make the dressing.",
        "Drizzle the dressing over the tomato and mozzarella slices.",
        "Garnish with additional fresh basil leaves if desired.",
        "Serve the tomato and mozzarella salad as a refreshing and light appetizer or side dish, perfect for summer gatherings."
      ],
      "img": "https://tmbidigitalassetsazure.blob.core.windows.net/rms3-prod/attachments/37/1200x1200/exps44699_TOHCS2238730A12_21_2bC_WEB.jpg"
    },
    {
      "id": 92,
      "title": "Vegetable and lentil soup",
      "ingredients": [
        "1 cup dried lentils",
        "6 cups vegetable broth",
        "1 large onion, diced",
        "2 carrots, diced",
        "2 celery stalks, diced",
        "2 cloves garlic, minced",
        "1 can (14 oz/400g) diced tomatoes",
        "1 tsp dried thyme",
        "1 tsp dried oregano",
        "Salt and pepper to taste",
        "2 tbsp olive oil",
        "Fresh parsley, chopped (for garnish)"
      ],
      "prepare": [
        "In a large pot, heat the olive oil over medium heat.",
        "Add the diced onion, carrots, and celery to the pot. Sauté until the vegetables are softened.",
        "Add the minced garlic and sauté for another minute until fragrant.",
        "Pour in the vegetable broth and bring it to a boil.",
        "Add the dried lentils, diced tomatoes, dried thyme, dried oregano, salt, and pepper to the pot.",
        "Reduce the heat to low and let the soup simmer for about 20-25 minutes, or until the lentils are tender.",
        "Adjust the seasoning with more salt and pepper if needed.",
        "Garnish the vegetable and lentil soup with chopped fresh parsley before serving.",
        "This hearty and nutritious soup is perfect for a comforting meal on a chilly day."
      ],
      "img": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Vegetable-Lentil-Soup_EXPS_CWDJ18_32216_D08_18_2b-3.jpg"
    },
    {
      "id": 93,
      "title": "Chicken and asparagus risotto",
      "ingredients": [
        "1 cup Arborio rice",
        "4 cups chicken broth",
        "1 lb (450g) boneless, skinless chicken breasts, cut into bite-sized pieces",
        "1 bunch asparagus, trimmed and cut into 2-inch pieces",
        "1/2 cup grated Parmesan cheese",
        "1/4 cup dry white wine",
        "2 cloves garlic, minced",
        "1 small onion, finely chopped",
        "2 tbsp butter",
        "2 tbsp olive oil",
        "Salt and pepper to taste",
        "Fresh parsley, chopped (for garnish)"
      ],
      "prepare": [
        "In a saucepan, heat the chicken broth and keep it warm over low heat.",
        "In a large skillet or a wide-bottomed pot, heat 1 tablespoon of olive oil over medium heat.",
        "Add the chopped onion and minced garlic to the skillet. Sauté until the onion becomes translucent.",
        "Add the Arborio rice to the skillet and stir it to coat it with the oil, onion, and garlic.",
        "Pour in the white wine and cook until it is mostly absorbed by the rice.",
        "Gradually add the warm chicken broth, about 1/2 cup at a time, stirring constantly and allowing the rice to absorb the liquid before adding more.",
        "In a separate skillet, heat the remaining tablespoon of olive oil over medium-high heat.",
        "Add the chicken pieces to the skillet and cook until they are golden brown and cooked through. Season with salt and pepper.",
        "In the last 5 minutes of cooking, add the asparagus pieces to the risotto and continue stirring until the rice is creamy and the asparagus is tender.",
        "Stir in the cooked chicken and grated Parmesan cheese.",
        "Remove the skillet from the heat and stir in the butter until it melts into the risotto.",
        "Garnish the chicken and asparagus risotto with chopped fresh parsley before serving.",
        "Enjoy this creamy and flavorful risotto as a delightful main course."
      ],
      "img": "https://static.onecms.io/wp-content/uploads/sites/39/2019/09/20230708/p_RU225671.jpg"
    },
    {
      "id": 94,
      "title": "Creamy chicken and mushroom pasta",
      "ingredients": [
        "8 oz (225g) fettuccine or pasta of your choice",
        "1 lb (450g) boneless, skinless chicken breasts, cut into thin strips",
        "8 oz (225g) mushrooms, sliced",
        "2 cloves garlic, minced",
        "1 cup heavy cream",
        "1/2 cup chicken broth",
        "1/2 cup grated Parmesan cheese",
        "2 tbsp butter",
        "2 tbsp olive oil",
        "1 tsp dried thyme",
        "Salt and pepper to taste",
        "Fresh parsley, chopped (for garnish)"
      ],
      "prepare": [
        "Cook the fettuccine or pasta according to the package instructions until al dente. Drain and set aside.",
        "In a large skillet, heat 1 tablespoon of butter and 1 tablespoon of olive oil over medium-high heat.",
        "Add the sliced mushrooms to the skillet and cook until they are golden brown and tender. Season with salt, pepper, and dried thyme.",
        "Remove the mushrooms from the skillet and set them aside.",
        "In the same skillet, add the remaining tablespoon of butter and tablespoon of olive oil.",
        "Add the chicken strips to the skillet and cook until they are browned and cooked through. Season with salt and pepper.",
        "Lower the heat to medium and add the minced garlic. Cook for another minute until the garlic is fragrant.",
        "Pour in the heavy cream and chicken broth, stirring to combine everything.",
        "Let the sauce simmer for a few minutes until it thickens slightly.",
        "Stir in the grated Parmesan cheese until it melts into the sauce.",
        "Add the cooked pasta and sautéed mushrooms to the sauce, tossing everything together until well coated.",
        "Garnish the creamy chicken and mushroom pasta with chopped fresh parsley before serving.",
        "This rich and indulgent pasta dish is perfect for a comforting and satisfying meal."
      ],
      "img": "https://zenaskitchen.com/wp-content/uploads/2022/12/creamy-chicken-and-mushroom-pasta.jpg"
    },
    {
      "id": 95,
      "title": "Beef and vegetable pot pie",
      "ingredients": [
        "1 lb (450g) beef stew meat, cut into bite-sized pieces",
        "1 cup frozen mixed vegetables (carrots, peas, corn, green beans)",
        "1 cup diced potatoes",
        "1/2 cup diced onions",
        "2 cloves garlic, minced",
        "1/4 cup all-purpose flour",
        "2 cups beef broth",
        "1/2 cup heavy cream",
        "2 tbsp butter",
        "1 tbsp olive oil",
        "1 tsp dried thyme",
        "Salt and pepper to taste",
        "1 sheet store-bought puff pastry, thawed",
        "1 egg, beaten (for egg wash)"
      ],
      "prepare": [
        "Preheat the oven to 375°F (190°C).",
        "In a large skillet or a wide-bottomed pot, heat the olive oil over medium-high heat.",
        "Add the diced onions and minced garlic to the skillet. Sauté until the onions become translucent.",
        "Add the beef stew meat to the skillet and cook until it is browned on all sides. Season with salt, pepper, and dried thyme.",
        "Stir in the all-purpose flour, coating the beef and onions evenly.",
        "Pour in the beef broth, stirring constantly to avoid lumps.",
        "Add the diced potatoes and mixed vegetables to the skillet. Bring the mixture to a simmer and let it cook for a few minutes until the potatoes are tender and the sauce thickens.",
        "Stir in the heavy cream and let the mixture simmer for another minute.",
        "Remove the skillet from the heat.",
        "Transfer the beef and vegetable filling to a deep pie dish or individual ramekins.",
        "Roll out the puff pastry sheet to fit the top of the pie dish or ramekins.",
        "Place the puff pastry over the filling, sealing the edges.",
        "Brush the top of the puff pastry with the beaten egg for a golden finish.",
        "Cut a few small slits in the puff pastry to allow steam to escape while baking.",
        "Bake the beef and vegetable pot pie in the preheated oven for about 25-30 minutes, or until the puff pastry is golden and puffed.",
        "Serve the pot pie hot as a comforting and hearty meal."
      ],
      "img": "https://www.thecookierookie.com/wp-content/uploads/2022/05/Featrued-beef-pot-pie-1.jpg"
    },
    {
      "id": 96,
      "title": "Baked fish with lemon and herbs",
      "ingredients": [
        "4 fillets of white fish (such as tilapia, cod, or haddock)",
        "1 lemon, thinly sliced",
        "2 tbsp fresh lemon juice",
        "2 tbsp olive oil",
        "2 cloves garlic, minced",
        "1 tsp dried thyme",
        "1 tsp dried rosemary",
        "1 tsp dried parsley",
        "Salt and pepper to taste",
        "Fresh parsley, chopped (for garnish)"
      ],
      "prepare": [
        "Preheat the oven to 375°F (190°C).",
        "In a small bowl, mix together the fresh lemon juice, olive oil, minced garlic, dried thyme, dried rosemary, dried parsley, salt, and pepper.",
        "Place the fish fillets in a baking dish and drizzle the lemon herb mixture over the fish, coating them evenly.",
        "Arrange lemon slices on top of the fish fillets.",
        "Cover the baking dish with foil and bake in the preheated oven for about 15-20 minutes, or until the fish is cooked through and flakes easily with a fork.",
        "Remove the foil and broil the fish for an additional 2-3 minutes to get a slightly golden top.",
        "Garnish the baked fish with chopped fresh parsley before serving.",
        "This simple and flavorful dish is a healthy and light option for a quick weeknight dinner."
      ],
      "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTcgOnJlMy2ZA9Ra0evdvlsvUgN_2yvcHorDw&usqp=CAU"
    },
    {
      "id": 97,
      "title": "Grilled vegetable and hummus wrap",
      "ingredients": [
        "1 cup hummus",
        "4 large whole wheat or spinach tortillas",
        "1 red bell pepper, sliced",
        "1 yellow bell pepper, sliced",
        "1 zucchini, sliced lengthwise",
        "1 eggplant, sliced lengthwise",
        "1 red onion, sliced",
        "2 tbsp olive oil",
        "2 tsp ground cumin",
        "Salt and pepper to taste",
        "Fresh baby spinach leaves",
        "Fresh cilantro leaves",
        "Chili sauce or hot sauce (optional, for added spice)"
      ],
      "prepare": [
        "Preheat the grill or grill pan to medium-high heat.",
        "In a bowl, toss the sliced red and yellow bell peppers, zucchini, eggplant, and red onion with olive oil, ground cumin, salt, and pepper.",
        "Grill the vegetables for about 2-3 minutes on each side until they have grill marks and are tender.",
        "Spread a generous amount of hummus on each tortilla.",
        "Layer the grilled vegetables, fresh baby spinach leaves, and cilantro leaves on top of the hummus.",
        "If you prefer some heat, drizzle chili sauce or hot sauce over the vegetables.",
        "Fold the sides of the tortilla and roll it up tightly to form the wrap.",
        "Slice the wrap in half for easier handling, if desired.",
        "Serve the grilled vegetable and hummus wrap as a delicious and healthy lunch or dinner option."
      ],
      "img": "https://i0.wp.com/sugarspiceslife.com/wp-content/uploads/2018/06/IMG_0377.jpg?fit=550%2C550&ssl=1"
    },
    {
      "id": 98,
      "title": "Chicken souvlaki",
      "ingredients": [
        "1 lb (450g) boneless, skinless chicken breasts, cut into cubes",
        "1/4 cup olive oil",
        "3 tbsp fresh lemon juice",
        "2 cloves garlic, minced",
        "1 tsp dried oregano",
        "1/2 tsp dried thyme",
        "Salt and pepper to taste",
        "Pita bread",
        "Tzatziki sauce",
        "Sliced tomatoes",
        "Sliced cucumbers",
        "Sliced red onions",
        "Fresh parsley, chopped (for garnish)"
      ],
      "prepare": [
        "In a bowl, mix together olive oil, fresh lemon juice, minced garlic, dried oregano, dried thyme, salt, and pepper to make the marinade.",
        "Add the chicken cubes to the marinade and toss to coat them evenly. Cover and refrigerate for at least 1 hour, or overnight for better flavor.",
        "Preheat the grill or grill pan to medium-high heat.",
        "Thread the marinated chicken onto skewers.",
        "Grill the chicken skewers for about 4-5 minutes on each side, or until they are cooked through and have grill marks.",
        "Warm the pita bread on the grill for a minute on each side.",
        "Serve the grilled chicken souvlaki in warm pita bread with tzatziki sauce, sliced tomatoes, cucumbers, and red onions.",
        "Garnish with chopped fresh parsley for added freshness and flavor."
      ],
      "img": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FPhoto%2FRecipes%2F2023-02-chicken-souvlaki%2F230104_ATKitchn_chicken-souvlaki_0287"
    },
    {
      "id": 99,
      "title": "Sweet potato and black bean chili",
      "ingredients": [
        "1 large sweet potato, peeled and diced",
        "1 can (15 oz/425g) black beans, drained and rinsed",
        "1 can (14 oz/400g) diced tomatoes",
        "1 red bell pepper, diced",
        "1 onion, diced",
        "2 cloves garlic, minced",
        "1 cup vegetable broth",
        "1 tbsp chili powder",
        "1 tsp ground cumin",
        "1 tsp paprika",
        "Salt and pepper to taste",
        "2 tbsp olive oil",
        "Fresh cilantro, chopped (for garnish)",
        "Sour cream (optional, for serving)"
      ],
      "prepare": [
        "In a large pot, heat the olive oil over medium heat.",
        "Add the diced onion and minced garlic to the pot. Sauté until the onion becomes translucent.",
        "Add the diced sweet potato and red bell pepper to the pot. Cook for a few minutes until they start to soften.",
        "Stir in the chili powder, ground cumin, paprika, salt, and pepper, coating the vegetables evenly.",
        "Add the drained black beans and diced tomatoes to the pot.",
        "Pour in the vegetable broth and bring the chili to a simmer.",
        "Let the chili cook on low heat for about 15-20 minutes, or until the sweet potato is tender and the flavors have melded together.",
        "Adjust the seasoning with more salt and pepper if needed.",
        "Serve the sweet potato and black bean chili hot, garnished with chopped fresh cilantro.",
        "Add a dollop of sour cream on top, if desired, for a creamy and tangy touch."
      ],
      "img": "https://www.eatingwell.com/thmb/Kf61Gahetu0WvJsTd-CQ6Zs5LVY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/sweet-potato-and-black-bean-chili-02a419499e384f91aefadc05e5f5b8ac.jpg"
    },
    {
      "id": 100,
      "title": "Grilled portobello mushroom burgers",
      "ingredients": [
        "4 large portobello mushroom caps",
        "1/4 cup balsamic vinegar",
        "2 tbsp soy sauce",
        "2 cloves garlic, minced",
        "1 tsp dried thyme",
        "Salt and pepper to taste",
        "4 burger buns",
        "Sliced red onion",
        "Lettuce leaves",
        "Sliced tomatoes",
        "Sliced avocado",
        "Your favorite burger toppings and condiments"
      ],
      "prepare": [
        "In a bowl, mix together balsamic vinegar, soy sauce, minced garlic, dried thyme, salt, and pepper to make the marinade.",
        "Remove the stems from the portobello mushrooms and place them in a shallow dish, gill side up.",
        "Pour the marinade over the mushroom caps, making sure to coat them well. Let them marinate for about 20-30 minutes.",
        "Preheat the grill or grill pan to medium-high heat.",
        "Grill the portobello mushrooms for about 4-5 minutes on each side, or until they are tender and have grill marks.",
        "Toast the burger buns on the grill for a minute or until they are lightly browned.",
        "Assemble the grilled portobello mushroom burgers with sliced red onion, lettuce leaves, sliced tomatoes, sliced avocado, and your favorite burger toppings and condiments.",
        "Serve the mushroom burgers with a side of fries or a fresh salad for a delicious and satisfying meal."
      ],
      "img": "https://www.budgetbytes.com/wp-content/uploads/2019/05/Marinated-Portobello-Mushroom-Burgers-dressed-front-500x500.jpg"
    },
    {
      "id": 101,
      "title": "Turkey chili",
      "ingredients": [
        "1 lb (450g) ground turkey",
        "1 can (15 oz/425g) kidney beans, drained and rinsed",
        "1 can (14 oz/400g) diced tomatoes",
        "1 red bell pepper, diced",
        "1 green bell pepper, diced",
        "1 onion, diced",
        "2 cloves garlic, minced",
        "2 cups chicken broth",
        "2 tbsp chili powder",
        "1 tsp ground cumin",
        "1 tsp paprika",
        "Salt and pepper to taste",
        "2 tbsp olive oil",
        "Fresh cilantro, chopped (for garnish)",
        "Shredded cheddar cheese (for serving)",
        "Sour cream (for serving)",
        "Sliced green onions (for garnish)"
      ],
      "prepare": [
        "In a large pot, heat the olive oil over medium heat.",
        "Add the diced onion and minced garlic to the pot. Sauté until the onion becomes translucent.",
        "Add the ground turkey to the pot and cook until it is browned and fully cooked.",
        "Stir in the chili powder, ground cumin, paprika, salt, and pepper, coating the turkey evenly.",
        "Add the diced red and green bell peppers to the pot. Cook for a few minutes until they start to soften.",
        "Add the drained kidney beans and diced tomatoes to the pot.",
        "Pour in the chicken broth and bring the chili to a simmer.",
        "Let the chili cook on low heat for about 15-20 minutes, allowing the flavors to meld together.",
        "Adjust the seasoning with more salt and pepper if needed.",
        "Serve the turkey chili hot, garnished with chopped fresh cilantro and sliced green onions.",
        "Top each bowl of chili with shredded cheddar cheese and a dollop of sour cream for added richness and creaminess."
      ],
      "img": "https://static01.nyt.com/images/2023/01/29/multimedia/29souprex-chili--qfjz/29souprex-chili--qfjz-mediumSquareAt3X.jpg"
    },
    {
      "id": 102,
      "title": "Roasted vegetable and goat cheese tart",
      "ingredients": [
        "1 sheet store-bought puff pastry, thawed",
        "1 cup cherry tomatoes, halved",
        "1 zucchini, sliced",
        "1 yellow squash, sliced",
        "1 red onion, thinly sliced",
        "2 cloves garlic, minced",
        "4 oz (113g) goat cheese, crumbled",
        "2 tbsp olive oil",
        "1 tsp dried thyme",
        "Salt and pepper to taste",
        "Fresh basil leaves, chopped (for garnish)"
      ],
      "prepare": [
        "Preheat the oven to 375°F (190°C).",
        "On a floured surface, roll out the puff pastry sheet to fit a baking sheet.",
        "Transfer the rolled-out pastry to a baking sheet lined with parchment paper.",
        "Using a knife, lightly score a border about 1 inch from the edges of the pastry sheet.",
        "In a bowl, toss the cherry tomatoes, zucchini, yellow squash, and red onion with olive oil, minced garlic, dried thyme, salt, and pepper.",
        "Arrange the seasoned vegetables on the puff pastry within the scored border.",
        "Crumble the goat cheese over the vegetables.",
        "Bake the tart in the preheated oven for about 20-25 minutes, or until the pastry is golden and the vegetables are tender.",
        "Remove the tart from the oven and let it cool slightly.",
        "Garnish the roasted vegetable and goat cheese tart with chopped fresh basil before serving.",
        "This savory and visually appealing tart is a delightful appetizer or main course for any occasion."
      ],
      "img": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/tart_6-fc77481.jpg"
    },
    {
      "id": 103,
      "title": "Spicy Thai noodles",
      "ingredients": [
        "8 oz (225g) rice noodles or any noodles of your choice",
        "1 lb (450g) shrimp, peeled and deveined (you can also use chicken or tofu)",
        "1 red bell pepper, sliced",
        "1 carrot, julienned",
        "1 cup snow peas",
        "4 cloves garlic, minced",
        "2 tbsp soy sauce",
        "2 tbsp oyster sauce",
        "1 tbsp fish sauce",
        "1 tbsp Sriracha sauce (adjust to your spice preference)",
        "1 tbsp brown sugar",
        "2 tbsp vegetable oil",
        "Fresh cilantro leaves, chopped (for garnish)",
        "Sliced green onions (for garnish)",
        "Lime wedges (for serving)"
      ],
      "prepare": [
        "Cook the rice noodles according to the package instructions until they are al dente. Drain and set aside.",
        "In a small bowl, mix together soy sauce, oyster sauce, fish sauce, Sriracha sauce, and brown sugar to make the sauce.",
        "In a wok or a large skillet, heat the vegetable oil over medium-high heat.",
        "Add the minced garlic to the wok and sauté until it becomes fragrant.",
        "Add the shrimp (or chicken/tofu) to the wok and cook until they are pink and fully cooked.",
        "Add the sliced red bell pepper, julienned carrot, and snow peas to the wok. Stir-fry for a few minutes until the vegetables are tender-crisp.",
        "Pour the prepared sauce over the stir-fried shrimp and vegetables in the wok.",
        "Add the cooked rice noodles to the wok, tossing everything together until the noodles are well coated with the sauce.",
        "Taste and adjust the seasoning with more soy sauce, oyster sauce, or Sriracha sauce if desired.",
        "Garnish the spicy Thai noodles with chopped fresh cilantro and sliced green onions.",
        "Serve the noodles hot, accompanied by lime wedges for a zesty and refreshing touch."
      ],
      "img": "https://poshjournal.com/wp-content/uploads/2019/09/spicy-thai-noodles-recipe-15.jpg"
    },
    {
      "id": 104,
      "title": "Slow cooker beef stew",
      "ingredients": [
        "2 lbs (900g) beef stew meat, cut into bite-sized pieces",
        "1 onion, diced",
        "3 carrots, peeled and sliced",
        "2 potatoes, peeled and diced",
        "2 cloves garlic, minced",
        "4 cups beef broth",
        "1 cup red wine (optional)",
        "2 tbsp tomato paste",
        "1 tsp dried thyme",
        "1 tsp dried rosemary",
        "1 bay leaf",
        "Salt and pepper to taste",
        "2 tbsp olive oil",
        "Fresh parsley, chopped (for garnish)"
      ],
      "prepare": [
        "In a large skillet, heat the olive oil over medium-high heat.",
        "Add the beef stew meat to the skillet and cook until it is browned on all sides.",
        "Transfer the browned beef to the slow cooker.",
        "Add the diced onion, sliced carrots, diced potatoes, and minced garlic to the slow cooker.",
        "In a bowl, mix together beef broth, red wine (if using), tomato paste, dried thyme, dried rosemary, bay leaf, salt, and pepper.",
        "Pour the broth mixture over the ingredients in the slow cooker.",
        "Cover the slow cooker and cook the beef stew on low heat for 6-8 hours, or on high heat for 3-4 hours.",
        "Once the beef and vegetables are tender, adjust the seasoning with more salt and pepper if needed.",
        "Garnish the slow cooker beef stew with chopped fresh parsley before serving.",
        "This hearty and comforting stew is perfect for a delicious and satisfying meal on a chilly day."
      ],
      "img": "https://therecipecritic.com/wp-content/uploads/2016/11/beefstew4-500x500.jpg"
    },
    {
      "id": 105,
      "title": "Chicken and broccoli alfredo",
      "ingredients": [
        "8 oz (225g) fettuccine or pasta of your choice",
        "1 lb (450g) boneless, skinless chicken breasts, cut into thin strips",
        "2 cups broccoli florets",
        "2 cups heavy cream",
        "1 cup grated Parmesan cheese",
        "4 cloves garlic, minced",
        "2 tbsp butter",
        "2 tbsp olive oil",
        "Salt and pepper to taste",
        "Fresh parsley, chopped (for garnish)"
      ],
      "prepare": [
        "Cook the fettuccine or pasta according to the package instructions until al dente. Drain and set aside.",
        "In a large skillet, heat 1 tablespoon of butter and 1 tablespoon of olive oil over medium heat.",
        "Add the sliced chicken to the skillet and cook until it is browned and cooked through. Season with salt and pepper.",
        "Remove the cooked chicken from the skillet and set it aside.",
        "In the same skillet, add the remaining tablespoon of butter and tablespoon of olive oil.",
        "Add the minced garlic to the skillet and sauté until it becomes fragrant.",
        "Pour in the heavy cream and bring it to a simmer.",
        "Stir in the grated Parmesan cheese until it melts into the cream sauce.",
        "Add the cooked fettuccine, cooked chicken, and broccoli florets to the sauce, tossing everything together until well coated.",
        "Let the pasta cook in the sauce for a few minutes until the sauce thickens slightly and the broccoli is tender.",
        "Adjust the seasoning with more salt and pepper if needed.",
        "Garnish the chicken and broccoli alfredo with chopped fresh parsley before serving.",
        "This creamy and indulgent pasta dish is a delightful main course for a special dinner."
      ],
      "img": "https://img.buzzfeed.com/video-api-prod/assets/8153374d2a484d6f95196d4d378a6aad/chicken_and_broccoli_alfredo_FB_thumb.jpg"
    },
    {
      "id": 106,
      "title": "Vegetable curry",
      "ingredients": [
        "2 cups mixed vegetables (carrots, potatoes, bell peppers, peas, etc.), diced",
        "1 can (14 oz/400g) coconut milk",
        "1 onion, diced",
        "2 cloves garlic, minced",
        "1 tbsp curry powder",
        "1 tsp ground cumin",
        "1 tsp ground coriander",
        "1/2 tsp turmeric powder",
        "1/2 tsp red pepper flakes (adjust to your spice preference)",
        "2 tbsp vegetable oil",
        "Salt and pepper to taste",
        "Fresh cilantro, chopped (for garnish)",
        "Cooked rice or naan bread (for serving)"
      ],
      "prepare": [
        "In a large skillet, heat the vegetable oil over medium heat.",
        "Add the diced onion and minced garlic to the skillet. Sauté until the onion becomes translucent.",
        "Add the diced mixed vegetables to the skillet and cook for a few minutes until they start to soften.",
        "Stir in the curry powder, ground cumin, ground coriander, turmeric powder, red pepper flakes, salt, and pepper, coating the vegetables evenly.",
        "Pour in the coconut milk and bring the mixture to a simmer.",
        "Let the vegetable curry simmer for about 10-15 minutes, or until the vegetables are tender and the flavors have melded together.",
        "Adjust the seasoning with more salt and pepper if needed.",
        "Garnish the vegetable curry with chopped fresh cilantro before serving.",
        "Serve the flavorful vegetable curry over cooked rice or with warm naan bread for a satisfying and aromatic meal."
      ],
      "img": "https://www.rachelcooks.com/wp-content/uploads/2021/08/vegetarian-curry-1500-10-square-500x500.jpg"
    },
    {
      "id": 107,
      "title": "Chicken and vegetable curry",
      "ingredients": [
        "1 lb (450g) boneless, skinless chicken breasts, cut into bite-sized pieces",
        "2 cups mixed vegetables (carrots, potatoes, bell peppers, peas, etc.), diced",
        "1 can (14 oz/400g) coconut milk",
        "1 onion, diced",
        "2 cloves garlic, minced",
        "1 tbsp curry powder",
        "1 tsp ground cumin",
        "1 tsp ground coriander",
        "1/2 tsp turmeric powder",
        "1/2 tsp red pepper flakes (adjust to your spice preference)",
        "2 tbsp vegetable oil",
        "Salt and pepper to taste",
        "Fresh cilantro, chopped (for garnish)",
        "Cooked rice or naan bread (for serving)"
      ],
      "prepare": [
        "In a large skillet, heat the vegetable oil over medium heat.",
        "Add the diced onion and minced garlic to the skillet. Sauté until the onion becomes translucent.",
        "Add the diced chicken to the skillet and cook until it is browned and cooked through.",
        "Add the diced mixed vegetables to the skillet and cook for a few minutes until they start to soften.",
        "Stir in the curry powder, ground cumin, ground coriander, turmeric powder, red pepper flakes, salt, and pepper, coating the chicken and vegetables evenly.",
        "Pour in the coconut milk and bring the mixture to a simmer.",
        "Let the chicken and vegetable curry simmer for about 10-15 minutes, or until the vegetables are tender and the flavors have melded together.",
        "Adjust the seasoning with more salt and pepper if needed.",
        "Garnish the chicken and vegetable curry with chopped fresh cilantro before serving.",
        "Serve the flavorful chicken and vegetable curry over cooked rice or with warm naan bread for a satisfying and aromatic meal."
      ],
      "img": "https://assets.bonappetit.com/photos/6130e50cda300c741fd2d18e/1:1/w_967,h_967,c_limit/Yellow%20Curry%20Chicken%20With%20Vegetables.jpg"
    },
    {
      "id": 108,
      "title": "Greek-style shrimp and feta pasta",
      "ingredients": [
        "8 oz (225g) penne or any pasta of your choice",
        "1 lb (450g) shrimp, peeled and deveined",
        "1 cup cherry tomatoes, halved",
        "1/2 cup pitted Kalamata olives, sliced",
        "1/2 cup crumbled feta cheese",
        "2 cloves garlic, minced",
        "1/4 cup fresh lemon juice",
        "1/4 cup olive oil",
        "2 tbsp chopped fresh oregano",
        "Salt and pepper to taste",
        "Fresh parsley, chopped (for garnish)"
      ],
      "prepare": [
        "Cook the penne or pasta according to the package instructions until al dente. Drain and set aside.",
        "In a large skillet, heat the olive oil over medium-high heat.",
        "Add the minced garlic to the skillet and sauté until it becomes fragrant.",
        "Add the shrimp to the skillet and cook until they are pink and fully cooked.",
        "Stir in the halved cherry tomatoes, sliced Kalamata olives, fresh lemon juice, chopped fresh oregano, salt, and pepper.",
        "Toss the cooked penne or pasta into the skillet with the shrimp and vegetables, coating everything with the lemony sauce.",
        "Add the crumbled feta cheese and gently toss again to combine.",
        "Adjust the seasoning with more salt and pepper if needed.",
        "Garnish the Greek-style shrimp and feta pasta with chopped fresh parsley before serving.",
        "This Mediterranean-inspired pasta dish is bursting with flavors and textures, making it a delightful main course."
      ],
      "img": "https://media.blueapron.com/recipes/22776/square_newsletter_images/1572362207-33-0002-3174/1202_FPF_Shrimp_0056_SQ_20_Web.jpg?quality=80&width=850&format=pjpg"
    },
    {
      "id": 109,
      "title": "Beef and mushroom risotto",
      "ingredients": [
        "1 lb (450g) beef sirloin, cut into thin strips",
        "1 cup Arborio rice",
        "4 cups beef broth",
        "1 cup sliced mushrooms (cremini or button mushrooms)",
        "1/2 cup grated Parmesan cheese",
        "1/2 cup dry red wine (optional)",
        "1 onion, finely chopped",
        "2 cloves garlic, minced",
        "2 tbsp butter",
        "2 tbsp olive oil",
        "Salt and pepper to taste",
        "Fresh parsley, chopped (for garnish)"
      ],
      "prepare": [
        "In a large skillet or a wide saucepan, heat 1 tablespoon of butter and 1 tablespoon of olive oil over medium heat.",
        "Add the chopped onion and minced garlic to the skillet. Sauté until the onion becomes translucent.",
        "Add the beef strips to the skillet and cook until they are browned on all sides. Season with salt and pepper.",
        "Remove the cooked beef from the skillet and set it aside.",
        "In the same skillet, add the remaining tablespoon of butter and tablespoon of olive oil.",
        "Add the sliced mushrooms to the skillet and cook until they are tender and lightly browned.",
        "Stir in the Arborio rice and cook for a minute or until the rice is coated with the butter and oil.",
        "Pour in the dry red wine (if using) and let it cook until it is mostly absorbed by the rice.",
        "Gradually add the beef broth to the rice, one cup at a time, stirring constantly and allowing the rice to absorb the liquid before adding more.",
        "Continue stirring and adding broth until the rice is creamy and cooked to your desired consistency (usually about 20-25 minutes).",
        "Stir in the grated Parmesan cheese and the cooked beef strips, reserving some beef strips for garnish.",
        "Adjust the seasoning with more salt and pepper if needed.",
        "Garnish the beef and mushroom risotto with the reserved beef strips and chopped fresh parsley before serving.",
        "This rich and savory risotto is a comforting and impressive dish that will delight your taste buds."
      ],
      "img": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F19%2F2007%2F12%2F13%2Fsteak-rs-1694357-x.jpg&q=60"
    },
    {
      "id": 110,
      "title": "Creamy tomato and basil soup",
      "ingredients": [
        "2 cans (28 oz/800g) crushed tomatoes",
        "1 cup vegetable broth",
        "1 cup heavy cream",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1/4 cup fresh basil leaves, chopped",
        "2 tbsp olive oil",
        "1 tbsp butter",
        "1 tsp sugar",
        "Salt and pepper to taste",
        "Grated Parmesan cheese (for garnish)",
        "Fresh basil leaves (for garnish)",
        "Croutons (for garnish)"
      ],
      "prepare": [
        "In a large pot, heat the olive oil and butter over medium heat.",
        "Add the chopped onion and minced garlic to the pot. Sauté until the onion becomes translucent.",
        "Stir in the crushed tomatoes and vegetable broth.",
        "Add the chopped fresh basil leaves and sugar to the pot, stirring to combine.",
        "Season the soup with salt and pepper.",
        "Bring the mixture to a simmer and let it cook for about 15-20 minutes, allowing the flavors to meld together.",
        "Using an immersion blender or a regular blender, blend the soup until it reaches a smooth and creamy consistency.",
        "Return the blended soup to the pot and stir in the heavy cream.",
        "Let the creamy tomato and basil soup simmer for a few more minutes, adjusting the seasoning if needed.",
        "Garnish each serving of soup with grated Parmesan cheese, fresh basil leaves, and croutons for added texture and flavor.",
        "This velvety and luscious soup is perfect for a comforting and satisfying meal, especially when served with a side of warm bread."
      ],
      "img": "https://garlicsaltandlime.com/wp-content/uploads/2022/09/Creamy-tomato-basil-soup-1.jpg"
    },
    {
      "id": 111,
      "title": "Vegetable and quinoa stir-fry",
      "ingredients": [
        "1 cup quinoa",
        "2 cups vegetable broth or water",
        "2 cups mixed vegetables (broccoli, bell peppers, carrots, snap peas, etc.), chopped",
        "1/2 cup chopped green onions",
        "3 cloves garlic, minced",
        "2 tbsp soy sauce",
        "1 tbsp hoisin sauce",
        "1 tbsp sesame oil",
        "1 tbsp vegetable oil",
        "1 tsp grated ginger",
        "Salt and pepper to taste",
        "Sesame seeds (for garnish)",
        "Chopped cilantro (for garnish)",
        "Lime wedges (for serving)"
      ],
      "prepare": [
        "In a fine-mesh sieve, rinse the quinoa under cold running water.",
        "In a medium saucepan, combine the rinsed quinoa and vegetable broth (or water). Bring the mixture to a boil over medium-high heat.",
        "Reduce the heat to low, cover the saucepan, and let the quinoa simmer for about 15-20 minutes or until all the liquid is absorbed and the quinoa is tender.",
        "Fluff the cooked quinoa with a fork and set it aside.",
        "In a large skillet or wok, heat the vegetable oil and sesame oil over medium-high heat.",
        "Add the minced garlic and grated ginger to the skillet. Sauté until they become fragrant.",
        "Add the chopped mixed vegetables to the skillet and stir-fry until they are tender-crisp.",
        "Stir in the cooked quinoa, chopped green onions, soy sauce, and hoisin sauce, tossing everything together to combine.",
        "Season the stir-fry with salt and pepper to taste.",
        "Garnish the vegetable and quinoa stir-fry with sesame seeds and chopped cilantro before serving.",
        "Serve the flavorful stir-fry hot, with lime wedges on the side for a burst of citrusy freshness."
      ],
      "img": "https://avirtualvegan.com/wp-content/uploads/2022/01/Tofu-Quinoa-Stir-Fry-A-Virtual-Vegan-12.jpg"
    },
    {
      "id": 112,
      "title": "Chicken and mushroom stir-fry",
      "ingredients": [
        "1 lb (450g) boneless, skinless chicken breasts, thinly sliced",
        "2 cups sliced mushrooms (button or cremini)",
        "1 bell pepper, thinly sliced",
        "1 onion, thinly sliced",
        "3 cloves garlic, minced",
        "2 tbsp soy sauce",
        "2 tbsp oyster sauce",
        "1 tbsp hoisin sauce",
        "1 tbsp cornstarch",
        "1/4 cup chicken broth or water",
        "2 tbsp vegetable oil",
        "Salt and pepper to taste",
        "Green onions, chopped (for garnish)",
        "Toasted sesame seeds (for garnish)",
        "Cooked rice (for serving)"
      ],
      "prepare": [
        "In a small bowl, mix soy sauce, oyster sauce, hoisin sauce, cornstarch, and chicken broth (or water) to make the sauce.",
        "In a wok or a large skillet, heat 1 tablespoon of vegetable oil over medium-high heat.",
        "Add the sliced chicken to the wok and cook until it is browned and cooked through. Season with salt and pepper.",
        "Remove the cooked chicken from the wok and set it aside.",
        "In the same wok, add another tablespoon of vegetable oil.",
        "Add the minced garlic to the wok and sauté until it becomes fragrant.",
        "Add the sliced mushrooms, bell pepper, and onion to the wok. Stir-fry until the vegetables are tender-crisp.",
        "Pour the prepared sauce over the stir-fried vegetables and toss to coat.",
        "Return the cooked chicken to the wok and stir everything together to combine.",
        "Adjust the seasoning with more soy sauce or salt if needed.",
        "Garnish the chicken and mushroom stir-fry with chopped green onions and toasted sesame seeds.",
        "Serve the delicious stir-fry over cooked rice for a satisfying and flavorful meal."
      ],
      "img": "https://www.sprinklesandsprouts.com/wp-content/uploads/2019/11/Chinese-Chicken-and-Mushroom-SQ.jpg"
    },
    {
      "id": 113,
      "title": "Baked garlic and herb chicken",
      "ingredients": [
        "4 boneless, skinless chicken breasts",
        "4 cloves garlic, minced",
        "2 tbsp fresh lemon juice",
        "2 tbsp olive oil",
        "1 tsp dried thyme",
        "1 tsp dried rosemary",
        "1 tsp dried oregano",
        "1/2 tsp paprika",
        "Salt and pepper to taste",
        "Fresh parsley, chopped (for garnish)",
        "Lemon slices (for garnish)"
      ],
      "prepare": [
        "In a small bowl, mix minced garlic, fresh lemon juice, olive oil, dried thyme, dried rosemary, dried oregano, paprika, salt, and pepper to make the marinade.",
        "Place the chicken breasts in a resealable plastic bag or a shallow dish.",
        "Pour the marinade over the chicken, ensuring that it coats each piece evenly.",
        "Seal the bag or cover the dish, and let the chicken marinate in the refrigerator for at least 1 hour, or ideally, overnight.",
        "Preheat the oven to 400°F (200°C).",
        "Transfer the marinated chicken breasts to a baking dish.",
        "Bake the chicken in the preheated oven for about 25-30 minutes, or until the internal temperature reaches 165°F (74°C) and the chicken is cooked through.",
        "Once baked, remove the chicken from the oven and let it rest for a few minutes.",
        "Garnish the baked garlic and herb chicken with chopped fresh parsley and lemon slices before serving.",
        "This flavorful and tender baked chicken is a delightful main course, perfect for a special dinner or any occasion."
      ],
      "img": "https://www.momontimeout.com/wp-content/uploads/2021/09/whole-roast-chicken-recipe-square.jpeg"
    },

    {
      "id": 114,
      "title": "Spaghetti carbonara",
      "ingredients": [
        "400g spaghetti",
        "150g guanciale or pancetta, diced",
        "3 large egg yolks",
        "1 whole egg",
        "100g freshly grated Parmesan cheese or Pecorino Romano",
        "Freshly ground black pepper",
        "Salt (to taste)"
      ],
      "prepare": [
        "Bring a large pot of salted water to a boil. Cook the spaghetti according to the package instructions until al dente. Drain the pasta, reserving about 1 cup of the pasta water.",
        "While the pasta is cooking, heat a skillet over medium heat. Add the diced guanciale or pancetta and cook until it becomes crispy and golden. Remove the skillet from the heat and set it aside.",
        "In a mixing bowl, whisk together the egg yolks, whole egg, and grated cheese. Season with a generous amount of freshly ground black pepper.",
        "Place the drained pasta in the skillet with the cooked guanciale or pancetta. Toss the pasta and meat together so that the heat from the skillet slightly cooks the eggs without scrambling them.",
        "Add the egg and cheese mixture to the pasta, tossing quickly to coat the spaghetti evenly. The heat from the pasta will help create a creamy sauce. If the pasta seems too dry, add a little reserved pasta water gradually until you reach the desired creamy consistency.",
        "Taste the spaghetti carbonara and season with salt if needed, although the guanciale or pancetta and cheese are usually salty enough.",
        "Serve the Spaghetti Carbonara immediately with an extra sprinkle of grated cheese and black pepper on top."
      ],
      "img": "https://i.pinimg.com/564x/67/12/8a/67128aaecbdb629b366ce9d866aa94b3.jpg"
    },
    {
      "id": 115,
      "title": "Chicken pot pie",
      "ingredients": [
        "1 lb (450g) boneless, skinless chicken breasts, cooked and diced",
        "1 cup frozen mixed vegetables (carrots, peas, corn, green beans)",
        "1/3 cup butter",
        "1/3 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/4 teaspoon onion powder",
        "1/4 teaspoon garlic powder",
        "1 3/4 cups chicken broth",
        "2/3 cup milk",
        "1 package (14 oz) store-bought or homemade pie crusts (2 crusts)"
      ],
      "prepare": [
        "Preheat your oven to 425°F (220°C).",
        "In a large saucepan, melt the butter over medium heat. Stir in the all-purpose flour, salt, black pepper, onion powder, and garlic powder until well combined, creating a roux.",
        "Gradually add the chicken broth and milk to the roux, stirring constantly to avoid lumps. Cook the mixture until it thickens and becomes creamy.",
        "Add the cooked and diced chicken along with the frozen mixed vegetables to the sauce. Mix everything together until the filling is well combined. Remove the saucepan from the heat.",
        "Roll out one pie crust and place it in a 9-inch (23cm) pie dish. Pour the chicken and vegetable filling into the pie crust.",
        "Roll out the second pie crust and place it on top of the filling. Seal the edges of the crusts together and cut slits on the top crust to allow steam to escape.",
        "Bake the chicken pot pie in the preheated oven for 30 to 35 minutes or until the crust is golden brown and the filling is bubbling.",
        "Remove the pie from the oven and let it cool for a few minutes before serving. Enjoy your delicious homemade Chicken Pot Pie!"
      ],
      "img": "https://i.pinimg.com/564x/b0/16/b2/b016b291206932cf044c95109e98d460.jpg"
    },
    {
      "id": 116,
      "title": "Beef enchiladas",
      "ingredients": [
        "1 lb (450g) ground beef",
        "1 small onion, finely chopped",
        "2 cloves garlic, minced",
        "1 can (14 oz) enchilada sauce",
        "1 can (4 oz) chopped green chilies",
        "1 teaspoon ground cumin",
        "1/2 teaspoon chili powder",
        "Salt and pepper (to taste)",
        "1 1/2 cups shredded cheddar or Mexican cheese blend",
        "8 small flour tortillas",
        "Chopped fresh cilantro and sliced green onions (for garnish)"
      ],
      "prepare": [
        "Preheat your oven to 375°F (190°C).",
        "In a large skillet, cook the ground beef over medium heat until it's no longer pink. Drain any excess grease.",
        "Add the finely chopped onion and minced garlic to the skillet with the cooked beef. Sauté until the onion becomes translucent.",
        "Stir in half of the enchilada sauce, chopped green chilies, ground cumin, chili powder, salt, and pepper. Let the mixture simmer for a few minutes, allowing the flavors to meld.",
        "Take a 9x13-inch (23x33cm) baking dish and spread a thin layer of the remaining enchilada sauce on the bottom.",
        "To assemble the enchiladas, spoon a generous amount of the beef mixture onto each flour tortilla. Sprinkle some shredded cheese on top of the beef filling, reserving some for later.",
        "Roll up the tortillas tightly and place them seam side down in the prepared baking dish.",
        "Pour the rest of the enchilada sauce over the rolled-up tortillas, covering them evenly.",
        "Sprinkle the remaining shredded cheese on top of the enchiladas.",
        "Cover the baking dish with aluminum foil and bake in the preheated oven for about 20-25 minutes, or until the enchiladas are heated through and the cheese is melted.",
        "Remove the foil and bake for an additional 5 minutes or until the cheese becomes bubbly and slightly golden.",
        "Garnish the Beef Enchiladas with chopped fresh cilantro and sliced green onions before serving. Enjoy this flavorful and cheesy Mexican dish!"
      ],
      "img": "https://i.pinimg.com/564x/fd/46/db/fd46db5d50afee28860df73cdae2cf18.jpg"
    },
    {
      "id": 117,
      "title": "Beef and broccoli noodle stir-fry",
      "ingredients": [
        "8 oz (225g) stir-fry rice noodles",
        "1 lb (450g) beef sirloin or flank steak, thinly sliced",
        "3 cups broccoli florets",
        "3 tablespoons soy sauce",
        "2 tablespoons oyster sauce",
        "2 tablespoons hoisin sauce",
        "1 tablespoon sesame oil",
        "2 tablespoons vegetable oil",
        "3 cloves garlic, minced",
        "1 teaspoon fresh ginger, grated",
        "1/4 teaspoon red pepper flakes (optional)",
        "2 green onions, sliced (for garnish)",
        "Toasted sesame seeds (for garnish)"
      ],
      "prepare": [
        "Cook the stir-fry rice noodles according to the package instructions until they are al dente. Drain and set them aside.",
        "In a bowl, marinate the thinly sliced beef with soy sauce, oyster sauce, and hoisin sauce. Let it sit for about 10-15 minutes to absorb the flavors.",
        "In a large wok or skillet, heat the vegetable oil over medium-high heat. Add the marinated beef slices and stir-fry until they are cooked to your desired level of doneness. Remove the beef from the wok and set it aside.",
        "In the same wok, add the minced garlic, grated ginger, and red pepper flakes (if using). Stir-fry for a minute or until the aromatics become fragrant.",
        "Add the broccoli florets to the wok and stir-fry for a few minutes until they are tender-crisp.",
        "Return the cooked beef to the wok with the broccoli. Toss everything together.",
        "Add the cooked stir-fry rice noodles to the wok. Drizzle sesame oil over the noodles and toss all the ingredients together until they are well combined and heated through.",
        "Taste the stir-fry and adjust the seasoning if needed by adding more soy sauce, oyster sauce, or hoisin sauce.",
        "Garnish the Beef and Broccoli Noodle Stir-Fry with sliced green onions and toasted sesame seeds before serving.",
        "Serve the delicious Beef and Broccoli Noodle Stir-Fry hot and enjoy!"
      ],
      "img": "https://i.pinimg.com/564x/65/be/c0/65bec0aaeafb7ee683d5dc299d5e5552.jpg"
    },
    {
      "id": 118,
      "title": "Chicken cacciatore",
      "ingredients": [
        "4 bone-in, skin-on chicken thighs",
        "Salt and pepper (to taste)",
        "1/2 cup all-purpose flour (for dredging)",
        "2 tablespoons olive oil",
        "1 small onion, finely chopped",
        "1 red bell pepper, sliced",
        "1 yellow bell pepper, sliced",
        "3 cloves garlic, minced",
        "1 can (14 oz) diced tomatoes",
        "1/2 cup chicken broth",
        "1/2 cup dry red wine",
        "1 teaspoon dried oregano",
        "1 teaspoon dried basil",
        "1/2 teaspoon dried thyme",
        "1/4 teaspoon red pepper flakes (optional)",
        "1/4 cup pitted black olives",
        "2 tablespoons capers, drained",
        "Fresh parsley, chopped (for garnish)"
      ],
      "prepare": [
        "Season the chicken thighs with salt and pepper. Dredge them in flour, shaking off any excess.",
        "In a large skillet or Dutch oven, heat the olive oil over medium-high heat. Add the chicken thighs and cook them until they are browned on both sides. Remove the chicken from the skillet and set it aside.",
        "In the same skillet, add the chopped onion and sliced bell peppers. Sauté them until they are softened.",
        "Add the minced garlic to the skillet and cook for about a minute until it becomes fragrant.",
        "Stir in the diced tomatoes, chicken broth, and red wine. Bring the mixture to a simmer.",
        "Return the browned chicken thighs to the skillet with the sauce. Sprinkle dried oregano, basil, thyme, and red pepper flakes (if using) over the chicken.",
        "Cover the skillet and let the chicken cacciatore simmer on low heat for about 30 minutes, or until the chicken is cooked through and tender.",
        "Stir in the black olives and drained capers. Let the dish simmer for an additional 5 minutes to allow the flavors to meld.",
        "Taste the chicken cacciatore and adjust the seasoning if needed with salt and pepper.",
        "Garnish the Chicken Cacciatore with chopped fresh parsley before serving.",
        "Serve the flavorful Chicken Cacciatore with your choice of pasta, rice, or crusty bread. Enjoy this hearty Italian dish!"
      ],
      "img": "https://i.pinimg.com/564x/49/1e/e6/491ee6a09c32475bdf57a5f56ca67d0c.jpg"
    },
    {
      "id": 119,
      "title": " Baked cod",
      "ingredients": [
        "4 cod fillets",
        "2 tablespoons olive oil",
        "1 lemon",
        "2 cloves garlic, minced",
        "1 teaspoon dried oregano",
        "1 teaspoon dried thyme",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/4 teaspoon paprika",
        "Fresh parsley, for garnish"
      ],
      "prepare": [
        "1. Preheat the oven to 375°F (190°C).",
        "2. Rinse the cod fillets under cold water and pat them dry with paper towels.",
        "3. Place the cod fillets in a baking dish and drizzle with olive oil.",
        "4. Squeeze the juice of half a lemon over the fillets.",
        "5. Sprinkle the minced garlic, dried oregano, dried thyme, salt, black pepper, and paprika evenly over the cod fillets.",
        "6. Cut the other half of the lemon into thin slices and place them on top of the fillets.",
        "7. Cover the baking dish with aluminum foil and bake in the preheated oven for 15-20 minutes or until the cod is cooked through and flakes easily with a fork.",
        "8. Remove the foil for the last 5 minutes of baking to allow the top to slightly brown.",
        "9. Once the cod is done baking, garnish with fresh parsley.",
        "10. Serve the baked cod with your favorite side dishes and enjoy!"
      ],
      "img": "https://i.pinimg.com/564x/15/6e/d2/156ed2ff272a9f8ac5c107756ecdefed.jpg"
    },
    {
      "id": 120,
      "title": "Tomato and basil bruschetta",
      "ingredients": [
        "4-5 ripe tomatoes, diced",
        "1/4 cup fresh basil leaves, chopped",
        "2 cloves garlic, minced",
        "2 tablespoons balsamic vinegar",
        "3 tablespoons extra virgin olive oil",
        "1 French baguette, sliced",
        "Salt and black pepper to taste",
        "Grated Parmesan cheese (optional)"
      ],
      "prepare": [
        "1. In a bowl, combine the diced tomatoes, chopped basil, minced garlic, balsamic vinegar, and extra virgin olive oil. Mix well.",
        "2. Season the tomato mixture with salt and black pepper to taste. Refrigerate for at least 15-20 minutes to allow the flavors to meld.",
        "3. While the tomato mixture is marinating, preheat your oven to 375°F (190°C).",
        "4. Arrange the sliced baguette on a baking sheet in a single layer. Drizzle with a little olive oil and toast them in the preheated oven for about 5-7 minutes or until they are lightly golden and crispy.",
        "5. Remove the toasted baguette slices from the oven and let them cool slightly.",
        "6. Take the tomato and basil mixture out of the refrigerator and give it a final stir.",
        "7. Spoon the tomato and basil mixture generously over each toasted baguette slice.",
        "8. If desired, sprinkle some grated Parmesan cheese over the top of each bruschetta for extra flavor.",
        "9. Arrange the bruschetta on a serving platter and serve immediately as a delicious appetizer or snack.",
        "10. Enjoy your fresh and flavorful Tomato and Basil Bruschetta!"
      ],
      "img": "https://i.pinimg.com/564x/61/46/d7/6146d7494cc4a6fbdda9fdf4b918ded1.jpg"
    },
    {
      "id": 121,
      "title": "Beef and vegetable shepherd's pie",
      "ingredients": [
        "1 lb (450g) ground beef",
        "1 tablespoon vegetable oil",
        "1 onion, chopped",
        "2 carrots, diced",
        "2 cloves garlic, minced",
        "1 cup frozen peas",
        "1 cup frozen corn",
        "2 tablespoons tomato paste",
        "1 cup beef broth",
        "1 teaspoon Worcestershire sauce",
        "1 teaspoon dried thyme",
        "1 teaspoon dried rosemary",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "4 cups mashed potatoes",
        "1/2 cup shredded cheddar cheese (optional)"
      ],
      "prepare": [
        "1. Preheat the oven to 375°F (190°C).",
        "2. In a large skillet, heat the vegetable oil over medium heat. Add the chopped onion and diced carrots, and sauté until they start to soften, about 5 minutes.",
        "3. Add the minced garlic and ground beef to the skillet. Cook the beef until it's browned and cooked through. Drain any excess fat if needed.",
        "4. Stir in the frozen peas, frozen corn, tomato paste, beef broth, Worcestershire sauce, dried thyme, dried rosemary, salt, and black pepper. Let the mixture simmer for about 5-7 minutes, allowing the flavors to meld together.",
        "5. Grease a 9x13-inch baking dish and transfer the beef and vegetable mixture into it, spreading it out evenly.",
        "6. Spread the mashed potatoes over the top of the beef mixture, covering it entirely. You can use the back of a spoon to smooth out the mashed potatoes.",
        "7. If desired, sprinkle shredded cheddar cheese over the mashed potatoes for a cheesy topping.",
        "8. Place the baking dish in the preheated oven and bake for 25-30 minutes, or until the shepherd's pie is heated through and the mashed potatoes have developed a golden crust.",
        "9. Remove the shepherd's pie from the oven and let it cool for a few minutes before serving.",
        "10. Serve the Beef and Vegetable Shepherd's Pie hot and enjoy this comforting and hearty dish!"
      ],
      "img": "https://i.pinimg.com/564x/e8/6c/e9/e86ce97b2aecc213254c8c77d9b1eb57.jpg"
    },
    {
      "id": 122,
      "title": "Grilled pork chops",
      "ingredients": [
        "4 bone-in pork chops (about 1 inch thick)",
        "2 tablespoons olive oil",
        "2 tablespoons soy sauce",
        "2 tablespoons Worcestershire sauce",
        "2 cloves garlic, minced",
        "1 teaspoon dried thyme",
        "1 teaspoon dried rosemary",
        "1/2 teaspoon paprika",
        "1/2 teaspoon black pepper",
        "1/4 teaspoon salt",
        "Juice of 1 lemon",
        "Fresh parsley, for garnish (optional)"
      ],
      "prepare": [
        "1. In a bowl, whisk together the olive oil, soy sauce, Worcestershire sauce, minced garlic, dried thyme, dried rosemary, paprika, black pepper, salt, and lemon juice.",
        "2. Place the pork chops in a shallow dish or a resealable plastic bag.",
        "3. Pour the marinade over the pork chops, making sure they are evenly coated. Cover the dish or seal the bag and refrigerate for at least 1-2 hours to marinate. For best results, marinate overnight.",
        "4. Preheat your grill to medium-high heat.",
        "5. Remove the marinated pork chops from the refrigerator and let them sit at room temperature for about 15-20 minutes before grilling.",
        "6. Brush the grill grates with oil to prevent sticking. Remove the pork chops from the marinade, shaking off any excess, and place them on the hot grill.",
        "7. Grill the pork chops for 4-5 minutes per side, or until they reach an internal temperature of 145°F (63°C). Cooking time may vary depending on the thickness of the pork chops.",
        "8. Once the pork chops are cooked, remove them from the grill and let them rest for a few minutes before serving.",
        "9. If desired, garnish with fresh parsley before serving.",
        "10. Serve the Grilled Pork Chops with your favorite side dishes and enjoy a delicious and flavorful meal!"
      ],
      "img": "https://i.pinimg.com/564x/8f/86/81/8f8681dca231935aa9b0f2c0a2ea4de3.jpg"
    },
    {
      "id": 123,
      "title": "Chicken satay",
      "ingredients": [
        "1 lb (450g) boneless, skinless chicken breasts or thighs, cut into thin strips",
        "1/4 cup coconut milk",
        "2 tablespoons soy sauce",
        "1 tablespoon curry powder",
        "1 tablespoon brown sugar",
        "1 tablespoon vegetable oil",
        "1 tablespoon lime juice",
        "2 cloves garlic, minced",
        "1 teaspoon ground turmeric",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground coriander",
        "1/4 teaspoon cayenne pepper (optional, for some heat)",
        "Bamboo skewers, soaked in water for 30 minutes",
        "Peanut sauce, for serving (store-bought or homemade)",
        "Chopped peanuts and fresh cilantro, for garnish"
      ],
      "prepare": [
        "1. In a bowl, combine the coconut milk, soy sauce, curry powder, brown sugar, vegetable oil, lime juice, minced garlic, ground turmeric, ground cumin, ground coriander, and cayenne pepper (if using). Mix well to make the marinade.",
        "2. Add the chicken strips to the marinade, ensuring they are coated evenly. Cover the bowl with plastic wrap or transfer everything to a resealable plastic bag. Refrigerate and let the chicken marinate for at least 2 hours, preferably overnight.",
        "3. Preheat your grill or grill pan over medium-high heat.",
        "4. Thread the marinated chicken strips onto the soaked bamboo skewers. Discard the leftover marinade.",
        "5. Grease the grill grates lightly to prevent sticking. Place the chicken skewers on the grill and cook for about 3-4 minutes on each side or until the chicken is cooked through and has grill marks.",
        "6. Once the chicken satay is cooked, remove them from the grill and let them rest for a minute.",
        "7. Arrange the Chicken Satay on a serving platter and garnish with chopped peanuts and fresh cilantro.",
        "8. Serve the Chicken Satay with peanut sauce on the side for dipping.",
        "9. Enjoy your delicious and flavorful Chicken Satay as an appetizer or main course!"
      ],
      "img": "https://i.pinimg.com/564x/bd/7b/48/bd7b48c4f98ab35600b459fcfbc61f86.jpg"
    },
    {
      "id": 124,
      "title": "Greek-style baked fish",
      "ingredients": [
        "4 fish fillets (such as cod, haddock, or tilapia)",
        "1/4 cup olive oil",
        "Juice of 1 lemon",
        "2 cloves garlic, minced",
        "1 teaspoon dried oregano",
        "1 teaspoon dried thyme",
        "1 teaspoon dried rosemary",
        "1/2 teaspoon dried basil",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/4 teaspoon red pepper flakes (optional, for some heat)",
        "1 large tomato, sliced",
        "1/2 red onion, thinly sliced",
        "Kalamata olives, pitted and halved, for garnish",
        "Fresh parsley, chopped, for garnish"
      ],
      "prepare": [
        "1. Preheat the oven to 375°F (190°C).",
        "2. In a small bowl, whisk together the olive oil, lemon juice, minced garlic, dried oregano, dried thyme, dried rosemary, dried basil, salt, black pepper, and red pepper flakes (if using).",
        "3. Place the fish fillets in a baking dish and pour the prepared marinade over them, making sure they are coated evenly. Let the fish marinate for about 15-20 minutes.",
        "4. While the fish is marinating, slice the tomato and red onion.",
        "5. Arrange the tomato and red onion slices over the fish fillets in the baking dish. Add the halved Kalamata olives on top.",
        "6. Cover the baking dish with aluminum foil and bake in the preheated oven for 20-25 minutes or until the fish is cooked through and flakes easily with a fork.",
        "7. Remove the foil for the last 5 minutes of baking to allow the top to slightly brown.",
        "8. Once the fish is done baking, garnish with fresh chopped parsley.",
        "9. Serve the Greek-Style Baked Fish with your favorite side dishes or a Greek salad, and enjoy this delightful and flavorful Mediterranean-inspired dish!"
      ],
      "img": "https://i.pinimg.com/564x/d1/ee/c1/d1eec10bf9c21c7bd2514fe35241ec64.jpg"
    },
    {
      "id": 125,
      "title": "Beef and mushroom pot pie",
      "ingredients": [
        "1 lb (450g) beef stew meat, cubed",
        "1/4 cup all-purpose flour",
        "3 tablespoons butter",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "2 cups sliced mushrooms",
        "1 cup diced carrots",
        "1 cup frozen peas",
        "2 cups beef broth",
        "1/2 cup red wine (optional)",
        "1 teaspoon dried thyme",
        "1 teaspoon dried rosemary",
        "Salt and black pepper to taste",
        "1 package (14 oz) refrigerated pie crusts",
        "1 egg, beaten (for egg wash)"
      ],
      "prepare": [
        "1. Preheat the oven to 375°F (190°C).",
        "2. In a large bowl, coat the beef stew meat with the all-purpose flour, salt, and black pepper.",
        "3. In a large pot or Dutch oven, melt the butter over medium heat. Add the chopped onion and minced garlic, and sauté until they become soft and translucent.",
        "4. Add the floured beef cubes to the pot and cook until the meat is browned on all sides.",
        "5. Stir in the sliced mushrooms, diced carrots, and frozen peas. Cook for a few minutes until the vegetables start to soften.",
        "6. Pour in the beef broth and red wine (if using), stirring to combine all the ingredients.",
        "7. Add the dried thyme and dried rosemary to the pot, and season with additional salt and black pepper to taste. Bring the mixture to a simmer.",
        "8. Cover the pot and let the beef and vegetable mixture simmer for about 30-40 minutes, or until the beef is tender and the flavors have melded together.",
        "9. While the filling is simmering, roll out one pie crust and place it in the bottom of a greased 9-inch pie dish.",
        "10. Once the filling is done, pour it into the pie dish over the bottom crust.",
        "11. Roll out the second pie crust and place it on top of the filling. Seal the edges of the crusts together and crimp with a fork.",
        "12. Cut a few slits in the top crust to allow steam to escape during baking.",
        "13. Brush the top crust with the beaten egg to give it a golden color while baking.",
        "14. Place the pot pie on a baking sheet to catch any drips, and bake in the preheated oven for about 30-35 minutes, or until the crust is golden and the filling is bubbling.",
        "15. Remove the Beef and Mushroom Pot Pie from the oven and let it cool for a few minutes before serving.",
        "16. Enjoy the comforting and delicious Beef and Mushroom Pot Pie with your favorite sides!"
      ],
      "img": "https://i.pinimg.com/564x/ac/a1/c0/aca1c02d5ea8178e9bc97e23fa514e3a.jpg"
    },
    {
      "id": 126,
      "title": "Vegetable and tofu stir-fry",
      "ingredients": [
        "14 oz (400g) firm tofu, drained and cubed",
        "2 tablespoons soy sauce",
        "1 tablespoon cornstarch",
        "2 tablespoons vegetable oil, divided",
        "1 onion, sliced",
        "2 bell peppers (any color), sliced",
        "2 cups broccoli florets",
        "1 cup sliced carrots",
        "1 cup snow peas",
        "3 cloves garlic, minced",
        "1 tablespoon fresh ginger, grated",
        "1/4 cup vegetable broth or water",
        "2 tablespoons hoisin sauce",
        "1 tablespoon rice vinegar",
        "1 tablespoon sesame oil",
        "1 tablespoon sesame seeds (optional, for garnish)",
        "4 cups cooked rice, for serving"
      ],
      "prepare": [
        "1. In a bowl, combine the cubed tofu with soy sauce and cornstarch. Gently toss to coat the tofu evenly, being careful not to break the tofu cubes. Let it marinate for 10-15 minutes.",
        "2. In a large skillet or wok, heat 1 tablespoon of vegetable oil over medium-high heat. Add the marinated tofu to the skillet and cook until it becomes golden and slightly crispy. Remove the tofu from the skillet and set it aside.",
        "3. In the same skillet, add the remaining tablespoon of vegetable oil. Stir in the sliced onion, bell peppers, broccoli florets, sliced carrots, and snow peas. Cook for about 5-7 minutes or until the vegetables are crisp-tender.",
        "4. Add the minced garlic and grated ginger to the vegetables, and sauté for another minute until fragrant.",
        "5. Pour the vegetable broth or water into the skillet to deglaze it, scraping up any browned bits from the bottom.",
        "6. Return the cooked tofu to the skillet and toss everything together.",
        "7. In a small bowl, mix the hoisin sauce, rice vinegar, and sesame oil. Pour the sauce over the tofu and vegetables, stirring to coat them thoroughly.",
        "8. If desired, sprinkle sesame seeds on top for garnish.",
        "9. Serve the Vegetable and Tofu Stir-Fry over cooked rice and enjoy this delicious and nutritious plant-based dish!"
      ],
      "img": "https://i.pinimg.com/564x/60/a2/b7/60a2b76cc3f45307eb1f936cbb5f80ae.jpg"
    },
    {
      "id": 127,
      "title": "Chili lime shrimp skewers",
      "ingredients": [
        "1 lb (450g) large shrimp, peeled and deveined",
        "2 tablespoons olive oil",
        "2 tablespoons fresh lime juice",
        "1 tablespoon honey",
        "1 teaspoon chili powder",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon paprika",
        "1/4 teaspoon cayenne pepper (adjust to your spice preference)",
        "Salt and black pepper to taste",
        "Fresh cilantro, chopped, for garnish",
        "Lime wedges, for serving"
      ],
      "prepare": [
        "1. In a bowl, combine the olive oil, fresh lime juice, honey, chili powder, garlic powder, paprika, cayenne pepper, salt, and black pepper. Mix well to make the marinade.",
        "2. Add the peeled and deveined shrimp to the marinade, tossing to coat them thoroughly. Cover the bowl with plastic wrap and let the shrimp marinate in the refrigerator for about 20-30 minutes.",
        "3. If using wooden skewers, soak them in water for about 15-20 minutes to prevent them from burning on the grill.",
        "4. Preheat your grill or grill pan to medium-high heat.",
        "5. Thread the marinated shrimp onto the skewers, piercing them through the tail and head to keep them in place.",
        "6. Grease the grill grates lightly to prevent sticking. Place the shrimp skewers on the hot grill and cook for 2-3 minutes on each side or until the shrimp turn pink and opaque.",
        "7. Once the shrimp are cooked, remove them from the grill and transfer to a serving platter.",
        "8. Garnish the Chili Lime Shrimp Skewers with chopped fresh cilantro.",
        "9. Serve the shrimp skewers with lime wedges on the side for an extra zesty kick.",
        "10. Enjoy the Chili Lime Shrimp Skewers as a delicious appetizer or main course, and savor the vibrant flavors!"
      ],
      "img": "https://i.pinimg.com/564x/da/7c/50/da7c50290e01bf6bfd26a7d1ad8f6e00.jpg"
    },
    {
      "id": 128,
      "title": "Roasted vegetable quinoa bowl",
      "ingredients": [
        "1 cup quinoa",
        "2 cups vegetable broth or water",
        "1 red bell pepper, sliced",
        "1 yellow bell pepper, sliced",
        "1 zucchini, sliced",
        "1 cup cherry tomatoes",
        "1 red onion, sliced",
        "3 tablespoons olive oil",
        "2 cloves garlic, minced",
        "1 teaspoon dried oregano",
        "1 teaspoon dried thyme",
        "1/2 teaspoon dried rosemary",
        "Salt and black pepper to taste",
        "1/4 cup balsamic vinegar",
        "1/4 cup crumbled feta cheese (optional)",
        "Fresh basil leaves, for garnish"
      ],
      "prepare": [
        "1. Preheat the oven to 425°F (220°C).",
        "2. Rinse the quinoa under cold water and drain it well.",
        "3. In a saucepan, combine the rinsed quinoa and vegetable broth or water. Bring to a boil, then reduce the heat to low, cover, and simmer for about 15-20 minutes or until the quinoa is cooked and the liquid is absorbed. Fluff the quinoa with a fork.",
        "4. While the quinoa is cooking, prepare the roasted vegetables. In a large bowl, toss the red and yellow bell pepper slices, zucchini slices, cherry tomatoes, and red onion slices with olive oil, minced garlic, dried oregano, dried thyme, dried rosemary, salt, and black pepper.",
        "5. Spread the seasoned vegetables in a single layer on a baking sheet lined with parchment paper.",
        "6. Roast the vegetables in the preheated oven for 20-25 minutes or until they are tender and slightly charred.",
        "7. Drizzle the roasted vegetables with balsamic vinegar and toss to coat them evenly.",
        "8. In serving bowls, layer the cooked quinoa and roasted vegetables.",
        "9. If desired, sprinkle crumbled feta cheese over the top for added creaminess and flavor.",
        "10. Garnish the Roasted Vegetable Quinoa Bowls with fresh basil leaves.",
        "11. Serve the bowls warm and enjoy this nutritious and delicious plant-based meal!"
      ],
      "img": "https://i.pinimg.com/564x/68/11/6d/68116dd74b767076f9c6a54e1a0cf8f3.jpg"
    },
    {
      "id": 129,
      "title": "Creamy mushroom and chicken pasta",
      "ingredients": [
        "8 oz (225g) fettuccine or any pasta of your choice",
        "1 lb (450g) boneless, skinless chicken breasts, cut into bite-sized pieces",
        "2 tablespoons olive oil, divided",
        "1 tablespoon butter",
        "8 oz (225g) mushrooms, sliced",
        "3 cloves garlic, minced",
        "1 cup chicken broth",
        "1 cup heavy cream",
        "1/2 cup grated Parmesan cheese",
        "1 teaspoon dried thyme",
        "Salt and black pepper to taste",
        "Fresh parsley, chopped, for garnish"
      ],
      "prepare": [
        "1. Cook the pasta according to the package instructions until al dente. Drain and set aside.",
        "2. In a large skillet, heat 1 tablespoon of olive oil over medium-high heat. Add the chicken pieces and season with salt and black pepper. Cook until the chicken is golden brown and cooked through. Remove the chicken from the skillet and set it aside.",
        "3. In the same skillet, add the remaining tablespoon of olive oil and butter. Once the butter has melted, add the sliced mushrooms and cook until they are tender and lightly browned.",
        "4. Add the minced garlic to the mushrooms and sauté for about 1 minute until fragrant.",
        "5. Pour in the chicken broth and heavy cream, and bring the mixture to a simmer. Let it cook for a few minutes until it thickens slightly.",
        "6. Stir in the grated Parmesan cheese and dried thyme, and continue to cook until the cheese is melted and the sauce becomes creamy.",
        "7. Add the cooked chicken back to the skillet, stirring to coat it with the creamy mushroom sauce.",
        "8. Season the sauce with additional salt and black pepper to taste.",
        "9. Toss the cooked pasta in the creamy mushroom and chicken sauce until well coated.",
        "10. Garnish the Creamy Mushroom and Chicken Pasta with chopped fresh parsley.",
        "11. Serve the pasta dish hot and enjoy a comforting and flavorful meal!"
      ],
      "img": "https://i.pinimg.com/564x/0a/d5/98/0ad598c61d420d384f9125e95a818596.jpg"
    },
    {
      "id": 130,
      "title": "Greek-style stuffed zucchini",
      "ingredients": [
        "4 large zucchini",
        "1 cup cooked rice",
        "1/2 lb (225g) ground beef or lamb",
        "1 onion, finely chopped",
        "2 cloves garlic, minced",
        "1 tomato, diced",
        "1/4 cup chopped fresh parsley",
        "1/4 cup chopped fresh dill",
        "1/4 cup crumbled feta cheese",
        "2 tablespoons olive oil",
        "1 teaspoon dried oregano",
        "1 teaspoon dried thyme",
        "Salt and black pepper to taste",
        "1 cup tomato sauce",
        "1/2 cup water"
      ],
      "prepare": [
        "1. Preheat the oven to 375°F (190°C).",
        "2. Cut the tops off the zucchini and scoop out the seeds and flesh to create a hollow cavity. Reserve the scooped-out flesh in a bowl.",
        "3. In a skillet, heat 1 tablespoon of olive oil over medium heat. Add the chopped onion and minced garlic, and sauté until they become soft and translucent.",
        "4. Add the ground beef or lamb to the skillet and cook until it's browned and fully cooked. Drain any excess fat if needed.",
        "5. Chop the reserved zucchini flesh and add it to the skillet along with the diced tomato. Cook for a few minutes until the vegetables are tender.",
        "6. Stir in the cooked rice, chopped parsley, chopped dill, crumbled feta cheese, dried oregano, dried thyme, salt, and black pepper. Mix well to combine all the ingredients.",
        "7. Stuff each hollowed zucchini with the filling mixture, pressing it down gently to pack it in.",
        "8. Grease a baking dish with the remaining olive oil and arrange the stuffed zucchini in the dish.",
        "9. In a small bowl, mix the tomato sauce and water. Pour the tomato sauce mixture over the stuffed zucchini in the baking dish.",
        "10. Cover the dish with aluminum foil and bake in the preheated oven for 30 minutes.",
        "11. Remove the foil and bake for an additional 15-20 minutes or until the zucchini are tender and the tops are lightly browned.",
        "12. Once the Greek-Style Stuffed Zucchini are done baking, remove them from the oven and let them cool for a few minutes before serving.",
        "13. Serve the stuffed zucchini hot, and enjoy this delicious and wholesome Greek-inspired dish!"
      ],
      "img": "https://i.pinimg.com/564x/ac/38/32/ac383248abe85ad1905d96f75f314489.jpg"
    },
    {
      "id": 131,
      "title": "Grilled vegetable kebabs",
      "ingredients": [
        "2 zucchinis, sliced into thick rounds",
        "1 red bell pepper, cut into chunks",
        "1 yellow bell pepper, cut into chunks",
        "1 red onion, cut into chunks",
        "1 cup cherry tomatoes",
        "8-10 white button mushrooms",
        "2 tablespoons olive oil",
        "2 tablespoons balsamic vinegar",
        "2 cloves garlic, minced",
        "1 teaspoon dried oregano",
        "1 teaspoon dried thyme",
        "Salt and black pepper to taste",
        "Wooden or metal skewers"
      ],
      "prepare": [
        "1. If using wooden skewers, soak them in water for about 30 minutes to prevent them from burning on the grill.",
        "2. In a large bowl, combine the sliced zucchinis, red and yellow bell peppers, red onion chunks, cherry tomatoes, and white button mushrooms.",
        "3. In a separate bowl, whisk together the olive oil, balsamic vinegar, minced garlic, dried oregano, dried thyme, salt, and black pepper to make the marinade.",
        "4. Pour the marinade over the vegetables and toss them to coat them evenly. Let the vegetables marinate for about 20-30 minutes.",
        "5. Preheat your grill to medium-high heat.",
        "6. Thread the marinated vegetables onto the skewers, alternating the different veggies to create colorful kebabs.",
        "7. Place the vegetable kebabs on the hot grill and cook for 8-10 minutes, turning them occasionally to ensure even cooking. The vegetables should be slightly charred and tender.",
        "8. Once the Grilled Vegetable Kebabs are done, remove them from the grill and transfer them to a serving platter.",
        "9. Serve the kebabs as a delicious and healthy side dish or with your favorite protein for a complete meal.",
        "10. Enjoy these flavorful and colorful Grilled Vegetable Kebabs with family and friends!"
      ],
      "img": "https://i.pinimg.com/564x/ff/c8/15/ffc815d46404151121271b8e657e8618.jpg"
    },
    {
      "id": 132,
      "title": "Chicken and vegetable curry",
      "ingredients": [
        "1 lb (450g) boneless, skinless chicken breasts or thighs, cut into bite-sized pieces",
        "2 tablespoons vegetable oil",
        "1 large onion, finely chopped",
        "3 cloves garlic, minced",
        "1 tablespoon fresh ginger, grated",
        "2 tablespoons curry powder",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "1/2 teaspoon turmeric",
        "1/4 teaspoon cayenne pepper (adjust to your spice preference)",
        "1 can (14 oz) diced tomatoes",
        "1 can (14 oz) coconut milk",
        "1 cup chicken broth",
        "1 cup chopped carrots",
        "1 cup chopped potatoes",
        "1 cup chopped bell peppers (any color)",
        "1 cup chopped green beans",
        "Salt and black pepper to taste",
        "Fresh cilantro, chopped, for garnish",
        "Cooked rice or naan bread, for serving"
      ],
      "prepare": [
        "1. In a large skillet or pot, heat the vegetable oil over medium-high heat.",
        "2. Add the chopped onion, minced garlic, and grated ginger to the skillet. Sauté until the onions become soft and translucent.",
        "3. Add the curry powder, ground cumin, ground coriander, turmeric, and cayenne pepper to the skillet. Cook for a minute or two until the spices release their fragrance.",
        "4. Add the bite-sized chicken pieces to the skillet and cook until they are browned on all sides.",
        "5. Pour in the diced tomatoes, coconut milk, and chicken broth, stirring to combine all the ingredients.",
        "6. Add the chopped carrots, potatoes, bell peppers, and green beans to the skillet. Season with salt and black pepper to taste.",
        "7. Bring the curry to a simmer, then reduce the heat to low, cover, and let it cook for about 20-25 minutes or until the chicken is fully cooked and the vegetables are tender.",
        "8. Taste the curry and adjust the seasoning if needed.",
        "9. Serve the Chicken and Vegetable Curry over cooked rice or with naan bread.",
        "10. Garnish with chopped fresh cilantro before serving.",
        "11. Enjoy this aromatic and flavorful Chicken and Vegetable Curry as a hearty and satisfying meal!"
      ],
      "img": "https://i.pinimg.com/564x/55/8b/f9/558bf9d85e3651514caef520555db3b5.jpg"
    },
    {
      "id": 133,
      "title": "Baked ratatouille",
      "ingredients": [
        "1 eggplant, sliced into rounds",
        "2 zucchinis, sliced into rounds",
        "1 yellow bell pepper, sliced",
        "1 red bell pepper, sliced",
        "1 large onion, sliced",
        "3 cloves garlic, minced",
        "2 cups diced tomatoes (canned or fresh)",
        "1/4 cup tomato paste",
        "1/4 cup olive oil",
        "1 teaspoon dried oregano",
        "1 teaspoon dried thyme",
        "Salt and black pepper to taste",
        "Fresh basil leaves, for garnish"
      ],
      "prepare": [
        "1. Preheat the oven to 375°F (190°C).",
        "2. In a large baking dish, arrange the sliced eggplant, zucchinis, yellow and red bell peppers, and onions in an alternating pattern.",
        "3. In a bowl, mix the minced garlic, diced tomatoes, tomato paste, olive oil, dried oregano, dried thyme, salt, and black pepper to make the sauce.",
        "4. Pour the sauce over the arranged vegetables in the baking dish, making sure they are well coated.",
        "5. Cover the baking dish with aluminum foil and bake in the preheated oven for 30 minutes.",
        "6. Remove the foil and continue baking for an additional 15-20 minutes or until the vegetables are tender and slightly caramelized.",
        "7. Garnish the Baked Ratatouille with fresh basil leaves before serving.",
        "8. Enjoy this delightful and colorful ratatouille as a side dish or as a main course!"
      ],
      "img": "https://i.pinimg.com/564x/92/ef/0d/92ef0d0858388253b631a51caa4ad1a1.jpg"
    },
    {
      "id": 134,
      "title": "Beef and vegetable casserole",
      "ingredients": [
        "1 lb (450g) beef stew meat, cubed",
        "2 tablespoons all-purpose flour",
        "2 tablespoons vegetable oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "2 carrots, peeled and diced",
        "2 potatoes, peeled and diced",
        "1 cup frozen peas",
        "1 cup diced tomatoes (canned or fresh)",
        "2 cups beef broth",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon dried thyme",
        "1 teaspoon dried rosemary",
        "Salt and black pepper to taste",
        "1 sheet puff pastry (store-bought)",
        "1 egg, beaten (for egg wash)"
      ],
      "prepare": [
        "1. Preheat the oven to 375°F (190°C).",
        "2. In a bowl, coat the beef stew meat with the all-purpose flour, salt, and black pepper.",
        "3. In a large oven-safe skillet or casserole dish, heat the vegetable oil over medium-high heat. Add the coated beef cubes and cook until they are browned on all sides.",
        "4. Stir in the chopped onion and minced garlic, and sauté until they become soft and translucent.",
        "5. Add the diced carrots, potatoes, frozen peas, and diced tomatoes to the skillet, stirring to combine with the beef.",
        "6. Pour in the beef broth and Worcestershire sauce, and add the dried thyme and dried rosemary. Mix everything well.",
        "7. Cover the skillet or casserole dish with a lid or aluminum foil and transfer it to the preheated oven.",
        "8. Bake the casserole for 1.5 to 2 hours, or until the beef is tender and the vegetables are cooked through.",
        "9. While the casserole is baking, roll out the puff pastry sheet on a floured surface.",
        "10. Once the casserole is done, remove it from the oven and increase the oven temperature to 400°F (200°C).",
        "11. Place the rolled-out puff pastry over the top of the casserole, tucking in the edges.",
        "12. Brush the puff pastry with the beaten egg for a golden finish.",
        "13. Return the casserole to the oven and bake for an additional 15-20 minutes, or until the puff pastry is golden and puffed up.",
        "14. Remove the Beef and Vegetable Casserole from the oven and let it cool slightly before serving.",
        "15. Enjoy this hearty and comforting beef casserole as a satisfying meal!"
      ],
      "img": "https://i.pinimg.com/564x/21/3a/fc/213afc126371e1fcdebe59a5c58e50ad.jpg"
    },
    {
      "id": 135,
      "title": "Tomato and goat cheese tart",
      "ingredients": [
        "1 sheet puff pastry (store-bought)",
        "4-5 ripe tomatoes, sliced",
        "4 oz (113g) goat cheese, crumbled",
        "2 tablespoons olive oil",
        "2 cloves garlic, minced",
        "1 tablespoon fresh thyme leaves",
        "Salt and black pepper to taste",
        "Fresh basil leaves, for garnish"
      ],
      "prepare": [
        "1. Preheat the oven to 375°F (190°C).",
        "2. Roll out the puff pastry sheet on a floured surface to fit your tart or pie pan.",
        "3. Transfer the rolled-out pastry to the pan and press it gently into the bottom and sides.",
        "4. Prick the pastry with a fork in several places to prevent it from puffing up too much during baking.",
        "5. Arrange the sliced tomatoes on top of the pastry, slightly overlapping them.",
        "6. Sprinkle the crumbled goat cheese evenly over the tomatoes.",
        "7. In a small bowl, mix the olive oil, minced garlic, fresh thyme leaves, salt, and black pepper.",
        "8. Drizzle the olive oil mixture over the tomatoes and goat cheese.",
        "9. Bake the tart in the preheated oven for about 25-30 minutes or until the pastry is golden and the tomatoes are slightly roasted.",
        "10. Remove the Tomato and Goat Cheese Tart from the oven and let it cool slightly.",
        "11. Garnish with fresh basil leaves before serving.",
        "12. Enjoy this delightful and savory tart as an appetizer or light meal!"
      ],
      "img": "https://i.pinimg.com/564x/08/8e/64/088e64f5017fbbeceb16947d6b00c7ec.jpg"
    },
    {
      "id": 136,
      "title": "Chicken and vegetable pot pie",
      "ingredients": [
        "1 lb (450g) boneless, skinless chicken breasts, cooked and cubed",
        "1 cup frozen mixed vegetables (peas, carrots, corn, green beans)",
        "1/3 cup butter",
        "1/3 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/4 teaspoon dried thyme",
        "1/4 teaspoon dried rosemary",
        "1 3/4 cups chicken broth",
        "2/3 cup milk",
        "1 package (14 oz) refrigerated pie crusts",
        "1 egg, beaten (for egg wash)"
      ],
      "prepare": [
        "1. Preheat the oven to 425°F (220°C).",
        "2. In a large saucepan, melt the butter over medium heat.",
        "3. Stir in the all-purpose flour, salt, black pepper, dried thyme, and dried rosemary until well combined.",
        "4. Gradually add the chicken broth and milk to the saucepan, stirring constantly until the mixture thickens and becomes smooth.",
        "5. Add the cooked and cubed chicken and frozen mixed vegetables to the sauce, mixing well.",
        "6. Remove the saucepan from heat.",
        "7. Roll out one pie crust and place it in the bottom of a greased 9-inch pie dish.",
        "8. Pour the chicken and vegetable filling into the pie dish over the bottom crust.",
        "9. Roll out the second pie crust and place it on top of the filling. Seal the edges of the crusts together and crimp with a fork.",
        "10. Cut a few slits in the top crust to allow steam to escape during baking.",
        "11. Brush the top crust with the beaten egg to give it a golden color while baking.",
        "12. Place the pot pie on a baking sheet to catch any drips, and bake in the preheated oven for about 30-35 minutes, or until the crust is golden and the filling is bubbling.",
        "13. Remove the Chicken and Vegetable Pot Pie from the oven and let it cool for a few minutes before serving.",
        "14. Enjoy this comforting and delicious pot pie with your favorite sides!"
      ],
      "img": "https://i.pinimg.com/564x/98/f9/eb/98f9ebb07fc984785dab81502ddfb634.jpg"
    },
    {
      "id": 137,
      "title": "Spinach and feta stuffed chicken breast",
      "ingredients": [
        "4 boneless, skinless chicken breasts",
        "2 cups fresh spinach leaves",
        "1/2 cup crumbled feta cheese",
        "2 tablespoons olive oil",
        "2 cloves garlic, minced",
        "1 teaspoon dried oregano",
        "1 teaspoon dried thyme",
        "Salt and black pepper to taste",
        "Toothpicks or kitchen twine"
      ],
      "prepare": [
        "1. Preheat the oven to 375°F (190°C).",
        "2. Butterfly the chicken breasts by cutting a slit horizontally along the side, being careful not to cut all the way through. Open the chicken breasts like a book.",
        "3. In a skillet, heat the olive oil over medium heat. Add the minced garlic, dried oregano, and dried thyme, and sauté for a minute or two until fragrant.",
        "4. Add the fresh spinach leaves to the skillet and cook until wilted. Season with salt and black pepper to taste.",
        "5. Remove the skillet from heat and let the spinach mixture cool slightly.",
        "6. Stuff each chicken breast with the sautéed spinach and sprinkle crumbled feta cheese on top of the spinach.",
        "7. Close the chicken breasts and secure with toothpicks or tie with kitchen twine to hold the stuffing in place.",
        "8. Season the stuffed chicken breasts with salt and black pepper.",
        "9. In a separate oven-safe skillet or baking dish, heat a little olive oil over medium-high heat. Sear the stuffed chicken breasts for 2-3 minutes on each side until they develop a golden crust.",
        "10. Transfer the skillet or baking dish to the preheated oven and bake the stuffed chicken breasts for 15-20 minutes or until the chicken is cooked through and reaches an internal temperature of 165°F (74°C).",
        "11. Remove the Spinach and Feta Stuffed Chicken Breasts from the oven and let them rest for a few minutes before serving.",
        "12. Serve the stuffed chicken breasts with your favorite side dishes.",
        "13. Enjoy this flavorful and wholesome chicken dish!"
      ],
      "img": "https://i.pinimg.com/564x/1b/e9/aa/1be9aa35fe34f3d69f60cd0dcf2fd226.jpg"
    },
    {
      "id": 138,
      "title": "Chicken and vegetable pasta bake",
      "ingredients": [
        "8 oz (225g) penne pasta or any pasta of your choice",
        "1 lb (450g) boneless, skinless chicken breasts, cooked and diced",
        "1 cup broccoli florets",
        "1 cup sliced bell peppers (any color)",
        "1 cup sliced zucchini",
        "1 cup sliced mushrooms",
        "1/2 cup chopped onion",
        "2 cups marinara sauce",
        "1 cup shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese",
        "2 tablespoons olive oil",
        "2 cloves garlic, minced",
        "1 teaspoon dried basil",
        "1 teaspoon dried oregano",
        "Salt and black pepper to taste",
        "Fresh basil leaves, for garnish"
      ],
      "prepare": [
        "1. Preheat the oven to 375°F (190°C).",
        "2. Cook the pasta according to the package instructions until al dente. Drain and set aside.",
        "3. In a large skillet, heat the olive oil over medium heat. Add the chopped onion and minced garlic, and sauté until they become soft and translucent.",
        "4. Add the sliced bell peppers, zucchini, and mushrooms to the skillet. Cook until the vegetables are tender-crisp.",
        "5. Stir in the cooked and diced chicken, dried basil, dried oregano, salt, and black pepper. Mix well to combine all the flavors.",
        "6. Add the marinara sauce to the skillet, mixing it with the chicken and vegetables. Let the sauce simmer for a few minutes to heat through.",
        "7. In a large baking dish, combine the cooked pasta and the chicken and vegetable mixture. Toss everything together to distribute the sauce evenly.",
        "8. Sprinkle the shredded mozzarella cheese and grated Parmesan cheese over the top of the pasta mixture.",
        "9. Cover the baking dish with aluminum foil and bake in the preheated oven for 20-25 minutes.",
        "10. Remove the foil and bake for an additional 10 minutes or until the cheese is melted and bubbly.",
        "11. Remove the Chicken and Vegetable Pasta Bake from the oven and let it cool slightly before serving.",
        "12. Garnish with fresh basil leaves before serving.",
        "13. Enjoy this hearty and cheesy pasta bake as a comforting meal!"
      ],
      "img": "https://i.pinimg.com/564x/b0/b7/81/b0b7813011aabd6719729f326fabcb82.jpg"
    },
    {
      "id": 139,
      "title": "Beef and vegetable lasagna",
      "ingredients": [
        "12 lasagna noodles",
        "1 lb (450g) ground beef",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1 red bell pepper, chopped",
        "1 zucchini, diced",
        "1 cup sliced mushrooms",
        "1 can (14 oz) diced tomatoes",
        "2 cups tomato sauce",
        "1 teaspoon dried basil",
        "1 teaspoon dried oregano",
        "1/2 teaspoon dried thyme",
        "Salt and black pepper to taste",
        "2 cups ricotta cheese",
        "1 large egg",
        "2 cups shredded mozzarella cheese",
        "1 cup grated Parmesan cheese",
        "Fresh parsley, chopped, for garnish"
      ],
      "prepare": [
        "1. Preheat the oven to 375°F (190°C).",
        "2. Cook the lasagna noodles according to the package instructions until al dente. Drain and set aside.",
        "3. In a large skillet, cook the ground beef over medium heat until it's browned and cooked through. Drain any excess fat.",
        "4. Add the chopped onion, minced garlic, red bell pepper, diced zucchini, and sliced mushrooms to the skillet with the ground beef. Cook until the vegetables are tender.",
        "5. Stir in the diced tomatoes, tomato sauce, dried basil, dried oregano, dried thyme, salt, and black pepper. Let the sauce simmer for a few minutes to blend the flavors.",
        "6. In a separate bowl, mix the ricotta cheese and the large egg until well combined.",
        "7. In a greased 9x13-inch baking dish, layer the ingredients as follows: a thin layer of the meat sauce, a layer of cooked lasagna noodles, a layer of ricotta cheese mixture, and a layer of shredded mozzarella cheese. Repeat the layers, finishing with a layer of meat sauce on top.",
        "8. Sprinkle the grated Parmesan cheese over the top layer of meat sauce.",
        "9. Cover the baking dish with aluminum foil and bake in the preheated oven for 25 minutes.",
        "10. Remove the foil and bake for an additional 20-25 minutes or until the lasagna is hot and bubbly.",
        "11. Let the Beef and Vegetable Lasagna cool for a few minutes before serving.",
        "12. Garnish with chopped fresh parsley before serving.",
        "13. Enjoy this hearty and flavorful lasagna with family and friends!"
      ],
      "img": "https://i.pinimg.com/564x/c8/61/52/c86152cd132a37141f03ef501cbc3686.jpg"
    },
    {
      "id": 140,
      "title": "Slow cooker chicken and vegetable soup",
      "ingredients": [
        "1 lb (450g) boneless, skinless chicken breasts",
        "4 cups chicken broth",
        "1 cup sliced carrots",
        "1 cup chopped celery",
        "1 cup chopped onion",
        "2 cloves garlic, minced",
        "1 cup chopped potatoes",
        "1 can (14 oz) diced tomatoes",
        "1/2 cup frozen corn kernels",
        "1/2 cup frozen peas",
        "1 teaspoon dried thyme",
        "1 teaspoon dried rosemary",
        "1 bay leaf",
        "Salt and black pepper to taste",
        "Fresh parsley, chopped, for garnish"
      ],
      "prepare": [
        "1. Place the boneless, skinless chicken breasts in the slow cooker.",
        "2. Add the sliced carrots, chopped celery, chopped onion, minced garlic, chopped potatoes, and diced tomatoes to the slow cooker.",
        "3. Pour in the chicken broth and add the dried thyme, dried rosemary, bay leaf, salt, and black pepper.",
        "4. Cover the slow cooker and cook on low for 6-8 hours or on high for 3-4 hours, or until the chicken is fully cooked and tender.",
        "5. About 30 minutes before serving, remove the chicken breasts from the slow cooker and shred them using two forks.",
        "6. Return the shredded chicken to the slow cooker.",
        "7. Add the frozen corn kernels and frozen peas to the soup, stirring to combine.",
        "8. Cover the slow cooker and continue cooking for an additional 30 minutes.",
        "9. Taste the soup and adjust the seasoning with salt and black pepper if needed.",
        "10. Remove the bay leaf before serving the Slow Cooker Chicken and Vegetable Soup.",
        "11. Garnish with chopped fresh parsley before serving.",
        "12. Enjoy this comforting and nourishing soup, perfect for cold days!"
      ],
      "img": "https://i.pinimg.com/564x/fd/dd/c8/fdddc817f352ea1fbf85b3896b261701.jpg"
    },
    {
      "id": 141,
      "title": "Grilled shrimp skewers",
      "ingredients": [
        "1 lb (450g) large shrimp, peeled and deveined",
        "2 tablespoons olive oil",
        "2 cloves garlic, minced",
        "1 teaspoon paprika",
        "1/2 teaspoon cayenne pepper (adjust to your spice preference)",
        "1 tablespoon lemon juice",
        "Zest of 1 lemon",
        "Salt and black pepper to taste",
        "Wooden or metal skewers"
      ],
      "prepare": [
        "1. If using wooden skewers, soak them in water for about 30 minutes to prevent them from burning on the grill.",
        "2. In a bowl, combine the olive oil, minced garlic, paprika, cayenne pepper, lemon juice, lemon zest, salt, and black pepper to make the marinade.",
        "3. Add the peeled and deveined shrimp to the bowl and toss them in the marinade until well coated. Let the shrimp marinate for about 15-20 minutes.",
        "4. Preheat your grill to medium-high heat.",
        "5. Thread the marinated shrimp onto the skewers, making sure not to overcrowd them.",
        "6. Grill the shrimp skewers for 2-3 minutes per side, or until they turn pink and opaque.",
        "7. Remove the Grilled Shrimp Skewers from the grill and transfer them to a serving platter.",
        "8. Serve the shrimp skewers with your favorite dipping sauce or as a delicious addition to salads or pasta dishes.",
        "9. Enjoy these succulent and flavorful Grilled Shrimp Skewers for a delightful meal!"
      ],
      "img": "https://i.pinimg.com/564x/67/e1/dd/67e1dd76fa04e3d7599e0e200e225d5e.jpg"
    },
    {
      "id": 142,
      "title": "Vegetable and bean chili",
      "ingredients": [
        "1 tablespoon olive oil",
        "1 large onion, chopped",
        "3 cloves garlic, minced",
        "1 red bell pepper, chopped",
        "1 green bell pepper, chopped",
        "2 zucchinis, diced",
        "1 can (14 oz) diced tomatoes",
        "1 can (14 oz) black beans, drained and rinsed",
        "1 can (14 oz) kidney beans, drained and rinsed",
        "1 can (14 oz) pinto beans, drained and rinsed",
        "2 cups vegetable broth",
        "1 tablespoon chili powder",
        "1 teaspoon ground cumin",
        "1/2 teaspoon paprika",
        "1/4 teaspoon cayenne pepper (adjust to your spice preference)",
        "Salt and black pepper to taste",
        "Fresh cilantro, chopped, for garnish"
      ],
      "prepare": [
        "1. In a large pot, heat the olive oil over medium heat.",
        "2. Add the chopped onion and minced garlic to the pot. Sauté until the onions become soft and translucent.",
        "3. Stir in the chopped red and green bell peppers and diced zucchinis. Cook the vegetables for a few minutes until they start to soften.",
        "4. Add the diced tomatoes, black beans, kidney beans, and pinto beans to the pot, mixing everything together.",
        "5. Pour in the vegetable broth, and add the chili powder, ground cumin, paprika, cayenne pepper, salt, and black pepper.",
        "6. Bring the chili to a simmer, then reduce the heat to low, cover the pot, and let it cook for about 20-25 minutes to allow the flavors to meld together.",
        "7. Taste the chili and adjust the seasoning if needed.",
        "8. Serve the Vegetable and Bean Chili in bowls, garnished with chopped fresh cilantro.",
        "9. Enjoy this hearty and nutritious chili on its own or with your favorite toppings, such as shredded cheese or sour cream!"
      ],
      "img": "https://i.pinimg.com/564x/94/01/bc/9401bc355420b423c840032b25e5e313.jpg"
    },
    {
      "id": 143,
      "title": "Baked eggplant Parmesan",
      "ingredients": [
        "2 large eggplants, sliced into rounds",
        "2 cups breadcrumbs (preferably Italian seasoned)",
        "1 cup grated Parmesan cheese",
        "2 cups marinara sauce",
        "1 cup shredded mozzarella cheese",
        "1/4 cup fresh basil leaves, torn",
        "2 large eggs, beaten",
        "Salt and black pepper to taste",
        "Olive oil, for drizzling"
      ],
      "prepare": [
        "1. Preheat the oven to 375°F (190°C).",
        "2. Sprinkle salt over the eggplant slices and let them sit for about 15-20 minutes. This helps to draw out excess moisture.",
        "3. Rinse the eggplant slices and pat them dry with paper towels.",
        "4. In a shallow dish, combine the breadcrumbs and grated Parmesan cheese.",
        "5. Dip each eggplant slice into the beaten eggs, then coat it with the breadcrumb mixture, pressing the breadcrumbs gently onto the slices.",
        "6. Place the coated eggplant slices on a baking sheet lined with parchment paper.",
        "7. Drizzle olive oil over the top of the eggplant slices.",
        "8. Bake the eggplant in the preheated oven for about 20 minutes or until the slices are golden and crispy.",
        "9. In a separate baking dish, spread a thin layer of marinara sauce on the bottom.",
        "10. Arrange half of the baked eggplant slices over the sauce in the dish.",
        "11. Cover the eggplant slices with more marinara sauce and half of the shredded mozzarella cheese.",
        "12. Add the remaining eggplant slices on top, followed by another layer of marinara sauce and the remaining shredded mozzarella cheese.",
        "13. Bake the Eggplant Parmesan for an additional 15-20 minutes or until the cheese is melted and bubbly.",
        "14. Remove the dish from the oven and let it cool slightly before serving.",
        "15. Garnish with torn fresh basil leaves before serving.",
        "16. Enjoy this delightful and cheesy eggplant Parmesan as a comforting Italian meal!"
      ],
      "img": "https://i.pinimg.com/564x/5c/59/71/5c5971d50fca25db0a07b4bdb1d4f648.jpg"
    },
    {
      "id": 144,
      "title": "Baked turkey meatballs",
      "ingredients": [
        "1 lb (450g) ground turkey",
        "1/2 cup breadcrumbs",
        "1/4 cup grated Parmesan cheese",
        "1/4 cup chopped parsley",
        "1/4 cup chopped onion",
        "2 cloves garlic, minced",
        "1 large egg, beaten",
        "1/4 cup milk",
        "1 teaspoon dried oregano",
        "1 teaspoon dried basil",
        "1/2 teaspoon dried thyme",
        "1/2 teaspoon paprika",
        "Salt and black pepper to taste",
        "Olive oil, for brushing"
      ],
      "prepare": [
        "1. Preheat the oven to 375°F (190°C).",
        "2. In a large bowl, combine the ground turkey, breadcrumbs, grated Parmesan cheese, chopped parsley, chopped onion, minced garlic, beaten egg, milk, dried oregano, dried basil, dried thyme, paprika, salt, and black pepper.",
        "3. Mix all the ingredients until well combined.",
        "4. Shape the turkey mixture into meatballs of your desired size and place them on a baking sheet lined with parchment paper.",
        "5. Brush the tops of the meatballs with olive oil.",
        "6. Bake the turkey meatballs in the preheated oven for 20-25 minutes or until they are cooked through and slightly browned on the outside.",
        "7. Remove the Baked Turkey Meatballs from the oven and let them cool slightly before serving.",
        "8. Serve the meatballs with your favorite dipping sauce or as a delicious addition to pasta dishes or sandwiches.",
        "9. Enjoy these flavorful and healthier baked turkey meatballs as a tasty meal or snack!"
      ],
      "img": "https://i.pinimg.com/564x/79/f0/fe/79f0fe36debb9d4d44ce6d26238a212e.jpg"
    },
    {
      "id": 145,
      "title": "Grilled steak with chimichurri sauce",
      "ingredients": [
        "2 lbs (900g) steak of your choice (e.g., ribeye, sirloin, flank)",
        "1/4 cup fresh parsley, chopped",
        "1/4 cup fresh cilantro, chopped",
        "3 cloves garlic, minced",
        "1/2 cup olive oil",
        "1/4 cup red wine vinegar",
        "1 tablespoon lemon juice",
        "1 teaspoon dried oregano",
        "1/2 teaspoon red pepper flakes (optional, adjust to your spice preference)",
        "Salt and black pepper to taste"
      ],
      "prepare": [
        "1. Preheat your grill to high heat.",
        "2. In a bowl, mix together the chopped parsley, chopped cilantro, minced garlic, olive oil, red wine vinegar, lemon juice, dried oregano, red pepper flakes (if using), salt, and black pepper to make the chimichurri sauce.",
        "3. Set aside a portion of the chimichurri sauce for serving.",
        "4. Season the steak with salt and black pepper on both sides.",
        "5. Place the seasoned steak on the hot grill and cook it to your preferred level of doneness (e.g., medium-rare, medium, well-done). Cooking times may vary depending on the thickness and cut of the steak.",
        "6. Once the steak is cooked to your liking, remove it from the grill and let it rest for a few minutes before slicing.",
        "7. Slice the Grilled Steak against the grain into thin strips or thick slices.",
        "8. Drizzle the reserved chimichurri sauce over the sliced steak before serving.",
        "9. Serve the Grilled Steak with Chimichurri Sauce with your favorite side dishes and enjoy a delicious and flavorful meal!"
      ],
      "img": "https://i.pinimg.com/564x/70/f0/0e/70f00e3241deebe8c18549c2d561b7f5.jpg"
    },
    {
      "id": 146,
      "title": "Creamy tomato and spinach pasta",
      "ingredients": [
        "8 oz (225g) pasta of your choice",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1 can (14 oz) diced tomatoes",
        "1 cup tomato sauce",
        "1 cup heavy cream",
        "1 cup fresh spinach leaves",
        "1/4 cup grated Parmesan cheese",
        "1 teaspoon dried basil",
        "1 teaspoon dried oregano",
        "Salt and black pepper to taste",
        "Fresh basil leaves, for garnish"
      ],
      "prepare": [
        "1. Cook the pasta according to the package instructions until al dente. Drain and set aside.",
        "2. In a large skillet, heat the olive oil over medium heat.",
        "3. Add the chopped onion and minced garlic to the skillet. Sauté until the onions become soft and translucent.",
        "4. Stir in the diced tomatoes and tomato sauce, and let the sauce simmer for a few minutes.",
        "5. Lower the heat and add the heavy cream, stirring to combine.",
        "6. Mix in the fresh spinach leaves and cook until they wilt into the sauce.",
        "7. Stir in the grated Parmesan cheese, dried basil, dried oregano, salt, and black pepper.",
        "8. Add the cooked pasta to the skillet, tossing it in the creamy tomato sauce until well coated.",
        "9. Cook the pasta in the sauce for an additional 1-2 minutes to allow the flavors to meld together.",
        "10. Remove the Creamy Tomato and Spinach Pasta from heat.",
        "11. Garnish with fresh basil leaves before serving.",
        "12. Enjoy this creamy and flavorful pasta as a comforting and satisfying meal!"
      ],
      "img": "https://i.pinimg.com/564x/4d/07/00/4d07004e67e875e52d904d7df4c3e964.jpg"
    },
    {
      "id": 147,
      "title": "Vegetable and tofu curry",
      "ingredients": [
        "1 block (14 oz) firm tofu, drained and cubed",
        "2 cups mixed vegetables (e.g., bell peppers, broccoli, carrots, snow peas)",
        "1 can (14 oz) coconut milk",
        "1 tablespoon red curry paste",
        "1 tablespoon soy sauce",
        "1 tablespoon vegetable oil",
        "1 tablespoon ginger, grated",
        "2 cloves garlic, minced",
        "1 tablespoon curry powder",
        "1 teaspoon ground turmeric",
        "1 teaspoon ground cumin",
        "Salt and black pepper to taste",
        "Fresh cilantro, chopped, for garnish",
        "Cooked rice, for serving"
      ],
      "prepare": [
        "1. In a large skillet or wok, heat the vegetable oil over medium heat.",
        "2. Add the grated ginger and minced garlic to the skillet. Sauté for a minute or until fragrant.",
        "3. Stir in the red curry paste, curry powder, ground turmeric, and ground cumin. Cook the spices for another minute to release their flavors.",
        "4. Add the cubed tofu and mixed vegetables to the skillet, stirring to coat them with the curry mixture.",
        "5. Pour in the coconut milk and soy sauce, mixing everything together.",
        "6. Season with salt and black pepper to taste.",
        "7. Simmer the curry on low heat for about 10-15 minutes, allowing the flavors to meld together and the vegetables to become tender.",
        "8. Remove the Vegetable and Tofu Curry from heat.",
        "9. Serve the curry over cooked rice and garnish with chopped fresh cilantro.",
        "10. Enjoy this delicious and aromatic vegetable and tofu curry as a wholesome and flavorful meal!"
      ],
      "img": "https://i.pinimg.com/564x/16/6c/28/166c287e238668237cce8fda0ee9cd42.jpg"
    },
    {
      "id": 148,
      "title": " Chicken and vegetable quesadillas",
      "ingredients": [
        "2 cups cooked and shredded chicken",
        "1 cup shredded cheddar cheese",
        "1 cup mixed bell peppers, sliced",
        "1/2 cup sliced red onion",
        "1/4 cup chopped fresh cilantro",
        "4 large flour tortillas",
        "2 tablespoons vegetable oil",
        "1 teaspoon chili powder",
        "1/2 teaspoon ground cumin",
        "Salt and black pepper to taste",
        "Sour cream, for serving",
        "Salsa, for serving"
      ],
      "prepare": [
        "1. In a large bowl, mix the shredded chicken with the chili powder, ground cumin, salt, and black pepper.",
        "2. In a separate bowl, combine the shredded cheddar cheese, mixed bell peppers, sliced red onion, and chopped fresh cilantro.",
        "3. Lay one flour tortilla flat on a clean surface.",
        "4. Spread a portion of the chicken mixture evenly on half of the tortilla.",
        "5. Top the chicken with a generous amount of the vegetable and cheese mixture.",
        "6. Fold the other half of the tortilla over the filling to form a half-moon shape.",
        "7. Press the quesadilla lightly to seal the edges.",
        "8. Repeat the process with the remaining tortillas and fillings.",
        "9. In a large skillet, heat the vegetable oil over medium heat.",
        "10. Add the quesadilla to the skillet and cook for 2-3 minutes on each side until the tortilla turns golden and crispy, and the cheese melts.",
        "11. Remove the Chicken and Vegetable Quesadilla from the skillet and let it cool slightly before cutting into wedges.",
        "12. Serve the quesadillas with sour cream and salsa for dipping.",
        "13. Enjoy these tasty and satisfying chicken and vegetable quesadillas as a delightful meal or snack!"
      ],
      "img": "https://i.pinimg.com/564x/75/de/7b/75de7b621f3031b5fa508b1a0de81a07.jpg"
    },
    {
      "id": 149,
      "title": "Beef and vegetable kebabs",
      "ingredients": [
        "500g beef sirloin, cut into chunks",
        "1 red bell pepper, cut into chunks",
        "1 green bell pepper, cut into chunks",
        "1 red onion, cut into chunks",
        "1 zucchini, sliced",
        "1/4 cup olive oil",
        "2 tablespoons soy sauce",
        "2 tablespoons Worcestershire sauce",
        "2 cloves garlic, minced",
        "1 teaspoon dried oregano",
        "1 teaspoon paprika",
        "Salt and pepper to taste",
        "Wooden or metal skewers"
      ],
      "prepare": [
        "In a bowl, combine olive oil, soy sauce, Worcestershire sauce, minced garlic, dried oregano, paprika, salt, and pepper to make the marinade.",
        "Add the beef chunks to the marinade, mix well, cover, and refrigerate for at least 2 hours (overnight for best results).",
        "If using wooden skewers, soak them in water for 30 minutes to prevent burning.",
        "Preheat the grill or barbecue to medium-high heat.",
        "Thread marinated beef, red and green bell peppers, red onion, and zucchini alternately onto the skewers.",
        "Grill the kebabs for about 10-12 minutes, turning occasionally, or until the beef is cooked to your desired level of doneness and the vegetables are tender and slightly charred.",
        "Serve hot and enjoy!"
      ],
      "img": "https://i.pinimg.com/564x/eb/bb/ee/ebbbee4b799d49139ab13a27fcb88ac1.jpg"
    },
    {
      "id": 150,
      "title": " Greek-style chicken and vegetable skewers",
      "ingredients": [
        "500g chicken breast, cut into chunks",
        "1 red bell pepper, cut into chunks",
        "1 yellow bell pepper, cut into chunks",
        "1 red onion, cut into chunks",
        "Cherry tomatoes",
        "1/4 cup olive oil",
        "2 tablespoons lemon juice",
        "2 cloves garlic, minced",
        "1 teaspoon dried oregano",
        "1 teaspoon dried thyme",
        "Salt and pepper to taste",
        "Wooden or metal skewers"
      ],
      "prepare": [
        "In a bowl, whisk together olive oil, lemon juice, minced garlic, dried oregano, dried thyme, salt, and pepper to make the marinade.",
        "Add the chicken chunks to the marinade, mix well, cover, and refrigerate for at least 1-2 hours.",
        "If using wooden skewers, soak them in water for 30 minutes to prevent burning.",
        "Preheat the grill or barbecue to medium-high heat.",
        "Thread marinated chicken, red and yellow bell peppers, red onion, and cherry tomatoes alternately onto the skewers.",
        "Grill the skewers for about 12-15 minutes, turning occasionally, or until the chicken is cooked through and the vegetables are tender and lightly charred.",
        "Serve hot with some tzatziki sauce and enjoy!"
      ],
      "img": "https://i.pinimg.com/564x/90/5f/81/905f811f4811bc8d883c6a772aff4573.jpg"
    },
    {
      "id": 151,
      "title": "Spicy Korean chicken",
      "ingredients": [
        "800g boneless chicken thighs, cut into bite-sized pieces",
        "1/4 cup soy sauce",
        "2 tablespoons gochujang (Korean chili paste)",
        "2 tablespoons honey",
        "2 tablespoons rice vinegar",
        "2 tablespoons sesame oil",
        "4 cloves garlic, minced",
        "1-inch piece ginger, grated",
        "1 tablespoon sesame seeds",
        "2 green onions, sliced",
        "Cooked white rice, for serving"
      ],
      "prepare": [
        "In a bowl, combine soy sauce, gochujang, honey, rice vinegar, sesame oil, minced garlic, and grated ginger to make the marinade.",
        "Add the chicken pieces to the marinade, mix well, cover, and refrigerate for at least 1 hour.",
        "Preheat the grill or barbecue to medium-high heat.",
        "Thread marinated chicken pieces onto the skewers.",
        "Grill the chicken skewers for about 8-10 minutes, turning occasionally, or until the chicken is fully cooked and slightly charred.",
        "Sprinkle sesame seeds and sliced green onions over the skewers.",
        "Serve the spicy Korean chicken skewers over cooked white rice and enjoy!"
      ],
      "img": "https://i.pinimg.com/564x/5a/e0/5b/5ae05b33ef29e835eeab3a53948e9d1a.jpg"
    },
    {
      "id": 152,
      "title": "Baked salmon with lemon and herbs",
      "ingredients": [
        "800g boneless chicken thighs, cut into bite-sized pieces",
        "1/4 cup soy sauce",
        "2 tablespoons gochujang (Korean chili paste)",
        "2 tablespoons honey",
        "2 tablespoons rice vinegar",
        "2 tablespoons sesame oil",
        "4 cloves garlic, minced",
        "1-inch piece ginger, grated",
        "1 tablespoon sesame seeds",
        "2 green onions, sliced",
        "Cooked white rice, for serving"
      ],
      "prepare": [
        "In a bowl, combine soy sauce, gochujang, honey, rice vinegar, sesame oil, minced garlic, and grated ginger to make the marinade.",
        "Add the chicken pieces to the marinade, mix well, cover, and refrigerate for at least 1 hour.",
        "Preheat the grill or barbecue to medium-high heat.",
        "Thread marinated chicken pieces onto the skewers.",
        "Grill the chicken skewers for about 8-10 minutes, turning occasionally, or until the chicken is fully cooked and slightly charred.",
        "Sprinkle sesame seeds and sliced green onions over the skewers.",
        "Serve the spicy Korean chicken skewers over cooked white rice and enjoy!"
      ],
      "img": "https://i.pinimg.com/564x/2e/ad/25/2ead25475029b0583287b5653c90156d.jpg"
    },
    {
      "id": 153,
      "title": "Vegetable and chickpea tagine",
      "ingredients": [
        "2 tablespoons olive oil",
        "1 large onion, chopped",
        "3 cloves garlic, minced",
        "2 teaspoons ground cumin",
        "2 teaspoons ground coriander",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon paprika",
        "1/4 teaspoon cayenne pepper (optional, for extra heat)",
        "2 carrots, peeled and sliced",
        "1 red bell pepper, chopped",
        "1 yellow bell pepper, chopped",
        "1 zucchini, sliced",
        "1 can (400g) chickpeas, drained and rinsed",
        "1 can (400g) diced tomatoes",
        "1 cup vegetable broth",
        "Salt and pepper to taste",
        "Fresh cilantro leaves, for garnish",
        "Cooked couscous or rice, for serving"
      ],
      "prepare": [
        "In a large pot or tagine, heat the olive oil over medium heat.",
        "Add the chopped onion and sauté until softened, about 3-4 minutes.",
        "Stir in minced garlic, ground cumin, ground coriander, ground cinnamon, ground ginger, paprika, and cayenne pepper (if using). Cook for another 1-2 minutes until fragrant.",
        "Add sliced carrots, chopped red and yellow bell peppers, and sliced zucchini to the pot. Stir well to coat the vegetables with the spices.",
        "Pour in the drained and rinsed chickpeas, diced tomatoes, and vegetable broth.",
        "Bring the mixture to a simmer, then reduce the heat to low, cover, and let it cook for 20-25 minutes, or until the vegetables are tender.",
        "Season the tagine with salt and pepper according to your taste.",
        "Serve the vegetable and chickpea tagine over cooked couscous or rice.",
        "Garnish with fresh cilantro leaves and enjoy this flavorful and hearty Moroccan-inspired dish!"
      ],
      "img": "https://i.pinimg.com/564x/98/b7/8e/98b78efda893b49045e10acf74f8fd73.jpg"
    },
    {
      "id": 154,
      "title": " Beef and vegetable stir-fry with noodles",
      "ingredients": [
        "200g beef sirloin, thinly sliced",
        "200g dried egg noodles",
        "2 tablespoons soy sauce",
        "1 tablespoon oyster sauce",
        "1 tablespoon hoisin sauce",
        "1 tablespoon cornstarch",
        "1/2 cup beef broth",
        "2 tablespoons vegetable oil",
        "1 red bell pepper, sliced",
        "1 yellow bell pepper, sliced",
        "1 carrot, julienned",
        "1 cup broccoli florets",
        "3 cloves garlic, minced",
        "1-inch piece ginger, grated",
        "2 green onions, sliced",
        "Sesame seeds and sliced red chili, for garnish"
      ],
      "prepare": [
        "Cook the dried egg noodles according to the package instructions, then drain and set aside.",
        "In a bowl, mix together soy sauce, oyster sauce, hoisin sauce, cornstarch, and beef broth to make the stir-fry sauce.",
        "Heat vegetable oil in a large pan or wok over high heat.",
        "Add thinly sliced beef to the hot pan and stir-fry for about 2-3 minutes until it's browned and cooked to your liking. Remove the beef from the pan and set it aside.",
        "In the same pan, add sliced red and yellow bell peppers, julienned carrots, and broccoli florets. Stir-fry for 2-3 minutes until the vegetables are tender-crisp.",
        "Add minced garlic and grated ginger to the vegetables. Cook for another 1 minute until fragrant.",
        "Return the cooked beef to the pan with the vegetables.",
        "Pour the stir-fry sauce over the beef and vegetables. Stir everything together until the sauce thickens and coats the beef and vegetables.",
        "Add the cooked egg noodles to the pan and toss them with the beef and vegetable mixture until everything is well combined.",
        "Garnish the beef and vegetable stir-fry with sliced green onions, sesame seeds, and sliced red chili for some extra heat if desired.",
        "Serve hot and enjoy this delicious and satisfying stir-fry!"
      ],
      "img": "https://i.pinimg.com/564x/e8/84/e4/e884e4fc29bc480d0451ebdac2dd7e33.jpg"
    },
    {
      "id": 155,
      "title": "Greek-style baked pork chops",
      "ingredients": [
        "4 pork chops",
        "1 lemon, juiced",
        "3 tablespoons olive oil",
        "4 cloves garlic, minced",
        "1 teaspoon dried oregano",
        "1 teaspoon dried thyme",
        "1 teaspoon dried rosemary",
        "Salt and pepper to taste",
        "1/4 cup crumbled feta cheese",
        "Cherry tomatoes and fresh parsley, for garnish"
      ],
      "prepare": [
        "Preheat the oven to 200°C (400°F).",
        "In a bowl, whisk together lemon juice, olive oil, minced garlic, dried oregano, dried thyme, dried rosemary, salt, and pepper to make the marinade.",
        "Place the pork chops in a baking dish and pour the marinade over them, making sure to coat each chop.",
        "Let the pork chops marinate for at least 30 minutes (or up to 2 hours) in the refrigerator.",
        "Remove the pork chops from the marinade and place them on a baking sheet lined with aluminum foil.",
        "Bake the pork chops in the preheated oven for about 20-25 minutes or until they are cooked through and reach an internal temperature of 145°F (63°C).",
        "During the last few minutes of baking, sprinkle crumbled feta cheese over each pork chop and return them to the oven to melt the cheese slightly.",
        "Garnish the Greek-style baked pork chops with cherry tomatoes and fresh parsley before serving.",
        "Pair them with your favorite side dishes like roasted potatoes and a Greek salad for a complete meal!",
        "Enjoy the tender and flavorful Greek-inspired pork chops."
      ],
      "img": "https://i.pinimg.com/564x/d3/5e/17/d35e17dcff58602586f6efa6f858881d.jpg"
    },
    {
      "id": 156,
      "title": "Chicken and vegetable stir-fry with noodles",
      "ingredients": [
        "200g boneless, skinless chicken breast, thinly sliced",
        "200g dried rice noodles",
        "3 tablespoons soy sauce",
        "2 tablespoons oyster sauce",
        "1 tablespoon hoisin sauce",
        "1 tablespoon cornstarch",
        "1/2 cup chicken broth",
        "2 tablespoons vegetable oil",
        "1 red bell pepper, sliced",
        "1 yellow bell pepper, sliced",
        "1 carrot, julienned",
        "1 cup broccoli florets",
        "3 cloves garlic, minced",
        "1-inch piece ginger, grated",
        "2 green onions, sliced",
        "Sesame seeds and sliced red chili, for garnish"
      ],
      "prepare": [
        "Cook the dried rice noodles according to the package instructions, then drain and set aside.",
        "In a bowl, mix together soy sauce, oyster sauce, hoisin sauce, cornstarch, and chicken broth to make the stir-fry sauce.",
        "Heat vegetable oil in a large pan or wok over high heat.",
        "Add thinly sliced chicken breast to the hot pan and stir-fry for about 3-4 minutes until the chicken is cooked through and no longer pink. Remove the chicken from the pan and set it aside.",
        "In the same pan, add sliced red and yellow bell peppers, julienned carrot, and broccoli florets. Stir-fry for 2-3 minutes until the vegetables are tender-crisp.",
        "Add minced garlic and grated ginger to the vegetables. Cook for another 1 minute until fragrant.",
        "Return the cooked chicken to the pan with the vegetables.",
        "Pour the stir-fry sauce over the chicken and vegetables. Stir everything together until the sauce thickens and coats the chicken and vegetables.",
        "Add the cooked rice noodles to the pan and toss them with the chicken and vegetable mixture until everything is well combined.",
        "Garnish the chicken and vegetable stir-fry with sliced green onions, sesame seeds, and sliced red chili for some extra heat if desired.",
        "Serve hot and enjoy this delicious and satisfying stir-fry with noodles!"
      ],
      "img": "https://i.pinimg.com/564x/98/0a/c8/980ac8d6d53849049455067af4225322.jpg"
    },
    {
      "id": 157,
      "title": "Vegetable and cheese frittata",
      "ingredients": [
        "6 large eggs",
        "1/4 cup milk",
        "Salt and pepper to taste",
        "1 tablespoon olive oil",
        "1 small onion, chopped",
        "1 red bell pepper, chopped",
        "1 zucchini, sliced",
        "1 cup cherry tomatoes, halved",
        "1 cup baby spinach",
        "1/2 cup shredded cheddar cheese",
        "2 tablespoons chopped fresh parsley"
      ],
      "prepare": [
        "Preheat the oven to 180°C (350°F).",
        "In a bowl, whisk together the eggs, milk, salt, and pepper until well combined.",
        "Heat olive oil in an oven-safe skillet over medium heat.",
        "Add chopped onion and sauté for 2-3 minutes until softened.",
        "Stir in chopped red bell pepper and sliced zucchini. Cook for another 3-4 minutes until the vegetables are tender.",
        "Add halved cherry tomatoes and baby spinach to the skillet. Stir and cook until the spinach wilts.",
        "Pour the whisked egg mixture over the vegetables in the skillet.",
        "Sprinkle shredded cheddar cheese over the top of the frittata.",
        "Transfer the skillet to the preheated oven and bake for about 15-20 minutes or until the frittata is set and slightly golden on top.",
        "Remove the skillet from the oven (be careful, it will be hot). Let the frittata cool for a few minutes.",
        "Sprinkle chopped fresh parsley over the frittata before slicing and serving.",
        "Cut into wedges and enjoy this savory and nutritious vegetable and cheese frittata!"
      ],
      "img": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2Farchive%2Fd4e16b9eed50aacf8c30ed3694d6ae18362fe1d1",
      "isFavorite": false 
    },
    {
      "id": 158,
      "title": "Thai-style chicken and vegetable curry",
      "ingredients": [
        "400g boneless, skinless chicken thighs, cut into chunks",
        "1 can (400ml) coconut milk",
        "2 tablespoons Thai red curry paste",
        "1 tablespoon vegetable oil",
        "1 red bell pepper, sliced",
        "1 zucchini, sliced",
        "1 cup green beans, trimmed",
        "1 cup sliced mushrooms",
        "2 tablespoons fish sauce",
        "1 tablespoon brown sugar",
        "1 lime, juiced",
        "Fresh cilantro leaves and sliced red chili, for garnish",
        "Cooked jasmine rice, for serving"
      ],
      "prepare": [
        "In a large pan or wok, heat vegetable oil over medium heat.",
        "Add the Thai red curry paste to the hot oil and stir-fry for a minute until fragrant.",
        "Add the chicken chunks to the pan and cook until they are browned on all sides.",
        "Pour in the coconut milk, stirring to combine with the curry paste and chicken.",
        "Add sliced red bell pepper, sliced zucchini, green beans, and sliced mushrooms to the pan. Stir well to coat the vegetables and chicken with the coconut milk curry sauce.",
        "Simmer the curry for about 10-15 minutes or until the chicken is fully cooked and the vegetables are tender.",
        "Stir in fish sauce, brown sugar, and lime juice to add depth of flavor to the curry.",
        "Taste and adjust seasoning according to your preference.",
        "Serve the Thai-style chicken and vegetable curry over cooked jasmine rice.",
        "Garnish with fresh cilantro leaves and sliced red chili for some extra spice and color.",
        "Enjoy this aromatic and creamy Thai curry with a perfect balance of flavors!"
      ],
      "img": "https://i.pinimg.com/564x/7d/c4/0b/7dc40b78cd997b1158d47b15f98271a3.jpg"
    },
    {
      "id": 159,
      "title": "Grilled vegetable and halloumi skewers",
      "ingredients": [
        "1 block (250g) halloumi cheese, cut into cubes",
        "1 red bell pepper, cut into chunks",
        "1 yellow bell pepper, cut into chunks",
        "1 zucchini, sliced",
        "1 red onion, cut into chunks",
        "Cherry tomatoes",
        "2 tablespoons olive oil",
        "1 tablespoon balsamic vinegar",
        "1 teaspoon dried oregano",
        "Salt and pepper to taste",
        "Wooden or metal skewers"
      ],
      "prepare": [
        "If using wooden skewers, soak them in water for 30 minutes to prevent burning.",
        "In a bowl, whisk together olive oil, balsamic vinegar, dried oregano, salt, and pepper to make the marinade.",
        "Thread halloumi cubes, red and yellow bell pepper chunks, zucchini slices, red onion chunks, and cherry tomatoes alternately onto the skewers.",
        "Place the assembled skewers in a shallow dish and brush the marinade over the vegetables and halloumi.",
        "Let the skewers marinate for about 15-30 minutes to enhance the flavors.",
        "Preheat the grill or barbecue to medium-high heat.",
        "Grill the skewers for about 2-3 minutes on each side, or until the halloumi is slightly charred and the vegetables are tender-crisp.",
        "Remove the skewers from the grill and serve them hot as a delightful appetizer or side dish.",
        "Enjoy the delicious combination of grilled vegetables and halloumi cheese!"
      ],
      "img": "https://i.pinimg.com/564x/6d/fd/32/6dfd325d4ddf94a06f47c1340b14146a.jpg"
    },
    {
      "id": 160,
      "title": "Baked sweet potato fries",
      "ingredients": [
        "2 large sweet potatoes, peeled and cut into thin strips",
        "2 tablespoons olive oil",
        "1 teaspoon paprika",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon onion powder",
        "1/4 teaspoon cayenne pepper (optional, for a kick of heat)",
        "Salt and pepper to taste",
        "2 tablespoons cornstarch (optional, for added crispiness)"
      ],
      "prepare": [
        "Preheat the oven to 220°C (425°F).",
        "In a large bowl, toss the sweet potato strips with olive oil, paprika, garlic powder, onion powder, cayenne pepper (if using), salt, and pepper.",
        "For added crispiness, you can sprinkle cornstarch over the sweet potatoes and toss them again to coat evenly.",
        "Spread the seasoned sweet potato strips in a single layer on a baking sheet lined with parchment paper or a silicone baking mat.",
        "Make sure they are not overcrowded to promote even baking and crispiness.",
        "Bake the sweet potato fries in the preheated oven for 20-25 minutes, flipping them halfway through the baking time to ensure even cooking.",
        "The fries should be golden and crispy on the outside and tender on the inside.",
        "Remove the baked sweet potato fries from the oven and let them cool slightly before serving.",
        "Serve the fries as a tasty and healthier alternative to regular fries.",
        "Enjoy them on their own or with your favorite dipping sauce!"
      ],
      "img": "https://i.pinimg.com/564x/2e/fd/49/2efd49d9b7ec03327b802fc700c9b2c1.jpg"
    }
  ]
}
