{
  "recipes": [
    {
      "id": 1,
      "title": "Pizza",
      "ingredients": "2 servings, 12-inch round of pizza dough, stretched (see recipe), 3 tablespoons tomato sauce (see note), Extra-virgin olive oil, 2¾ ounces fresh mozzarella, 4 to 5 basil leaves, roughly torn",
      "prepare": "Step 1: Place a pizza stone or tiles on the middle rack of your oven and turn the heat to its highest setting. Let it heat for at least an hour.\nStep 2: Put the sauce in the center of the stretched dough and use the back of a spoon to spread it evenly across the surface, stopping approximately ½ inch from the edges.\nStep 3: Drizzle a little olive oil over the pie. Break the cheese into large pieces and place them gently on the sauce. Scatter basil leaves over the top.\nStep 4: Using a pizza peel, pick up the pie and slide it onto the heated stone or tiles in the oven. Bake until the crust is golden brown and the cheese is bubbling, approximately 4 to 8 minutes.\nTIP: In a food processor, whiz together whole, drained canned tomatoes, a splash of olive oil, and a sprinkle of salt. Keep leftover sauce refrigerated!",
      "img": "https://www.recipetineats.com/wp-content/uploads/2020/05/Pizza-Crust-without-yeast_5-SQ.jpg"
    },
    {
      "id": 2,
      "title": "Homemade Sushi",
      "ingredients": "1⅓ cups water, ⅔ cup uncooked short-grain white rice, 3 tablespoons rice vinegar, 3 tablespoons white sugar, 1½ teaspoons salt, 4 sheets nori seaweed sheets, ½ pound imitation crabmeat, flaked, 1 avocado - peeled, pitted, and sliced, ½ cucumber, peeled, cut into small strips, 2 tablespoons pickled ginger",
      "prepare": "Step 1: Bring water to a boil in a medium pot; stir in rice. Reduce heat to medium-low, cover, and simmer until rice is tender and water has been absorbed, 20 to 25 minutes.\nStep 2: Mix rice vinegar, sugar, and salt in a small bowl. Gently stir into cooked rice in the pot and set aside.\nStep 3: Lay nori sheets on a baking sheet.\nStep 4: Heat nori in the preheated oven until warm, 1 to 2 minutes.\nStep 5: Center 1 nori sheet on a bamboo sushi mat. Use wet hands to spread a thin layer of rice on top. Arrange 1/4 of the crabmeat, avocado, cucumber, and pickled ginger over rice in a line down the center. Lift one end of the mat and roll it tightly over filling to make a complete roll. Repeat with remaining ingredients.\nStep 6: Use a wet, sharp knife to cut each roll into 4 to 6 slices.\nTips: If you do not have a bamboo sushi mat, the easiest way to roll sushi is with a clean dish towel.",
      "img": "https://www.happyfoodstube.com/wp-content/uploads/2016/03/homemade-sushi-image-500x500.jpg"
    },
    {
      "id": 3,
      "title": "Tacos",
      "ingredients": "1 lb. 90% to 93% lean ground beef, 1 Tablespoon chili powder, 1 teaspoon ground cumin, 3/4 teaspoon salt, 1/2 teaspoon dried oregano, 1/2 teaspoon garlic powder, 1/4 teaspoon ground black pepper, 1/2 cup tomato sauce, 1/4 cup water, 12 taco shells - either hard shells or small 6-inch soft flour tortillas will work, Optional Taco Toppings: shredded cheese, shredded lettuce, chopped tomatoes, diced red onion, taco sauce, sour cream, guacamole, etc.",
      "prepare": "Break apart lean ground beef in a skillet over medium-high heat. Add chili powder, cumin, salt, oregano, garlic powder, and pepper. Cook until the beef is browned.\nAdd tomato sauce and water to the meat. Cook until some liquid has evaporated, but the meat is still saucy.\nSpoon 2 tablespoons of the taco meat into hard taco shells or small soft tortillas. Top the tacos with your favorite traditional taco toppings.",
      "img": "https://hips.hearstapps.com/goodhousekeeping-uk/main/embedded/35802/caramelized-pork-tacos-600x900.jpg"
    },
    {
      "id": 4,
      "title": "Paella",
      "ingredients": "2 tablespoons olive oil, 1 onion, chopped, 3 cloves garlic, minced, 1 red bell pepper, sliced, 1 yellow bell pepper, sliced, 2 cups Arborio rice, 1 teaspoon smoked paprika, 1 teaspoon saffron threads, 4 cups chicken or vegetable broth, 1 cup white wine, 1 pound chicken thighs, boneless and skinless, cut into bite-sized pieces, 1 pound shrimp, peeled and deveined, 1 pound mussels, cleaned, 1 cup frozen peas, 1 lemon, cut into wedges, salt and pepper to taste",
      "prepare": "Step 1: Preheat the oven to 375°F (190°C). Heat olive oil in a large paella pan or a wide, shallow skillet. Add the chopped onion and sauté until softened. Add the minced garlic and sliced bell peppers. Cook for another 2 minutes.\nStep 2: Add the Arborio rice, smoked paprika, and saffron threads. Stir to coat the rice with the oil and spices.\nStep 3: Pour in the chicken or vegetable broth and white wine. Bring to a simmer and let cook for 10 minutes, stirring occasionally.\nStep 4: Nestle the chicken pieces into the rice mixture and cook for 10 minutes.\nStep 5: Add the shrimp, mussels, and frozen peas to the pan. Cover and cook for an additional 5 minutes, or until the shrimp is cooked through and the mussels have opened.\nStep 6: Remove from heat and let rest for 5 minutes before serving. Garnish with lemon wedges and season with salt and pepper to taste.",
      "img": "https://hips.hearstapps.com/hmg-prod/images/paella-recipe-2-648b59db017b7.jpg?crop=0.502xw:1.00xh;0.101xw,0&resize=1200:*"
    },
    {
      "id": 5,
      "title": "Chicken Tikka Masala",
      "ingredients": "For the chicken marinade: 1 cup plain yogurt, 2 tablespoons lemon juice, 2 teaspoons ground cumin, 2 teaspoons ground paprika, 2 teaspoons ground coriander, 1 teaspoon ground turmeric, 1 teaspoon ground ginger, 2 teaspoons garam masala, 2 teaspoons garlic paste, 1 teaspoon chili powder, 1 teaspoon salt, 1.5 lbs (700g) boneless skinless chicken thighs, cut into bite-sized pieces. For the sauce: 3 tablespoons butter, 1 large onion, finely chopped, 4 cloves garlic, minced, 1 tablespoon ginger paste, 1 teaspoon ground cumin, 1 teaspoon ground coriander, 1 teaspoon ground paprika, 1 teaspoon garam masala, 1 teaspoon chili powder, 1 teaspoon ground turmeric, 1 cup tomato puree, 1 cup heavy cream, 1 teaspoon sugar, Salt, to taste, Fresh cilantro, chopped, for garnish",
      "prepare": "Step 1: In a bowl, combine all the marinade ingredients. Add the chicken pieces and coat them well. Marinate for at least 1 hour, preferably overnight.\nStep 2: Preheat the grill or broiler to medium-high heat. Cook the chicken pieces for 5-6 minutes on each side until cooked through and slightly charred. Set aside.\nStep 3: In a large skillet, melt the butter over medium heat. Add the chopped onion and sauté until golden brown.\nStep 4: Add the minced garlic and ginger paste. Cook for an additional 1-2 minutes.\nStep 5: Add the ground cumin, ground coriander, ground paprika, garam masala, chili powder, and ground turmeric. Stir well to combine the spices with the onion mixture.\nStep 6: Add the tomato puree and cook for 2-3 minutes.\nStep 7: Reduce the heat to low and stir in the heavy cream. Simmer for 5 minutes.\nStep 8: Add the cooked chicken pieces to the sauce. Stir well and cook for an additional 5 minutes.\nStep 9: Season with salt and sugar to taste.\nStep 10: Garnish with fresh cilantro and serve with steamed rice or naan bread.",
      "img": "https://www.daringgourmet.com/wp-content/uploads/2019/12/Chicken-Tikka-Masala-10-square-500x500.jpg"
    },
    {
      "id": 6,
      "title": "Pad Thai",
      "ingredients": "8 ounces dried rice noodles, 2 tablespoons vegetable oil, 2 cloves garlic, minced, 8 ounces shrimp, peeled and deveined, 2 eggs, lightly beaten, 2 tablespoons fish sauce, 1 tablespoon tamarind paste, 1 tablespoon sugar, 1 cup bean sprouts, 4 green onions, chopped, ¼ cup chopped peanuts, Lime wedges, for serving, Fresh cilantro, for garnish",
      "prepare": "Step 1: Cook rice noodles according to package instructions. Drain and set aside.\nStep 2: Heat vegetable oil in a large skillet or wok over medium-high heat. Add garlic and sauté for 1 minute.\nStep 3: Add shrimp to the skillet and cook until pink and cooked through, about 3-4 minutes. Push the shrimp to one side of the skillet.\nStep 4: Pour the beaten eggs into the other side of the skillet. Scramble the eggs until cooked, then mix them together with the shrimp.\nStep 5: In a small bowl, whisk together fish sauce, tamarind paste, and sugar until well combined. Pour the sauce over the shrimp and eggs in the skillet.\nStep 6: Add the cooked rice noodles to the skillet. Toss everything together until well coated in the sauce.\nStep 7: Add bean sprouts and green onions to the skillet. Cook for an additional 2 minutes, until heated through.\nStep 8: Remove from heat and sprinkle chopped peanuts over the top.\nStep 9: Serve Pad Thai with lime wedges and garnish with fresh cilantro.",
      "img": "https://www.recipetineats.com/wp-content/uploads/2020/01/Chicken-Pad-Thai_9-SQ.jpg"
    },
    {
      "id": 7,
      "title": "Moussaka",
      "ingredients": "2 eggplants, sliced lengthwise, 1 lb ground beef or lamb, 1 onion, chopped, 2 cloves garlic, minced, 1 can crushed tomatoes (14 oz), 2 tablespoons tomato paste, 1 teaspoon dried oregano, 1 teaspoon ground cinnamon, 1/4 teaspoon ground nutmeg, 1/4 cup red wine (optional), 1/4 cup chopped fresh parsley, Salt and pepper, to taste, For the béchamel sauce: 3 tablespoons butter, 3 tablespoons all-purpose flour, 2 cups milk, 1/4 teaspoon ground nutmeg, 1/4 cup grated Parmesan cheese, 2 eggs, beaten",
      "prepare": "Step 1: Preheat the oven to 375°F (190°C). Heat olive oil in a large skillet over medium heat. Add the sliced eggplants and cook until lightly browned. Remove from heat and set aside.\nStep 2: In the same skillet, cook the ground beef or lamb until browned. Add the chopped onion and minced garlic. Cook until the onion is softened.\nStep 3: Stir in the crushed tomatoes, tomato paste, dried oregano, ground cinnamon, ground nutmeg, red wine (if using), chopped fresh parsley, salt, and pepper. Simmer for 10 minutes.\nStep 4: In a separate saucepan, melt the butter over medium heat. Stir in the flour and cook for 1 minute.\nStep 5: Gradually whisk in the milk until smooth. Cook, stirring constantly, until the sauce thickens.\nStep 6: Remove the saucepan from heat and stir in the ground nutmeg, grated Parmesan cheese, and beaten eggs.\nStep 7: Arrange half of the sliced eggplants in a greased baking dish. Pour half of the meat sauce over the eggplants.\nStep 8: Arrange the remaining sliced eggplants over the meat sauce and top with the remaining meat sauce.\nStep 9: Pour the béchamel sauce over the top, spreading it evenly.\nStep 10: Bake in the preheated oven for 45-50 minutes, or until the top is golden brown and bubbling.\nStep 11: Allow the moussaka to cool for a few minutes before serving. Serve warm.",
      "img": "https://www.recipetineats.com/wp-content/uploads/2019/03/Greek-Moussaka_3-re-edited-SQ.jpg"
    },
    {
      "id": 8,
      "title": "Pho",
      "ingredients": "For the broth: 2 lbs beef bones, 1 onion, halved, 2-inch piece fresh ginger, sliced, 5 star anise, 2 cinnamon sticks, 3 cloves, 1 tablespoon coriander seeds, 1 tablespoon fish sauce, 1 tablespoon sugar, Salt, to taste, For the soup: 8 oz rice noodles, 8 oz beef sirloin, thinly sliced, ½ onion, thinly sliced, 4 green onions, sliced, ¼ cup chopped fresh cilantro, Bean sprouts, Thai basil leaves, lime wedges, hoisin sauce, and sriracha, for serving",
      "prepare": "Step 1: Preheat the oven to 425°F (220°C). Place the beef bones, onion, and ginger on a baking sheet and roast for 30 minutes.\nStep 2: Transfer the roasted bones, onion, and ginger to a large pot. Add star anise, cinnamon sticks, cloves, and coriander seeds.\nStep 3: Fill the pot with water, enough to cover the bones. Bring to a boil, then reduce the heat to low and simmer for 4-6 hours, skimming off any impurities that rise to the surface.\nStep 4: Strain the broth into another pot, discarding the solids. Stir in fish sauce, sugar, and salt to taste.\nStep 5: Cook the rice noodles according to package instructions. Drain and set aside.\nStep 6: Divide the cooked rice noodles among serving bowls. Top with thinly sliced beef sirloin, onion slices, green onions, and chopped cilantro.\nStep 7: Ladle the hot broth over the noodles and beef, allowing the heat of the broth to cook the beef.\nStep 8: Serve pho with bean sprouts, Thai basil leaves, lime wedges, hoisin sauce, and sriracha on the side. Let each person customize their bowl with their preferred toppings.",
      "img": "https://www.recipetineats.com/wp-content/uploads/2020/05/Chicken-Pho_2-SQ.jpg"
    },
    {
      "id": 9,
      "title": "Poutine",
      "ingredients": "3 lbs russet potatoes, cut into fries, Vegetable oil, for frying, 2 cups cheese curds, Gravy: 4 tablespoons unsalted butter, 4 tablespoons all-purpose flour, 4 cups beef or chicken broth, Salt and pepper, to taste",
      "prepare": "Step 1: Heat vegetable oil in a deep fryer or large pot to 325°F (165°C).\nStep 2: Fry the potato fries in batches until they are golden and crisp. Transfer to a paper towel-lined plate to drain excess oil.\nStep 3: In a saucepan, melt butter over medium heat. Stir in flour until well combined to make a roux.\nStep 4: Gradually whisk in the broth, stirring constantly, until the gravy thickens. Season with salt and pepper to taste.\nStep 5: To assemble the poutine, place a layer of fries on a serving plate or in a shallow dish. Sprinkle cheese curds over the fries. Pour hot gravy over the top, allowing the cheese curds to melt.\nStep 6: Serve poutine immediately while the fries are still hot and the cheese is gooey.",
      "img": "https://thecozycook.com/wp-content/uploads/2018/11/Poutine-Recipe-f.jpg"
    },
    {
      "id": 10,
      "title": "Croissant",
      "ingredients": "For the dough: 2 cups all-purpose flour, 2 tablespoons granulated sugar, 1½ teaspoons instant yeast, 1½ teaspoons salt, ½ cup warm milk, 2 tablespoons unsalted butter, melted, ½ cup cold unsalted butter, For the egg wash: 1 egg, beaten, 1 tablespoon water",
      "prepare": "Step 1: In a large bowl, whisk together flour, sugar, instant yeast, and salt.\nStep 2: Add warm milk and melted butter to the dry ingredients. Stir until a soft dough forms.\nStep 3: Transfer the dough to a lightly floured surface and knead for about 5 minutes, until smooth and elastic.\nStep 4: Shape the dough into a square. Wrap it in plastic wrap and refrigerate for 30 minutes.\nStep 5: Meanwhile, place the cold butter between two sheets of plastic wrap and pound it with a rolling pin to flatten and soften it.\nStep 6: Roll out the chilled dough into a large rectangle. Place the flattened butter in the center of the dough.\nStep 7: Fold the dough over the butter, sealing the edges.\nStep 8: Roll out the dough into a long rectangle. Fold the dough into thirds, like a letter.\nStep 9: Turn the dough 90 degrees and roll it out again into a long rectangle. Fold the dough into thirds.\nStep 10: Wrap the dough in plastic wrap and refrigerate for 30 minutes.\nStep 11: Repeat the rolling and folding process two more times, chilling the dough for 30 minutes between each fold.\nStep 12: After the final fold, wrap the dough in plastic wrap and refrigerate overnight.\nStep 13: Preheat the oven to 425°F (220°C).\nStep 14: Roll out the chilled dough into a large rectangle. Cut triangles from the dough and roll them up tightly, starting from the wider end.\nStep 15: Place the croissants on a baking sheet lined with parchment paper. Brush them with the egg wash.\nStep 16: Bake the croissants for 15-20 minutes, until golden brown.\nStep 17: Allow the croissants to cool on a wire rack before serving.",
      "img": "https://static.toiimg.com/thumb/61912818.cms?imgsize=772945&width=800&height=800"
    },
    {
      "id": 11,
      "title": "Sushi Rolls",
      "ingredients": "2 cups sushi rice, 1/2 cup rice vinegar, 2 tablespoons sugar, 1 tablespoon salt, Nori seaweed sheets, Assorted fillings (such as sliced avocado, cucumber, imitation crab, cooked shrimp, etc.), Soy sauce, Wasabi, Pickled ginger",
      "prepare": "Step 1: Rinse the sushi rice under cold water until the water runs clear. Drain well.\nStep 2: In a saucepan, combine the rinsed rice and 2 cups of water. Bring to a boil, then reduce the heat to low and cover. Cook for 15-20 minutes, or until the rice is tender and the water is absorbed.\nStep 3: In a small bowl, combine the rice vinegar, sugar, and salt. Microwave for 30 seconds, or until the sugar and salt dissolve.\nStep 4: Transfer the cooked rice to a large bowl and drizzle the vinegar mixture over the top. Gently fold the rice to combine, being careful not to mash the grains.\nStep 5: Lay a sheet of nori seaweed on a bamboo sushi mat or a clean dish towel.\nStep 6: Moisten your hands with water to prevent sticking, then grab a handful of sushi rice and spread it evenly over the nori, leaving a 1-inch border at the top.\nStep 7: Arrange your desired fillings in a line down the center of the rice.\nStep 8: Using the bamboo mat or dish towel, roll the sushi tightly from bottom to top, applying gentle pressure to shape it.\nStep 9: Moisten the top border of the nori with water to seal the roll.\nStep 10: Use a sharp knife to slice the sushi roll into bite-sized pieces.\nStep 11: Serve the sushi rolls with soy sauce, wasabi, and pickled ginger.",
      "img": "https://veganheaven.org/wp-content/uploads/2018/08/Vegan-Sushi-31-500x500.jpg"
    },
    {
      "id": 12,
      "title": "Goulash",
      "ingredients": "2 lbs beef stew meat, cut into bite-sized pieces, 2 tablespoons vegetable oil, 2 onions, chopped, 3 cloves garlic, minced, 2 tablespoons sweet paprika, 1 teaspoon caraway seeds, 1 teaspoon dried thyme, 1 can diced tomatoes (14 oz), 2 cups beef broth, Salt and pepper, to taste, Sour cream, for serving, Chopped fresh parsley, for garnish",
      "prepare": "Step 1: Heat vegetable oil in a large pot or Dutch oven over medium heat. Add the chopped onions and minced garlic. Sauté until the onions are soft and translucent.\nStep 2: Add the beef stew meat to the pot and cook until browned on all sides.\nStep 3: Stir in the sweet paprika, caraway seeds, and dried thyme. Cook for an additional 1-2 minutes.\nStep 4: Add the diced tomatoes and beef broth to the pot. Season with salt and pepper to taste.\nStep 5: Bring the mixture to a boil, then reduce the heat to low. Cover and simmer for 1.5-2 hours, or until the beef is tender.\nStep 6: Serve the goulash hot, topped with a dollop of sour cream and a sprinkle of chopped fresh parsley.",
      "img": "https://www.thecabindiary.com/ezoimgfmt/b2694474.smushcdn.com/2694474/wp-content/uploads/2021/01/americangoulashrecipe-1-6-1.jpg?lossy=1&strip=1&webp=1&ezimgfmt=rs:371x371/rscb1/ngcb1/notWebP"
    },
    {
      "id": 13,
      "title": "Fish and Chips",
      "ingredients": "4 cod fillets, 1 cup all-purpose flour, 1 teaspoon baking powder, 1 teaspoon salt, 1 cup cold water, Vegetable oil, for frying, 4 large potatoes, cut into thick fries, Salt, to taste, Malt vinegar, for serving",
      "prepare": "Step 1: In a large bowl, whisk together flour, baking powder, and salt. Gradually add the cold water, whisking until a smooth batter forms.\nStep 2: Heat vegetable oil in a deep fryer or large pot to 375°F (190°C).\nStep 3: Dip each cod fillet into the batter, allowing any excess to drip off. Carefully place the battered fillets into the hot oil.\nStep 4: Fry the fish for 5-6 minutes, or until golden brown and crispy. Remove from the oil and drain on a paper towel-lined plate.\nStep 5: In the same hot oil, fry the potato fries in batches until they are golden and crisp. Transfer to a paper towel-lined plate to drain excess oil.\nStep 6: Season the fish and chips with salt to taste.\nStep 7: Serve the fish and chips hot with malt vinegar for dipping.",
      "img": "https://tastesbetterfromscratch.com/wp-content/uploads/2022/03/Fish-and-Chips-Web-8-500x500.jpg"
    },
    {
      "id": 14,
      "title": "Hummus",
      "ingredients": "1 can chickpeas (15 oz), drained and rinsed, 3 tablespoons tahini, 3 tablespoons lemon juice, 2 tablespoons olive oil, 2 cloves garlic, minced, ½ teaspoon ground cumin, Salt, to taste, 2 tablespoons water, Paprika, for garnish, Extra-virgin olive oil, for drizzling",
      "prepare": "Step 1: In a food processor, combine the chickpeas, tahini, lemon juice, olive oil, minced garlic, ground cumin, and salt.\nStep 2: Process the mixture until smooth and creamy, scraping down the sides of the bowl as needed.\nStep 3: With the food processor running, gradually add water, 1 tablespoon at a time, until the desired consistency is reached.\nStep 4: Transfer the hummus to a serving bowl. Sprinkle with paprika and drizzle with extra-virgin olive oil.\nStep 5: Serve the hummus with pita bread, fresh vegetables, or your favorite dippers.",
      "img": "https://veenaazmanov.com/wp-content/uploads/2020/07/Homemade-Healthy-Hummus-Recipe1-900x900.jpg"
    },
    {
      "id": 15,
      "title": "Beef Stroganoff",
      "ingredients": "1 lb beef sirloin, thinly sliced, Salt and pepper, to taste, 2 tablespoons vegetable oil, 1 onion, thinly sliced, 8 ounces mushrooms, sliced, 2 cloves garlic, minced, 1 tablespoon all-purpose flour, 1 cup beef broth, 1 tablespoon Dijon mustard, 1 tablespoon Worcestershire sauce, ½ cup sour cream, Chopped fresh parsley, for garnish",
      "prepare": "Step 1: Season the thinly sliced beef sirloin with salt and pepper.\nStep 2: Heat vegetable oil in a large skillet over medium-high heat. Add the sliced onion and sliced mushrooms. Sauté until the vegetables are softened.\nStep 3: Add the minced garlic to the skillet and cook for an additional minute.\nStep 4: Push the vegetables to one side of the skillet and add the beef slices. Cook until the beef is browned on all sides.\nStep 5: Sprinkle all-purpose flour over the beef and vegetables. Stir to coat.\nStep 6: Gradually add beef broth, stirring constantly, until the mixture thickens.\nStep 7: Stir in Dijon mustard and Worcestershire sauce.\nStep 8: Reduce the heat to low and simmer for 5 minutes.\nStep 9: Remove the skillet from heat and stir in sour cream.\nStep 10: Serve the beef stroganoff over cooked egg noodles or rice.\nStep 11: Garnish with chopped fresh parsley.",
      "img": "https://themom100.com/wp-content/uploads/2020/10/beef-stroganoff-287-768x768.jpg"
    },
    {
      "id": 16,
      "title": "Chicken Parmesan",
      "ingredients": "2 boneless, skinless chicken breasts, Salt and pepper, to taste, ½ cup all-purpose flour, 2 eggs, beaten, 1 cup breadcrumbs, ½ cup grated Parmesan cheese, 2 tablespoons olive oil, 1 cup marinara sauce, 1 cup shredded mozzarella cheese, Fresh basil leaves, for garnish",
      "prepare": "Step 1: Preheat the oven to 400°F (200°C).\nStep 2: Season the chicken breasts with salt and pepper.\nStep 3: Dredge the chicken breasts in flour, shaking off any excess.\nStep 4: Dip the chicken breasts in beaten eggs, allowing any excess to drip off.\nStep 5: In a shallow dish, combine breadcrumbs and grated Parmesan cheese. Coat the chicken breasts with the breadcrumb mixture.\nStep 6: Heat olive oil in a large skillet over medium heat. Add the breaded chicken breasts and cook until golden brown on both sides.\nStep 7: Transfer the chicken breasts to a baking dish. Spoon marinara sauce over the top.\nStep 8: Sprinkle shredded mozzarella cheese over the sauce.\nStep 9: Bake in the preheated oven for 15-20 minutes, or until the cheese is melted and bubbly.\nStep 10: Garnish with fresh basil leaves before serving.",
      "img": "https://www.foodandwine.com/thmb/P5ebl_oWTxx6Yr75r093YcV4reI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/200912-r-xl-chicken-parmigiana-50327e2498184f60a8053dd76eaf951b.jpg"
    },
    {
      "id": 17,
      "title": "Falafel",
      "ingredients": "1 cup dried chickpeas, soaked overnight, 1 onion, chopped, 4 cloves garlic, minced, ½ cup fresh parsley, chopped, ½ cup fresh cilantro, chopped, 1 teaspoon ground cumin, 1 teaspoon ground coriander, ½ teaspoon baking powder, Salt and pepper, to taste, Vegetable oil, for frying",
      "prepare": "Step 1: Drain and rinse the soaked chickpeas.\nStep 2: In a food processor, combine chickpeas, chopped onion, minced garlic, chopped parsley, chopped cilantro, ground cumin, ground coriander, baking powder, salt, and pepper.\nStep 3: Process the mixture until it forms a coarse paste. Scrape down the sides of the processor bowl as needed.\nStep 4: Transfer the falafel mixture to a bowl. Cover and refrigerate for at least 1 hour, or until firm.\nStep 5: Heat vegetable oil in a deep fryer or large pot to 375°F (190°C).\nStep 6: Form the falafel mixture into small patties or balls, about 1 inch in diameter.\nStep 7: Fry the falafel in batches until golden brown and crispy, about 3-4 minutes.\nStep 8: Remove the falafel from the oil and drain on a paper towel-lined plate.\nStep 9: Serve the falafel hot with tahini sauce, pita bread, and fresh vegetables.",
      "img": "https://i0.wp.com/feastinthemiddleeast.com/wp-content/uploads/2021/06/Falafel.jpg?resize=900%2C900&ssl=1"
    },
    {
      "id": 18,
      "title": "Ratatouille",
      "ingredients": "2 tablespoons olive oil, 1 onion, chopped, 2 cloves garlic, minced, 1 eggplant, diced, 2 zucchinis, diced, 1 red bell pepper, diced, 1 yellow bell pepper, diced, 1 can diced tomatoes (14 oz), 1 teaspoon dried thyme, 1 teaspoon dried oregano, Salt and pepper, to taste, Fresh basil leaves, chopped, for garnish",
      "prepare": "Step 1: Heat olive oil in a large skillet or Dutch oven over medium heat. Add the chopped onion and minced garlic. Sauté until the onions are soft and translucent.\nStep 2: Add the diced eggplant, diced zucchinis, diced red bell pepper, and diced yellow bell pepper to the skillet. Cook until the vegetables are tender.\nStep 3: Stir in the diced tomatoes, dried thyme, dried oregano, salt, and pepper.\nStep 4: Reduce the heat to low and simmer for 15-20 minutes to allow the flavors to blend.\nStep 5: Remove from heat and garnish with chopped fresh basil leaves before serving.",
      "img": "https://i.pinimg.com/564x/f1/7f/d2/f17fd2137d7fd4b9da8511c989fd6f19.jpg"
    },
    {
      "id": 19,
      "title": "Chicken Fried Rice",
      "ingredients": "2 cups cooked white rice, chilled, 2 tablespoons vegetable oil, 2 boneless, skinless chicken breasts, diced, Salt and pepper, to taste, 2 cloves garlic, minced, 1 cup frozen mixed vegetables, 2 eggs, beaten, 2 tablespoons soy sauce, 1 tablespoon oyster sauce, 1 green onion, sliced",
      "prepare": "Step 1: Heat vegetable oil in a large skillet or wok over medium-high heat.\nStep 2: Season diced chicken breasts with salt and pepper. Add the chicken to the hot skillet and cook until browned and cooked through.\nStep 3: Add minced garlic and frozen mixed vegetables to the skillet. Cook until the vegetables are heated through.\nStep 4: Push the chicken and vegetables to one side of the skillet. Pour beaten eggs into the other side of the skillet.\nStep 5: Scramble the eggs until cooked, then mix them together with the chicken and vegetables.\nStep 6: Add chilled cooked rice to the skillet. Stir-fry everything together until well combined.\nStep 7: Stir in soy sauce and oyster sauce, coating the rice and ingredients.\nStep 8: Cook for an additional 2-3 minutes, until heated through.\nStep 9: Garnish with sliced green onions before serving.",
      "img": "https://i.pinimg.com/564x/ba/bb/0f/babb0f997cb098c26c01c65ae6a5a79a.jpg"
    },
    {
      "id": 20,
      "title": "Chicken Noodle Soup",
      "ingredients": "2 tablespoons butter, 1 onion, chopped, 2 carrots, sliced, 2 stalks celery, sliced, 4 cups chicken broth, 2 cups cooked chicken, shredded, 2 cups egg noodles, Salt and pepper, to taste, Fresh parsley, chopped, for garnish",
      "prepare": "Step 1: In a large pot, melt butter over medium heat. Add the chopped onion, sliced carrots, and sliced celery. Sauté until the vegetables are softened.\nStep 2: Pour chicken broth into the pot and bring to a boil.\nStep 3: Add shredded cooked chicken and egg noodles to the pot. Reduce the heat to low and simmer for 8-10 minutes, or until the noodles are cooked.\nStep 4: Season with salt and pepper to taste.\nStep 5: Remove the pot from heat and garnish with chopped fresh parsley before serving.",
      "img": "https://i.pinimg.com/564x/0e/b6/2c/0eb62c99caaca2e9fc5f43f101feebcf.jpg"
    },
    {
      "id": 21,
      "title": "Chicken Satay",
      "ingredients": "1 lb boneless, skinless chicken thighs, cut into thin strips, 2 tablespoons soy sauce, 2 tablespoons vegetable oil, 2 tablespoons honey, 2 tablespoons peanut butter, 1 tablespoon curry powder, 1 tablespoon lime juice, 1 clove garlic, minced, Wooden skewers, soaked in water for 30 minutes",
      "prepare": "Step 1: In a bowl, combine soy sauce, vegetable oil, honey, peanut butter, curry powder, lime juice, and minced garlic. Stir until well combined.\nStep 2: Add the chicken strips to the bowl and toss to coat them in the marinade. Let the chicken marinate for at least 30 minutes.\nStep 3: Preheat a grill or grill pan to medium-high heat.\nStep 4: Thread the marinated chicken strips onto soaked wooden skewers.\nStep 5: Grill the chicken skewers for 3-4 minutes per side, or until cooked through and slightly charred.\nStep 6: Serve the chicken satay hot with peanut sauce or your favorite dipping sauce.",
      "img": "https://i.pinimg.com/564x/49/ad/7f/49ad7f484e6e0f3a0f67e73351a9d572.jpg"
    },
    {
      "id": 22,
      "title": "Chicken Caesar Salad",
      "ingredients": "2 boneless, skinless chicken breasts, Salt and pepper, to taste, 2 tablespoons olive oil, 1 head romaine lettuce, chopped, ½ cup Caesar dressing, ¼ cup grated Parmesan cheese, Croutons, for garnish",
      "prepare": "Step 1: Season the chicken breasts with salt and pepper.\nStep 2: Heat olive oil in a skillet over medium heat. Add the seasoned chicken breasts and cook until browned and cooked through.\nStep 3: Remove the cooked chicken from the skillet and let it rest for a few minutes. Slice the chicken into thin strips.\nStep 4: In a large bowl, combine chopped romaine lettuce, Caesar dressing, and grated Parmesan cheese. Toss to coat the lettuce evenly.\nStep 5: Divide the dressed lettuce among serving plates. Top with sliced chicken.\nStep 6: Garnish the salad with croutons before serving.",
      "img": "https://i.pinimg.com/564x/4b/56/dc/4b56dcbd952eb0aaa0f2e90adb362ace.jpg"
    },
    {
      "id": 23,
      "title": "Lasagna",
      "ingredients": "8 lasagna noodles, cooked and drained, 1 lb ground beef, 1 onion, chopped, 2 cloves garlic, minced, 1 can crushed tomatoes (14 oz), 1 can tomato sauce (8 oz), 1 can tomato paste (6 oz), 1 teaspoon dried basil, 1 teaspoon dried oregano, Salt and pepper, to taste, 2 cups ricotta cheese, 1 egg, beaten, 2 cups shredded mozzarella cheese, ½ cup grated Parmesan cheese",
      "prepare": "Step 1: Preheat the oven to 375°F (190°C).\nStep 2: In a large skillet, cook the ground beef, chopped onion, and minced garlic until the beef is browned. Drain any excess fat.\nStep 3: Stir in the crushed tomatoes, tomato sauce, tomato paste, dried basil, dried oregano, salt, and pepper. Simmer for 10 minutes.\nStep 4: In a bowl, combine ricotta cheese and beaten egg.\nStep 5: Spread a thin layer of the meat sauce in the bottom of a greased baking dish.\nStep 6: Arrange a layer of cooked lasagna noodles over the sauce.\nStep 7: Spread half of the ricotta cheese mixture over the noodles.\nStep 8: Sprinkle shredded mozzarella cheese over the ricotta layer.\nStep 9: Repeat the layers with meat sauce, noodles, ricotta cheese mixture, and mozzarella cheese.\nStep 10: Finish with a layer of meat sauce on top. Sprinkle grated Parmesan cheese over the sauce.\nStep 11: Cover the baking dish with foil and bake in the preheated oven for 25 minutes.\nStep 12: Remove the foil and bake for an additional 10 minutes, or until the cheese is bubbly and golden.\nStep 13: Let the lasagna cool for a few minutes before serving.",
      "img": "https://i.pinimg.com/564x/2d/34/2f/2d342f1ac0fd0b9fb57c3035c0dba708.jpg"
    },
    {
      "id": 24,
      "title": "Chicken Enchiladas",
      "ingredients": "2 boneless, skinless chicken breasts, cooked and shredded, 1 onion, chopped, 2 cloves garlic, minced, 1 can diced tomatoes with green chilies (10 oz), 1 can enchilada sauce (10 oz), 1 teaspoon ground cumin, Salt and pepper, to taste, 8 flour tortillas, 2 cups shredded cheddar cheese, Fresh cilantro, chopped, for garnish",
      "prepare": "Step 1: Preheat the oven to 375°F (190°C).\nStep 2: In a skillet, sauté chopped onion and minced garlic until the onion is softened.\nStep 3: Add the shredded chicken, diced tomatoes with green chilies, enchilada sauce, ground cumin, salt, and pepper. Cook for 5 minutes.\nStep 4: Spoon a portion of the chicken mixture onto each flour tortilla. Roll up the tortillas and place them seam-side down in a greased baking dish.\nStep 5: Pour any remaining sauce over the rolled tortillas. Sprinkle shredded cheddar cheese over the top.\nStep 6: Bake in the preheated oven for 20-25 minutes, or until the cheese is melted and bubbly.\nStep 7: Garnish with chopped fresh cilantro before serving.",
      "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTs7lbhuSw5kEEQ1-aYWBdcaz-sIFK6HO9u-g&usqp=CAU"
    },
    {
      "id": 25,
      "title": "Pancakes",
      "ingredients": "1 cup all-purpose flour, 2 tablespoons granulated sugar, 2 teaspoons baking powder, ½ teaspoon salt, 1 cup milk, 1 egg, 2 tablespoons melted butter, Additional melted butter or cooking spray, for greasing the skillet",
      "prepare": "Step 1: In a large bowl, whisk together flour, sugar, baking powder, and salt.\nStep 2: In a separate bowl, whisk together milk, egg, and melted butter.\nStep 3: Pour the wet ingredients into the dry ingredients. Stir until just combined. Do not overmix; it's okay if there are a few lumps.\nStep 4: Preheat a skillet or griddle over medium heat. Grease it with melted butter or cooking spray.\nStep 5: Pour ¼ cup of the pancake batter onto the hot skillet for each pancake. Cook until bubbles form on the surface, then flip and cook the other side until golden brown.\nStep 6: Remove the pancakes from the skillet and keep them warm. Repeat with the remaining batter.\nStep 7: Serve the pancakes hot with maple syrup, fresh fruits, or your favorite toppings.",
      "img": "https://static.sscontent.com/thumb/500/500/products/124/v1122225_prozis_zero-instant-pancake-900-g_cappuccino_flavor_27.jpg"
    },
    {
      "id": 26,
      "title": "Miso Soup",
      "ingredients": "4 cups dashi stock, 3 tablespoons miso paste, 1 block silken tofu, diced, 2 green onions, thinly sliced, Wakame seaweed (optional),",
      "prepare": "Step 1: In a saucepan, bring the dashi stock to a simmer.\nStep 2: In a small bowl, whisk miso paste with a small amount of the hot stock until dissolved. Add the miso mixture to the saucepan.\nStep 3: Add diced tofu and wakame seaweed (if using) to the soup.\nStep 4: Simmer gently for a few minutes until heated through.\nStep 5: Serve the miso soup hot, garnished with sliced green onions.",
      "img": "https://assets.bonappetit.com/photos/58a6240fa9bc8a7a3f1cfada/1:1/w_3332,h_3332,c_limit/classic-miso-soup.jpg"
    },
    {
      "id": 27,
      "title": "Churrasco",
      "ingredients": "Yield: 4 servings FOR THE STEAK 1½pounds skirt steak or tri-tip (see Tip) 3large garlic cloves 1tablespoon fresh oregano leaves, finely chopped 1tablespoon white vinegar 2teaspoons olive oil 1tablespoon adobo seasoning (preferably Loísa or Badía brands) 1teaspoon kosher salt (such as Diamond Crystal), plus more to taste FOR THE WASAKAKA ⅓cup fresh lime juice ½cup fresh flat-leaf parsley leaves, finely chopped ¼cup fresh cilantro leaves, finely chopped ¼cup fresh oregano leaves, finely chopped ¼cup extra-virgin olive oil 2garlic cloves, minced ½teaspoon kosher salt (such as Diamond Crystal) ¼teaspoon freshly ground black pepper",
      "prepare": "Step 1 Pat the steaks dry and place in a large zip-top bag. Step 2 Combine the garlic, oregano, vinegar, olive oil, adobo seasoning and salt in the bowl of a pilón or mortar and pestle, or a small food processor. Grind into a thin paste, then pour the marinade over the steak. Zip the bag then shake well to coat the meat, rubbing in gently as needed. Let rest on the counter for 10 to 20 minutes, or refrigerate overnight if you have time. Be sure to let the steak come to room temperature before grilling. Step 3 If using a charcoal grill, start by building a fire with hardwood and kindling, then adding lump hardwood charcoal once the fire is kicking. Allow the fire to mellow. If using a gas grill, set the temperature to 500 degrees. Step 4 Meanwhile, make the wasakaka: Combine the lime juice, parsley, cilantro, oregano, olive oil, garlic, salt and pepper in a small bowl and whisk to incorporate. If you’d like a creamier sauce, blend in a small food processor or blender. (Wasakaka will keep for 3 or 4 days in a sealed jar in the refrigerator.) Step 5 Once the grill is ready, remove skirt steak from the bag and shake off excess marinade. Place on the grill and sear for 1 to 3 minutes. Using tongs, pull up the corner to ensure the steak has a good dark char, bordering on burned in places, before flipping, then cook for 1 more minute for rare, 2 minutes for medium-rare. Be careful not to overcook or steak will be tough. Step 6 Remove steak from grill and let rest for 5 to 7 minutes. Slice into strips and pour over wasakaka, or serve sauce on the side. Taste and sprinkle with additional salt, if desired.",
      "img": "https://www.foodandwine.com/thmb/neTnqsAufFlCoknUHD7uWdtZ1H8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/201307-xl-churrasco-with-chimichurri-2000-018a7d52dce54c60ba0fa9e03a156e49.jpg"
    },
    {
      "id": 28,
      "title": "Empanadas",
      "ingredients": "2 cups all-purpose flour, 1/2 teaspoon salt, 1/2 cup unsalted butter, chilled and diced, 1/4 cup ice water, 1 lb ground beef, 1 onion, chopped, 2 cloves garlic, minced, 1/2 teaspoon ground cumin, 1/2 teaspoon paprika, 1/4 teaspoon cayenne pepper (optional), Salt and pepper, to taste, 1/4 cup chopped olives, 2 boiled eggs, chopped, Egg wash (1 egg beaten with 1 tablespoon water),",
      "prepare": "Step 1: In a large bowl, combine flour and salt. Cut in the chilled butter until the mixture resembles coarse crumbs.\nStep 2: Gradually add ice water, mixing with a fork until the dough comes together.\nStep 3: Turn the dough out onto a lightly floured surface and knead gently until smooth. Wrap in plastic wrap and refrigerate for 30 minutes.\nStep 4: In a skillet, cook ground beef, chopped onion, and minced garlic until the beef is browned. Drain any excess fat.\nStep 5: Stir in ground cumin, paprika, cayenne pepper (if using), salt, and pepper. Cook for a few minutes.\nStep 6: Remove the skillet from heat and stir in chopped olives and boiled eggs.\nStep 7: Preheat the oven to 400°F (200°C) and line a baking sheet with parchment paper.\nStep 8: Roll out the chilled dough on a floured surface to a thickness of about 1/8 inch.\nStep 9: Cut out circles using a round cutter or a glass. Place a spoonful of the beef filling in the center of each circle.\nStep 10: Fold the circles in half and seal the edges by pressing with a fork.\nStep 11: Place the empanadas on the prepared baking sheet. Brush the tops with egg wash.\nStep 12: Bake for 20-25 minutes, or until golden brown.\nStep 13: Serve the empanadas hot as an appetizer or main dish.",
      "img": "https://www.foodandwine.com/thmb/ciU9ep7W0cgwvCqZP-b_yzEnphA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/200905-xl-mini-panamanian-beef-empanadas-f456fd1a540a45c992df0b1629c0cea0.jpg"
    },
    {
      "id": 29,
      "title": "Biryani",
      "ingredients": "2 cups basmati rice, 1 lb chicken, cut into pieces, 1 large onion, sliced, 2 cloves garlic, minced, 1-inch piece ginger, grated, 1 cup plain yogurt, 2 tablespoons biryani masala, 1/2 teaspoon turmeric powder, 1/2 teaspoon red chili powder, Salt, to taste, 2 tablespoons ghee or vegetable oil, 1 cinnamon stick, 2 cardamom pods, 4 cloves, 1 bay leaf, 1/2 cup chopped cilantro, 1/2 cup chopped mint leaves, Saffron strands soaked in milk (optional), Fried onions (optional),",
      "prepare": "Step 1: Rinse basmati rice under cold water until the water runs clear. Soak the rice in water for 30 minutes, then drain.\nStep 2: In a bowl, marinate chicken pieces with sliced onion, minced garlic, grated ginger, plain yogurt, biryani masala, turmeric powder, red chili powder, and salt. Let it marinate for at least 1 hour.\nStep 3: In a large pot, heat ghee or vegetable oil over medium heat. Add cinnamon stick, cardamom pods, cloves, and bay leaf. Sauté for a minute until fragrant.\nStep 4: Add the marinated chicken to the pot and cook until the chicken is browned and cooked through.\nStep 5: Remove the chicken from the pot and set aside.\nStep 6: In the same pot, add soaked and drained rice. Sauté for a few minutes until the rice is coated with the remaining spices and ghee/oil.\nStep 7: Add 4 cups of water to the pot and bring to a boil. Reduce the heat to low, cover the pot, and simmer for about 10-15 minutes, or until the rice is cooked and the water is absorbed.\nStep 8: In a serving dish, layer the cooked rice and the cooked chicken. Sprinkle chopped cilantro and mint leaves on top.\nStep 9: If desired, drizzle saffron-infused milk over the rice for added color and aroma. Top with fried onions.\nStep 10: Cover the dish and let it rest for 10 minutes before serving. Gently mix the layers together before serving.",
      "img": "https://norecipes.com/wp-content/uploads/2017/05/chicken-biryani-006.jpg"
    },
    {
      "id": 30,
      "title": "Sauerbraten",
      "ingredients": "3 lb beef roast (such as rump roast or bottom round), 1 onion, chopped, 2 carrots, chopped, 2 celery stalks, chopped, 2 cloves garlic, minced, 1 cup red wine vinegar, 1 cup water, 2 tablespoons brown sugar, 2 tablespoons whole grain mustard, 1 tablespoon pickling spices, Salt and pepper, to taste, 2 tablespoons vegetable oil, 1 cup beef broth, 1/2 cup sour cream, Chopped fresh parsley, for garnish",
      "prepare": "Step 1: In a large bowl, combine chopped onion, chopped carrots, chopped celery, minced garlic, red wine vinegar, water, brown sugar, whole grain mustard, pickling spices, salt, and pepper.\nStep 2: Place the beef roast in a resealable plastic bag or a glass dish. Pour the marinade mixture over the beef, ensuring it is fully covered. Marinate in the refrigerator for at least 24 hours, turning the meat occasionally.\nStep 3: Preheat the oven to 325°F (160°C).\nStep 4: Remove the beef from the marinade, reserving the marinade.\nStep 5: In a Dutch oven or oven-safe pot, heat vegetable oil over medium-high heat. Add the beef and brown on all sides.\nStep 6: Pour the reserved marinade and beef broth into the pot. Bring to a simmer.\nStep 7: Cover the pot and transfer it to the preheated oven. Cook for about 3-4 hours, or until the beef is tender and can be easily shredded with a fork.\nStep 8: Remove the beef from the pot and set aside. Strain the cooking liquid and discard the solids.\nStep 9: Return the strained liquid to the pot and bring to a simmer. Cook until the liquid is reduced and thickened.\nStep 10: Stir in sour cream until well combined.\nStep 11: Slice the beef and serve it with the sauce.\nStep 12: Garnish with chopped fresh parsley.",
      "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR99T6vmF0N1LEkldhvNotpfp-N-AX5BnGpU00qYvkoAaZAnc4ZxBUghZIQDDwORzIcuTw&usqp=CAU"
    },
    {
      "id": 31,
      "title": "Chicken Adobo",
      "ingredients": "2 lb chicken pieces (legs and thighs), 1/2 cup soy sauce, 1/2 cup vinegar, 1 cup water, 4 cloves garlic, minced, 2 bay leaves, 1 teaspoon whole black peppercorns, 1 tablespoon vegetable oil",
      "prepare": "Step 1: In a large pot or Dutch oven, combine soy sauce, vinegar, water, minced garlic, bay leaves, and whole black peppercorns.\nStep 2: Add the chicken pieces to the pot and bring the liquid to a boil.\nStep 3: Reduce the heat to low, cover the pot, and simmer for about 30-40 minutes, or until the chicken is cooked through and tender.\nStep 4: Remove the chicken from the pot and set aside.\nStep 5: In a separate skillet, heat vegetable oil over medium heat. Add the chicken pieces and cook until browned and crispy on both sides.\nStep 6: Serve the chicken adobo hot with steamed rice and the sauce spooned over the top.",
      "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTD3hEkMYbVgCFH4-Ym510cYcQzidR29yBMZF_Vfda4eNpcp0Uupxg7wER0b8OiooEsctE&usqp=CAU"
    },
    {
      "id": 32,
      "title": "Kimchi",
      "ingredients": "4 cups chicken or vegetable broth, 2 lemongrass stalks, bruised and chopped, 3-4 kaffir lime leaves, torn, 3 slices galangal or ginger, 8 oz shrimp, peeled and deveined, 8 oz mushrooms, sliced, 2 tablespoons fish sauce, 2 tablespoons lime juice, 1 tablespoon chili paste, 1 teaspoon sugar, Fresh cilantro leaves, for garnish",
      "prepare": "Step 1: In a large pot, bring the chicken or vegetable broth to a boil.\nStep 2: Add lemongrass, kaffir lime leaves, and galangal or ginger slices to the pot. Simmer for about 5 minutes to infuse the flavors.\nStep 3: Add shrimp and mushrooms to the pot. Cook until the shrimp are pink and cooked through.\nStep 4: Stir in fish sauce, lime juice, chili paste, and sugar. Taste and adjust the seasoning if needed.\nStep 5: Remove the pot from heat and ladle the soup into serving bowls.\nStep 6: Garnish with fresh cilantro leaves before serving.",
      "img": "https://i.pinimg.com/564x/c2/2f/c5/c22fc50681732f5281db565482576452.jpg"
    },
    {
      "id": 33,
      "title": "Baklava",
      "ingredients": "1 lb phyllo pastry sheets, 1 1/2 cups unsalted butter, melted, 2 cups chopped nuts (such as walnuts, pistachios, or almonds), 1 teaspoon ground cinnamon, 1/2 cup granulated sugar, 1/2 cup water, 1/2 cup honey, 1 teaspoon lemon juice",
      "prepare": "Step 1: Preheat the oven to 325°F (160°C).\nStep 2: In a bowl, combine chopped nuts, ground cinnamon, and granulated sugar.\nStep 3: Brush a baking dish with melted butter.\nStep 4: Place a sheet of phyllo pastry in the baking dish and brush it with melted butter.\nStep 5: Repeat the process, layering and buttering each sheet of phyllo pastry.\nStep 6: Sprinkle a layer of the nut mixture over the phyllo pastry.\nStep 7: Continue layering phyllo pastry and nuts until all the ingredients are used, ending with a final layer of phyllo pastry.\nStep 8: Using a sharp knife, cut the baklava into diamond or square shapes.\nStep 9: Bake in the preheated oven for about 45-50 minutes, or until golden brown.\nStep 10: While the baklava is baking, combine water, honey, and lemon juice in a saucepan. Bring to a boil and simmer for a few minutes.\nStep 11: Remove the baklava from the oven and immediately pour the honey syrup over the hot pastry.\nStep 12: Allow the baklava to cool completely before serving.",
      "img": "https://www.allrecipes.com/thmb/LC_td-hRsYLeMiOF6Y4Z9Ocv19E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9454-greek-baklava-s-tuttle-71eff77a5e3e4ceb94c1d48bafec55f1.jpeg"
    },
    {
      "id": 34,
      "title": "Rendang",
      "ingredients": "2 lb beef chuck or round, cut into cubes, 2 cans coconut milk (13.5 oz each), 4 tablespoons rendang curry paste, 2 lemongrass stalks, bruised, 4 kaffir lime leaves, torn, 2 tablespoons tamarind paste, 2 tablespoons brown sugar, Salt, to taste, Toasted coconut flakes, for garnish",
      "prepare": "Step 1: In a large pot, combine beef cubes, coconut milk, rendang curry paste, bruised lemongrass stalks, torn kaffir lime leaves, tamarind paste, brown sugar, and salt.\nStep 2: Bring the mixture to a boil, then reduce the heat to low and simmer for about 2-3 hours, or until the beef is tender and the sauce has thickened.\nStep 3: Stir occasionally to prevent sticking.\nStep 4: Remove the pot from heat and let the rendang rest for a few minutes.\nStep 5: Serve the rendang hot, garnished with toasted coconut flakes.\nStep 6: Rendang is traditionally served with steamed rice.",
      "img": "https://rasamalaysia.com/wp-content/uploads/2018/04/beef-rendang-thumb.jpg"
    },
    {
      "id": 35,
      "title": "Cacio e Pepe",
      "ingredients": "8 oz spaghetti or bucatini, 2 tablespoons unsalted butter, 1 tablespoon extra-virgin olive oil, 1 cup grated Parmesan cheese, 1/2 cup grated Pecorino Romano cheese, Freshly ground black pepper, to taste",
      "prepare": "Step 1: Cook spaghetti or bucatini according to package instructions until al dente. Reserve 1 cup of the pasta cooking water.\nStep 2: In a skillet, melt butter and olive oil over medium heat.\nStep 3: Add cooked pasta to the skillet, along with grated Parmesan cheese, grated Pecorino Romano cheese, and freshly ground black pepper.\nStep 4: Toss the pasta until the cheeses are melted and the sauce is creamy. Add pasta cooking water as needed to achieve the desired consistency.\nStep 5: Serve the cacio e pepe immediately, garnished with additional black pepper.",
      "img": "https://www.recipesfromitaly.com/wp-content/uploads/2022/04/spaghetti-cacio-e-pepe-recipe-1x1-1200x1200-b.jpg"
    },
    {
      "id": 36,
      "title": "Peking Duck",
      "ingredients": "1 whole duck (about 4-5 lb), 2 tablespoons Chinese five-spice powder, Salt, to taste, 1 tablespoon honey, 1 tablespoon soy sauce, 1 tablespoon hoisin sauce, 1 cucumber, julienned, 8-12 Mandarin pancakes or tortillas",
      "prepare": "Step 1: Preheat the oven to 300°F (150°C).\nStep 2: Rinse the whole duck inside and out, then pat dry with paper towels.\nStep 3: Rub Chinese five-spice powder and salt all over the duck, including the cavity.\nStep 4: Place the duck on a rack in a roasting pan and roast in the preheated oven for about 2-3 hours, or until the skin is crispy and the meat is tender.\nStep 5: In a small bowl, mix honey, soy sauce, and hoisin sauce.\nStep 6: Remove the duck from the oven and brush the honey-soy mixture over the skin.\nStep 7: Let the duck rest for a few minutes, then carve into thin slices.\nStep 8: Serve the Peking duck with julienned cucumber and Mandarin pancakes or tortillas.\nStep 9: To eat, spread hoisin sauce on a pancake or tortilla, top with slices of duck and cucumber, and roll it up.",
      "img": "https://redhousespice.com/wp-content/uploads/2022/01/sliced-peking-duck-with-pancakes-scaled.jpg"
    },
    {
      "id": 37,
      "title": "Fajitas",
      "ingredients": "1 lb chicken or beef, sliced, 1 onion, sliced, 1 bell pepper, sliced, 2 tablespoons vegetable oil, 2 cloves garlic, minced, 1 teaspoon chili powder, 1/2 teaspoon cumin, 1/2 teaspoon paprika, Salt and pepper, to taste, Flour tortillas, Salsa, Guacamole, Sour cream, Shredded cheese, Chopped cilantro, for garnish",
      "prepare": "Step 1: In a skillet, heat vegetable oil over medium-high heat.\nStep 2: Add sliced chicken or beef to the skillet and cook until browned and cooked through.\nStep 3: Remove the cooked meat from the skillet and set aside.\nStep 4: In the same skillet, add sliced onion, sliced bell pepper, minced garlic, chili powder, cumin, paprika, salt, and pepper. Sauté until the vegetables are softened.\nStep 5: Return the cooked meat to the skillet and toss with the sautéed vegetables.\nStep 6: Warm flour tortillas in a dry skillet or microwave.\nStep 7: Serve the fajita filling on warm tortillas.\nStep 8: Garnish with salsa, guacamole, sour cream, shredded cheese, and chopped cilantro.\nStep 9: Roll up the tortillas and enjoy the fajitas.",
      "img": "https://joyfoodsunshine.com/wp-content/uploads/2022/03/chicken-fajitas-recipe-square.jpg"
    },
    {
      "id": 38,
      "title": "Chicken Shawarma",
      "ingredients": "1 lb boneless, skinless chicken thighs, 1/4 cup Greek yogurt, 2 tablespoons olive oil, 2 tablespoons lemon juice, 4 cloves garlic, minced, 1 tablespoon ground cumin, 1 tablespoon ground coriander, 1 teaspoon paprika, 1/2 teaspoon turmeric, Salt and pepper, to taste, Pita bread, Tzatziki sauce, Chopped tomatoes, Chopped cucumbers, Chopped lettuce, Chopped parsley,",
      "prepare": "Step 1: In a bowl, combine Greek yogurt, olive oil, lemon juice, minced garlic, ground cumin, ground coriander, paprika, turmeric, salt, and pepper.\nStep 2: Add boneless, skinless chicken thighs to the bowl and toss to coat the chicken in the marinade.\nStep 3: Cover the bowl and marinate the chicken in the refrigerator for at least 1 hour, or overnight for more flavor.\nStep 4: Preheat a grill or grill pan over medium-high heat.\nStep 5: Remove the chicken from the marinade and grill for about 6-8 minutes per side, or until cooked through.\nStep 6: Remove the chicken from the grill and let it rest for a few minutes.\nStep 7: Slice the chicken into thin strips.\nStep 8: Warm pita bread and spread tzatziki sauce on each pita.\nStep 9: Fill the pita with sliced chicken, chopped tomatoes, chopped cucumbers, chopped lettuce, and chopped parsley.\nStep 10: Roll up the pita and serve the chicken shawarma immediately.",
      "img": "https://www.thechunkychef.com/wp-content/uploads/2021/03/Chicken-Shawarma-recipe-card.jpg"
    },
    {
      "id": 39,
      "title": "Chimichurri",
      "ingredients": "1 cup fresh parsley, packed, 1/2 cup fresh cilantro, packed, 4 cloves garlic, minced, 2 tablespoons fresh oregano leaves, 1/4 cup red wine vinegar, 1/2 cup extra-virgin olive oil, 1 teaspoon red pepper flakes, Salt and pepper, to taste",
      "prepare": "Step 1: In a food processor, combine fresh parsley, fresh cilantro, minced garlic, fresh oregano leaves, red wine vinegar, extra-virgin olive oil, red pepper flakes, salt, and pepper.\nStep 2: Pulse the ingredients until well blended and the sauce reaches your desired consistency.\nStep 3: Taste and adjust the seasoning if needed.\nStep 4: Transfer the chimichurri sauce to a jar or bowl and let it sit at room temperature for at least 30 minutes to allow the flavors to meld.\nStep 5: Serve the chimichurri sauce as a condiment or marinade for grilled meats.",
      "img": "https://natashaskitchen.com/wp-content/uploads/2022/07/Chimichurri-Sauce-SQ-1.jpg"
    },
    {
      "id": 40,
      "title": "Tom Kha Gai",
      "ingredients": "4 cups chicken or vegetable broth, 2 cans coconut milk (13.5 oz each), 2 lemongrass stalks, bruised and chopped, 4 kaffir lime leaves, torn, 2 slices galangal or ginger, 1 lb chicken breast, thinly sliced, 8 oz mushrooms, sliced, 2 tablespoons fish sauce, 2 tablespoons lime juice, 1 tablespoon brown sugar, Thai chilies, sliced (optional), Fresh cilantro leaves, for garnish",
      "prepare": "Step 1: In a large pot, bring chicken or vegetable broth to a boil.\nStep 2: Add coconut milk, lemongrass, kaffir lime leaves, and galangal or ginger slices to the pot. Simmer for about 5 minutes to infuse the flavors.\nStep 3: Add thinly sliced chicken breast and sliced mushrooms to the pot. Cook until the chicken is cooked through.\nStep 4: Stir in fish sauce, lime juice, brown sugar, and Thai chilies (if using). Taste and adjust the seasoning if needed.\nStep 5: Remove the pot from heat and ladle the soup into serving bowls.\nStep 6: Garnish with fresh cilantro leaves before serving.",
      "img": "https://hot-thai-kitchen.com/wp-content/uploads/2014/06/Tom-kha-gai-new-sq.jpg"
    },
    {
      "id": 41,
      "title": "Sauerbraten, do tommor the recipe inside",
      "ingredients": "1 head romaine lettuce, torn into bite-sized pieces, 1/2 cup Caesar dressing, 1/4 cup grated Parmesan cheese, 1/2 cup croutons",
      "prepare": "Step 1: In a large salad bowl, combine torn romaine lettuce, Caesar dressing, and grated Parmesan cheese.\nStep 2: Toss the salad until the lettuce leaves are evenly coated with dressing.\nStep 3: Add croutons and toss again.\nStep 4: Serve the Caesar salad immediately.",
      "img": "https://houseofnasheats.com/wp-content/uploads/2022/09/German-Sauerbraten-Recipe-Square-1.jpg"
    },
    {
      "id": 42,
      "title": "Risotto",
      "ingredients": "4 cups chicken or vegetable broth, 2 tablespoons unsalted butter, 1 small onion, finely chopped, 1 1/2 cups Arborio rice, 1/2 cup dry white wine, 1/2 cup grated Parmesan cheese, Salt and pepper, to taste",
      "prepare": "Step 1: In a saucepan, bring chicken or vegetable broth to a simmer.\nStep 2: In a large skillet or saucepan, melt unsalted butter over medium heat. Add finely chopped onion and sauté until translucent.\nStep 3: Add Arborio rice to the skillet and stir to coat the rice with the melted butter.\nStep 4: Pour in dry white wine and cook until it is absorbed by the rice.\nStep 5: Begin adding the simmering broth to the skillet, about 1/2 cup at a time, stirring frequently. Allow the broth to be absorbed before adding more.\nStep 6: Continue adding broth and stirring until the rice is cooked al dente and creamy in texture. This process will take about 20-25 minutes.\nStep 7: Remove the skillet from heat and stir in grated Parmesan cheese. Season with salt and pepper to taste.\nStep 8: Let the risotto rest for a few minutes before serving.",
      "img": "https://hips.hearstapps.com/hmg-prod/images/delish-191112-risotto-rice-0151-landscape-pf-1574723947.jpg?crop=0.668xw:1.00xh;0.151xw,0&resize=1200:*"
    },
    {
      "id": 43,
      "title": "Jerk Chicken",
      "ingredients": "2 lb chicken pieces (legs and thighs), 1/4 cup soy sauce, 1/4 cup lime juice, 2 tablespoons brown sugar, 2 tablespoons vegetable oil, 2 tablespoons jerk seasoning, 2 cloves garlic, minced, 1 teaspoon dried thyme, 1 teaspoon ground allspice, 1 teaspoon paprika, 1/2 teaspoon cayenne pepper, Salt and pepper, to taste",
      "prepare": "Step 1: In a bowl, combine soy sauce, lime juice, brown sugar, vegetable oil, jerk seasoning, minced garlic, dried thyme, ground allspice, paprika, cayenne pepper, salt, and pepper.\nStep 2: Add chicken pieces to the bowl and toss to coat the chicken in the marinade.\nStep 3: Cover the bowl and marinate the chicken in the refrigerator for at least 1 hour, or overnight for more flavor.\nStep 4: Preheat a grill or grill pan over medium-high heat.\nStep 5: Remove the chicken from the marinade and grill for about 6-8 minutes per side, or until cooked through and charred.\nStep 6: Remove the chicken from the grill and let it rest for a few minutes before serving.",
      "img": "https://foreignfork.com/wp-content/uploads/2023/03/Jerkchicken-FEATURE.jpg"
    },
    {
      "id": 44,
      "title": "Sashimi",
      "ingredients": "Assorted fresh fish (such as tuna, salmon, yellowtail), Soy sauce, Wasabi paste, Pickled ginger",
      "prepare": "Step 1: Use a sharp knife to thinly slice fresh fish into bite-sized pieces.\nStep 2: Arrange the sliced fish on a serving platter.\nStep 3: Serve the sashimi with soy sauce, wasabi paste, and pickled ginger on the side.\nStep 4: Dip the sashimi in soy sauce and add a small amount of wasabi and pickled ginger as desired.",
      "img": "https://aubreyskitchen.com/wp-content/uploads/2021/01/salmon-sashimi-recipe.jpg"
    },
    {
      "id": 45,
      "title": "GGoulash (Czech Republic)",
      "ingredients": "2 lb beef chuck, cut into cubes, 2 onions, chopped, 2 cloves garlic, minced, 2 tablespoons paprika, 1 teaspoon caraway seeds, 2 tablespoons tomato paste, 4 cups beef broth, Salt and pepper, to taste, Sour cream, Chopped fresh parsley, for garnish",
      "prepare": "Step 1: In a large pot or Dutch oven, heat oil over medium-high heat. Add beef cubes and brown on all sides.\nStep 2: Remove the beef from the pot and set aside.\nStep 3: In the same pot, add chopped onions and minced garlic. Sauté until the onions are softened.\nStep 4: Stir in paprika, caraway seeds, and tomato paste. Cook for a minute.\nStep 5: Return the beef to the pot and add beef broth.\nStep 6: Season with salt and pepper to taste.\nStep 7: Bring the mixture to a boil, then reduce the heat to low. Cover the pot and simmer for about 2-3 hours, or until the beef is tender and the flavors have melded together.\nStep 8: Serve the goulash hot, garnished with a dollop of sour cream and chopped fresh parsley.\nStep 9: Goulash is traditionally served with crusty bread or spaetzle.",
      "img": "https://iwashyoudry.com/wp-content/uploads/2021/01/American-Goulash-Recipe.jpg"
    },
    {
      "id": 46,
      "title": "Lobster Thermidor",
      "ingredients": "2 lobster tails, 2 tablespoons unsalted butter, 2 tablespoons all-purpose flour, 1 cup milk, 1/4 cup grated Parmesan cheese, 2 tablespoons Dijon mustard, 2 tablespoons chopped fresh parsley, Salt and pepper, to taste,",
      "prepare": "Step 1: Preheat the oven to 400°F (200°C).\nStep 2: Cut the lobster tails in half lengthwise, exposing the meat.\nStep 3: In a skillet, melt butter over medium heat. Stir in all-purpose flour to make a roux.\nStep 4: Gradually whisk in milk and cook until the mixture thickens.\nStep 5: Stir in grated Parmesan cheese, Dijon mustard, chopped fresh parsley, salt, and pepper.\nStep 6: Place the lobster tails, cut side up, in a baking dish.\nStep 7: Spoon the sauce over the lobster meat.\nStep 8: Bake in the preheated oven for about 12-15 minutes, or until the lobster is cooked through and the sauce is bubbly and golden.\nStep 9: Serve the lobster thermidor hot, garnished with additional chopped parsley.",
      "img": "https://www.allrecipes.com/thmb/TJGN4XRTzS-Od50oun5I8uPMx20=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3697243-cea8737b5a3e48bc8bb0a94bbf50ad94.jpg"
    },
    {
      "id": 47,
      "title": "Chicken Rice",
      "ingredients": "1 lb chicken thighs, 2 cups jasmine rice, 4 cups chicken broth, 2 tablespoons vegetable oil, 2 cloves garlic, minced, 1 thumb-sized piece of ginger, grated, Salt, to taste, Sliced cucumber, for serving, Chopped cilantro, for garnish",
      "prepare": "Step 1: In a pot, bring chicken broth to a boil.\nStep 2: Add chicken thighs to the pot and simmer for about 20 minutes, or until cooked through. Remove the chicken from the pot and set aside.\nStep 3: Rinse jasmine rice under cold water until the water runs clear. Drain well.\nStep 4: In a separate pot, heat vegetable oil over medium heat. Add minced garlic and grated ginger. Sauté until fragrant.\nStep 5: Add the drained jasmine rice to the pot and stir to coat the rice with the garlic and ginger.\nStep 6: Pour the chicken broth (from cooking the chicken) into the pot with the rice. Bring to a boil.\nStep 7: Reduce the heat to low, cover the pot, and simmer for about 15-20 minutes, or until the rice is cooked and the liquid is absorbed.\nStep 8: While the rice is cooking, shred the cooked chicken into bite-sized pieces.\nStep 9: Serve the chicken rice hot, garnished with sliced cucumber and chopped cilantro.",
      "img": "https://keytomylime.com/wp-content/uploads/2021/08/Best-Southern-Chicken-and-Rice-Recipe-735x735.jpg"
    },
    {
      "id": 48,
      "title": "Cannoli",
      "ingredients": "1 cup all-purpose flour, 1 tablespoon granulated sugar, 1/4 teaspoon salt, 2 tablespoons unsalted butter, melted, 1/4 cup white wine, 1 egg white, beaten, 1 cup ricotta cheese, 1/2 cup powdered sugar, 1/4 cup mini chocolate chips, Candied fruit or pistachios, for garnish",
      "prepare": "Step 1: In a bowl, combine all-purpose flour, granulated sugar, and salt.\nStep 2: Add melted butter and white wine to the bowl and mix until a dough forms.\nStep 3: On a lightly floured surface, knead the dough until smooth.\nStep 4: Wrap the dough in plastic wrap and let it rest for 30 minutes.\nStep 5: Preheat the oil in a deep fryer or a large pot to 375°F (190°C).\nStep 6: Roll out the dough on a floured surface to a thickness of about 1/8 inch.\nStep 7: Cut the dough into circles or rectangles, depending on your preference.\nStep 8: Wrap each piece of dough around a cannoli tube, sealing the edges with beaten egg white.\nStep 9: Carefully place the wrapped cannoli tubes into the hot oil and fry until golden brown and crisp. This will take about 2-3 minutes.\nStep 10: Remove the fried cannoli shells from the oil and let them cool on a wire rack.\nStep 11: In a bowl, combine ricotta cheese, powdered sugar, and mini chocolate chips.\nStep 12: Fill the cooled cannoli shells with the ricotta mixture, using a piping bag or a spoon.\nStep 13: Garnish the cannoli with candied fruit or pistachios.\nStep 14: Serve the cannoli immediately.",
      "img": "https://www.barleyandsage.com/wp-content/uploads/2021/07/40-1.jpg"
    },
    {
      "id": 49,
      "title": "Moules Frites",
      "ingredients": "2 lb mussels, cleaned and debearded, 2 tablespoons unsalted butter, 1 onion, finely chopped, 2 cloves garlic, minced, 1 cup white wine, 1 cup chicken or vegetable broth, 1/2 cup heavy cream, Chopped fresh parsley, for garnish, French fries, for serving",
      "prepare": "Step 1: In a large pot or Dutch oven, melt butter over medium heat.\nStep 2: Add finely chopped onion and minced garlic to the pot. Sauté until the onions are softened.\nStep 3: Add cleaned and debearded mussels to the pot.\nStep 4: Pour in white wine and chicken or vegetable broth.\nStep 5: Cover the pot and cook for about 5-7 minutes, or until the mussels have opened. Discard any mussels that remain closed.\nStep 6: Remove the mussels from the pot with a slotted spoon and set them aside.\nStep 7: Stir in heavy cream into the cooking liquid.\nStep 8: Cook the liquid for a few minutes until it thickens slightly.\nStep 9: Return the mussels to the pot and toss them in the sauce to coat.\nStep 10: Sprinkle chopped fresh parsley over the mussels.\nStep 11: Serve the moules frites hot, accompanied by French fries.",
      "img": "https://www.eatingwell.com/thmb/DGoyd1RLAAC3p5X4HjqD6PN2pkQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/moules-frites-443a548a335a4b97936aa050feabeee1.jpg"
    },
    {
      "id": 50,
      "title": "Ravioli",
      "ingredients": "1 package store-bought ravioli, 2 tablespoons unsalted butter, 2 cloves garlic, minced, 1 cup heavy cream, 1/2 cup grated Parmesan cheese, Salt and pepper, to taste, Chopped fresh parsley, for garnish",
      "prepare": "Step 1: Cook the store-bought ravioli according to package instructions.\nStep 2: In a skillet, melt butter over medium heat. Add minced garlic and sauté until fragrant.\nStep 3: Pour in heavy cream and bring to a simmer.\nStep 4: Stir in grated Parmesan cheese and cook until the sauce thickens.\nStep 5: Season the sauce with salt and pepper to taste.\nStep 6: Drain the cooked ravioli and add them to the skillet with the sauce.\nStep 7: Toss the ravioli in the sauce until well coated.\nStep 8: Serve the ravioli hot, garnished with chopped fresh parsley.",
      "img": "https://tmbidigitalassetsazure.blob.core.windows.net/rms3-prod/attachments/37/1200x1200/exps41527_CS143613B11_11_8b.jpg"
    },
    {
      "id": 51,
      "title": "Carbonara (Italy)",
      "ingredients": "Ingredients:\n- 12 ounces spaghetti\n- 4 large eggs\n- 1 cup grated Pecorino Romano cheese\n- 1 cup grated Parmesan cheese\n- 6 ounces pancetta or guanciale, diced\n- 4 cloves garlic, minced\n- Freshly ground black pepper\n- Salt to taste",
      "prepare": "Preparation:\n1. Cook spaghetti in a large pot of boiling salted water until al dente. Drain, reserving 1/2 cup of pasta water.\n2. In a bowl, whisk together eggs, Pecorino Romano cheese, and Parmesan cheese. Season with black pepper.\n3. In a skillet, cook pancetta or guanciale over medium heat until crispy. Add minced garlic and cook for another minute.\n4. Add cooked spaghetti to the skillet and toss to coat with the pancetta and garlic.\n5. Remove from heat and quickly stir in the egg and cheese mixture. The heat from the pasta will cook the eggs, creating a creamy sauce.\n6. If the sauce is too thick, add some of the reserved pasta water to achieve the desired consistency.\n7. Serve immediately with extra grated cheese and black pepper on top.",
      "img": "https://www.eatingwell.com/thmb/yL0Cp83QzS8uPIj-c04yGb5nfoE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4177366-7c61e0b04ab6490584e4b9f7556bdc0e.jpg"
    },
    {
      "id": 52,
      "title": "Chicken Adobo (Philippines)",
      "ingredients": "Ingredients:\n- 2 pounds chicken thighs and/or drumsticks\n- 1/2 cup soy sauce\n- 1/2 cup vinegar (cane or rice vinegar preferred)\n- 1 cup water\n- 4-6 cloves garlic, minced\n- 1 bay leaf\n- 1 teaspoon black peppercorns\n- 1 tablespoon cooking oil\n- Optional: 1 teaspoon brown sugar for a slightly sweeter adobo",
      "prepare": "Preparation:\n1. In a large bowl or ziplock bag, combine chicken, soy sauce, vinegar, water, minced garlic, bay leaf, and black peppercorns.\n2. Marinate the chicken in the refrigerator for at least 1 hour (overnight for best results).\n3. Heat oil in a large skillet or pot over medium-high heat. Remove the chicken from the marinade and reserve the marinade.\n4. Brown the chicken on all sides until it develops a nice caramelized color.\n5. Pour in the reserved marinade and bring it to a boil. Reduce the heat to low, cover, and let it simmer for about 30-40 minutes or until the chicken is tender.\n6. If using, add the brown sugar and stir until it dissolves.\n7. Serve the chicken adobo with steamed rice and drizzle with some of the adobo sauce.",
      "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTv0sC1OOLE80wF1ZUqTAYtz-kznhXlhmYZFMIRhKc5JnhDXyk3iPSo7hKNr4J50I8DVr4&usqp=CAU"
    },
    {
      "id": 53,
      "title": "Spanakopita (Greece)",
      "ingredients": "Ingredients:\n- 1 pound fresh spinach, chopped\n- 1/2 cup feta cheese, crumbled\n- 1/2 cup ricotta cheese\n- 1/4 cup grated Parmesan cheese\n- 2 green onions, finely chopped\n- 2 tablespoons fresh dill, chopped\n- 2 tablespoons fresh parsley, chopped\n- 2 eggs, lightly beaten\n- Salt and pepper to taste\n- 1 package phyllo dough\n- 1/2 cup melted butter or olive oil",
      "prepare": "Preparation:\n1. Preheat the oven to 350°F (175°C).\n2. In a large bowl, mix together chopped spinach, feta cheese, ricotta cheese, grated Parmesan cheese, green onions, dill, parsley, and beaten eggs.\n3. Season the mixture with salt and pepper to taste.\n4. Unroll the phyllo dough and cover it with a damp towel to prevent it from drying out.\n5. Take one sheet of phyllo dough and brush it with melted butter or olive oil. Place another sheet on top and repeat the process until you have a stack of 4-5 sheets.\n6. Spoon some of the spinach and cheese mixture onto the phyllo stack and spread it evenly.\n7. Roll up the phyllo stack into a log, folding in the sides to seal the filling.\n8. Repeat the process with the remaining phyllo dough and filling.\n9. Place the spanakopita rolls on a baking sheet and brush the tops with more melted butter or olive oil.\n10. Bake in the preheated oven for about 25-30 minutes or until the spanakopita is golden and crispy.\n11. Serve warm as an appetizer or side dish.",
      "img": "https://meltemicatering.com/wp-content/uploads/2019/11/spanakopita3.jpg"
    },
    {
      "id": 54,
      "title": "Beef Stroganoff (Russia)",
      "ingredients": "Ingredients:\n- 1 pound beef sirloin or tenderloin, thinly sliced\n- 1 onion, finely chopped\n- 2 tablespoons butter\n- 2 cups mushrooms, sliced\n- 1 cup beef broth\n- 1 tablespoon Dijon mustard\n- 1 tablespoon all-purpose flour\n- 1 cup sour cream\n- Salt and pepper to taste\n- Chopped fresh parsley for garnish\n- Cooked egg noodles or rice for serving",
      "prepare": "Preparation:\n1. In a large skillet, melt the butter over medium-high heat. Add the chopped onion and cook until it becomes translucent.\n2. Add the sliced beef to the skillet and cook until it is browned on all sides. Season with salt and pepper.\n3. Stir in the sliced mushrooms and cook until they are tender and lightly browned.\n4. Sprinkle the flour over the meat and mushrooms and stir to coat everything evenly.\n5. Pour in the beef broth and Dijon mustard. Stir well and bring the mixture to a simmer.\n6. Lower the heat to medium and let the stroganoff simmer for about 5 minutes.\n7. Stir in the sour cream, making sure it is well incorporated into the sauce.\n8. Adjust the seasoning with salt and pepper to taste.\n9. Serve the beef stroganoff over cooked egg noodles or rice.\n10. Garnish with chopped fresh parsley before serving.",
      "img": "https://www.slimmingeats.com/blog/wp-content/uploads/2010/01/beef-stroganoff-5-1.jpg"
    },
    {
      "id": 55,
      "title": "Tandoori Chicken (India)",
      "ingredients": "Ingredients:\n- 2 pounds chicken drumsticks or thighs\n- 1 cup plain yogurt\n- 2 tablespoons tandoori masala spice mix\n- 1 tablespoon paprika\n- 1 tablespoon ground cumin\n- 1 tablespoon ground coriander\n- 1 tablespoon garam masala\n- 2 tablespoons lemon juice\n- 4 cloves garlic, minced\n- 1-inch piece of ginger, grated\n- 1/4 cup vegetable oil\n- Salt to taste\n- Lemon wedges and cilantro for garnish",
      "prepare": "Preparation:\n1. In a large bowl, combine yogurt, tandoori masala, paprika, ground cumin, ground coriander, garam masala, lemon juice, minced garlic, grated ginger, vegetable oil, and salt.\n2. Make deep cuts in the chicken pieces with a knife to allow the marinade to penetrate.\n3. Add the chicken to the marinade, making sure each piece is coated. Cover the bowl and let it marinate in the refrigerator for at least 2 hours (overnight is best).\n4. Preheat the oven to 450°F (230°C).\n5. Place a wire rack on a baking sheet and arrange the marinated chicken pieces on the rack.\n6. Bake the chicken in the preheated oven for about 25-30 minutes or until it is cooked through and has a slightly charred appearance.\n7. Serve the tandoori chicken with lemon wedges and garnish with fresh cilantro.",
      "img": "https://images.getrecipekit.com/20221111163822-2.png?aspect_ratio=1:1&quality=90&"
    },
    {
      "id": 56,
      "title": "Shrimp Scampi (Italy)",
      "ingredients": "Ingredients:\n- 1 pound large shrimp, peeled and deveined\n- 8 ounces linguine or spaghetti\n- 4 tablespoons unsalted butter\n- 2 tablespoons olive oil\n- 4 cloves garlic, minced\n- 1/4 teaspoon red pepper flakes (optional)\n- 1/4 cup dry white wine\n- 1/4 cup chicken broth\n- 1 tablespoon lemon juice\n- Zest of 1 lemon\n- 1/4 cup chopped fresh parsley\n- Salt and pepper to taste",
      "prepare": "Preparation:\n1. Cook the linguine or spaghetti according to package instructions until al dente. Drain and set aside.\n2. In a large skillet, melt butter with olive oil over medium heat.\n3. Add minced garlic and red pepper flakes (if using) to the skillet. Cook for about 1 minute until the garlic becomes fragrant.\n4. Add the shrimp to the skillet and cook for 2-3 minutes on each side until they turn pink and are cooked through. Season with salt and pepper.\n5. Remove the shrimp from the skillet and set aside.\n6. Pour white wine and chicken broth into the skillet, scraping the bottom to deglaze it.\n7. Let the liquid simmer for a minute or two until it reduces slightly.\n8. Stir in lemon juice and lemon zest.\n9. Return the cooked shrimp to the skillet and toss everything together.\n10. Add the cooked linguine or spaghetti to the skillet and toss until it is well coated with the sauce.\n11. Remove the skillet from heat and sprinkle chopped fresh parsley over the shrimp scampi.\n12. Serve immediately as a delicious and flavorful pasta dish.",
      "img": "https://images.slurrp.com/prod/recipe_images/eatingwell/fennel-shrimp-fra-diavolo-1621865361_CHLVJ6LZEYFH7EA7G9WE.webp?impolicy=slurrp-20210601&width=1200&height=900&q=75"
    },
    {
      "id": 57,
      "title": "Bibimbap (Korea)",
      "ingredients": "Ingredients:\n- 2 cups cooked short-grain rice\n- 1 cup sliced beef (bulgogi) or tofu for a vegetarian option\n- 1 carrot, julienned\n- 1 zucchini, julienned\n- 1 cup spinach\n- 1 cup bean sprouts\n- 2 tablespoons sesame oil\n- 2 tablespoons soy sauce\n- 2 cloves garlic, minced\n- 2 teaspoons sugar\n- 2 tablespoons gochujang (Korean red pepper paste)\n- 2 teaspoons sesame seeds\n- 2 fried eggs\n- Thinly sliced cucumber and radish for garnish",
      "img": "https://www.196flavors.com/wp-content/uploads/2012/11/dolsot-bibimbap-FP1.jpg"
    },
    {
      "id": 58,
      "title": "Chicken Paprikash (Hungary)",
      "ingredients": "Ingredients:\n- 2 pounds chicken thighs and/or drumsticks\n- 2 large onions, finely chopped\n- 2 tablespoons vegetable oil\n- 2 tablespoons sweet Hungarian paprika\n- 1 teaspoon hot Hungarian paprika (optional)\n- 2 cups chicken broth\n- 1 cup sour cream\n- Salt and pepper to taste\n- Cooked egg noodles or rice for serving\n- Chopped fresh parsley for garnish",
      "prepare": "Preparation:\n1. Season the chicken thighs and drumsticks with salt and pepper.\n2. In a large pot or Dutch oven, heat vegetable oil over medium-high heat.\n3. Add chopped onions and sauté until they become translucent.\n4. Stir in sweet Hungarian paprika and optional hot Hungarian paprika, and cook for a minute to release the flavors.\n5. Add the chicken pieces to the pot and brown them on all sides.\n6. Pour in the chicken broth, cover the pot, and let the chicken simmer for about 25-30 minutes or until it is cooked through and tender.\n7. Remove the chicken from the pot and set it aside.\n8. Stir in the sour cream into the sauce, whisking until it is smooth.\n9. Return the chicken to the pot and coat it with the creamy paprika sauce.\n10. Serve the chicken paprikash over cooked egg noodles or rice.\n11. Garnish with chopped fresh parsley before serving.",
      "img": "https://i.pinimg.com/564x/01/5b/d1/015bd1d5d5a505115d33df910a4a189b.jpg"
    },
    {
      "id": 59,
      "title": "Goulash (Hungary)",
      "ingredients": "Ingredients:\n- 2 pounds beef stew meat, cubed\n- 2 large onions, finely chopped\n- 2 tablespoons vegetable oil\n- 2 tablespoons sweet Hungarian paprika\n- 1 teaspoon caraway seeds\n- 3 cloves garlic, minced\n- 2 tablespoons tomato paste\n- 4 cups beef broth\n- 2 large potatoes, peeled and cubed\n- 1 red bell pepper, chopped\n- 1 green bell pepper, chopped\n- Salt and pepper to taste\n- Sour cream for serving\n- Chopped fresh parsley for garnish",
      "prepare": "Preparation:\n1. In a large pot or Dutch oven, heat vegetable oil over medium-high heat.\n2. Add chopped onions and sauté until they become translucent.\n3. Stir in sweet Hungarian paprika, caraway seeds, and minced garlic, and cook for a minute to release the flavors.\n4. Add the beef stew meat to the pot and brown it on all sides.\n5. Stir in tomato paste and cook for another minute.\n6. Pour in the beef broth and bring the mixture to a boil.\n7. Reduce the heat to low, cover the pot, and let the goulash simmer for about 1.5 to 2 hours or until the beef is tender.\n8. Add the cubed potatoes, red bell pepper, and green bell pepper to the pot.\n9. Continue to simmer for another 30 minutes or until the vegetables are cooked through.\n10. Adjust the seasoning with salt and pepper to taste.\n11. Serve the goulash hot, garnished with a dollop of sour cream and chopped fresh parsley.\n12. Enjoy this hearty and flavorful Hungarian stew!",
      "img": "https://i.pinimg.com/564x/48/dd/b3/48ddb36e490778d7762c813a7c6de3c7.jpg"
    },
    {
      "id": 60,
      "title": "Chicken Tandoori (India)",
      "ingredients": "Ingredients:\n- 2 pounds chicken drumsticks or thighs\n- 1 cup plain yogurt\n- 2 tablespoons lemon juice\n- 4 cloves garlic, minced\n- 1-inch piece of ginger, grated\n- 1 tablespoon garam masala\n- 1 tablespoon ground cumin\n- 1 tablespoon ground coriander\n- 1 tablespoon ground turmeric\n- 1 tablespoon paprika\n- 1/2 teaspoon cayenne pepper (adjust to your spice preference)\n- 1 teaspoon salt\n- Vegetable oil for brushing\n- Lemon wedges and cilantro for garnish",
      "img": "https://i.pinimg.com/564x/2c/56/16/2c5616accfc0a66e2e1654b6a9ad0078.jpg"
    },
    {
      "id": 61,
      "title": "Caesar Salad (United States)",
      "ingredients": "Ingredients:\n- 1 head romaine lettuce, washed and torn into bite-sized pieces\n- 1/2 cup Caesar dressing (store-bought or homemade)\n- 1/4 cup grated Parmesan cheese\n- 1 cup croutons\n- 2 tablespoons lemon juice\n- 1 tablespoon Dijon mustard\n- 2 cloves garlic, minced\n- 1/4 cup olive oil\n- Salt and pepper to taste\n- Optional: anchovies and boiled egg for additional toppings",
      "prepare": "Preparation:\n1. In a small bowl, whisk together lemon juice, Dijon mustard, minced garlic, olive oil, salt, and pepper to create the Caesar dressing.\n2. In a large salad bowl, add torn romaine lettuce, grated Parmesan cheese, and croutons.\n3. Pour the Caesar dressing over the salad and toss everything together until the lettuce is evenly coated.\n4. Optional: Add anchovies and sliced boiled egg on top for additional toppings.\n5. Serve the Caesar salad immediately as a refreshing and classic side dish.",
      "img": "https://i.pinimg.com/564x/86/44/89/864489a2882623bb7244a68cc2c4db9f.jpg"
    },
    {
      "id": 62,
      "title": "Croque Monsieur (France)",
      "ingredients": "Ingredients:\n- 8 slices of bread\n- 4 slices ham\n- 2 cups grated Gruyère cheese\n- 2 cups milk\n- 2 tablespoons unsalted butter\n- 2 tablespoons all-purpose flour\n- 1/4 teaspoon nutmeg\n- Salt and pepper to taste\n- Dijon mustard for spreading\n- 2 tablespoons grated Parmesan cheese\n- Optional: 4 fried eggs for Croque Madame variation",
      "prepare": "Preparation:\n1. Preheat the oven to 375°F (190°C).\n2. Make a béchamel sauce: In a saucepan, melt the butter over medium heat. Add the flour and cook, stirring constantly, for about 2 minutes to create a roux. Slowly whisk in the milk, nutmeg, salt, and pepper. Cook the sauce until it thickens and becomes smooth.\n3. Lay out 4 slices of bread and spread Dijon mustard on each slice.\n4. Place a slice of ham on top of the mustard on each slice of bread.\n5. Sprinkle a generous amount of grated Gruyère cheese over the ham.\n6. Top each stack with another slice of bread to make a sandwich.\n7. Pour the béchamel sauce over the sandwiches, making sure they are fully covered.\n8. Sprinkle grated Parmesan cheese on top of the sauce.\n9. Place the Croque Monsieur sandwiches on a baking sheet and bake in the preheated oven for about 15-20 minutes or until the cheese is melted and bubbly, and the sandwiches are heated through.\n10. Optional: For a Croque Madame variation, fry 4 eggs in a pan and place one egg on top of each sandwich.\n11. Serve the Croque Monsieur (or Madame) hot and enjoy this delightful French comfort food!",
      "img": "https://i.pinimg.com/564x/52/f5/ff/52f5ff5cea0b95db2801366ba5ed836c.jpg"
    },
    {
      "id": 63,
      "title": "Chicken Marsala (Italy)",
      "ingredients": "Ingredients:\n- 4 boneless, skinless chicken breasts\n- 1/2 cup all-purpose flour\n- Salt and pepper to taste\n- 2 tablespoons olive oil\n- 1/4 cup unsalted butter\n- 8 ounces mushrooms, sliced\n- 1/2 cup Marsala wine\n- 1/2 cup chicken broth\n- 1/2 cup heavy cream\n- Chopped fresh parsley for garnish\n- Cooked fettuccine or mashed potatoes for serving",
      "prepare": "Preparation:\n1. Place the chicken breasts between two sheets of plastic wrap and pound them with a meat mallet until they are evenly thin.\n2. Season the chicken breasts with salt and pepper.\n3. Dredge the chicken in flour, shaking off any excess.\n4. In a large skillet, heat olive oil over medium-high heat.\n5. Add the chicken breasts and cook for about 3-4 minutes on each side until they are browned and cooked through. Remove the chicken from the skillet and set it aside.\n6. In the same skillet, melt the butter over medium heat.\n7. Add sliced mushrooms and sauté until they become tender and lightly browned.\n8. Pour in the Marsala wine and chicken broth, scraping the bottom of the skillet to deglaze it.\n9. Let the liquid simmer for a few minutes until it reduces slightly.\n10. Stir in the heavy cream and bring the sauce to a gentle simmer.\n11. Return the cooked chicken breasts to the skillet and coat them with the Marsala sauce.\n12. Serve the chicken Marsala over cooked fettuccine or mashed potatoes.\n13. Garnish with chopped fresh parsley before serving.",
      "img": "https://i.pinimg.com/564x/63/88/92/63889293890ff681651765f96502a465.jpg"
    },
    {
      "id": 64,
      "title": "Chicken Fajitas",
      "ingredients": "Ingredients:\n- 1 pound chicken breasts, thinly sliced\n- 1 red bell pepper, thinly sliced\n- 1 green bell pepper, thinly sliced\n- 1 onion, thinly sliced\n- 2 tablespoons vegetable oil\n- 1 tablespoon chili powder\n- 1 teaspoon ground cumin\n- 1/2 teaspoon smoked paprika\n- 1/2 teaspoon garlic powder\n- 1/4 teaspoon cayenne pepper (adjust to your spice preference)\n- Salt and pepper to taste\n- Flour tortillas\n- Optional toppings: sour cream, guacamole, shredded cheese, salsa",
      "img": "https://i.pinimg.com/564x/e3/df/57/e3df572f5046297f5e1f03cc03f35af8.jpg"
    },
    {
      "id": 65,
      "title": "Chicken Parmesan (Italy)",
      "ingredients": "Ingredients:\n- 4 boneless, skinless chicken breasts\n- 1 cup all-purpose flour\n- 2 large eggs, beaten\n- 2 cups breadcrumbs\n- 1/2 cup grated Parmesan cheese\n- 2 cups marinara sauce\n- 2 cups shredded mozzarella cheese\n- 1/4 cup chopped fresh basil\n- Salt and pepper to taste\n- Olive oil for frying\n- Cooked spaghetti or fettuccine for serving",
      "prepare": "Preparation:\n1. Preheat the oven to 375°F (190°C).\n2. Place the chicken breasts between two sheets of plastic wrap and pound them with a meat mallet until they are evenly thin.\n3. Season the chicken breasts with salt and pepper.\n4. Dredge each chicken breast in flour, shaking off any excess.\n5. Dip the floured chicken breasts in beaten eggs, coating them evenly.\n6. In a separate bowl, mix breadcrumbs and grated Parmesan cheese.\n7. Press each chicken breast into the breadcrumb mixture, ensuring they are well coated.\n8. Heat olive oil in a large skillet over medium-high heat.\n9. Fry the breaded chicken breasts for about 3-4 minutes on each side until they are golden brown and cooked through. Remove the chicken from the skillet and set them on a paper towel to drain excess oil.\n10. In a baking dish, spread a thin layer of marinara sauce on the bottom.\n11. Place the fried chicken breasts on top of the sauce.\n12. Spoon more marinara sauce over each chicken breast.\n13. Sprinkle shredded mozzarella cheese on top of the chicken.\n14. Bake the Chicken Parmesan in the preheated oven for about 15-20 minutes or until the cheese is melted and bubbly.\n15. Optional: Broil the Chicken Parmesan for a few minutes to achieve a golden crust on the cheese.\n16. Serve the Chicken Parmesan over cooked spaghetti or fettuccine.\n17. Garnish with chopped fresh basil before serving.",
      "img": "https://i0.wp.com/hangryhanna.com/wp-content/uploads/2023/03/cheesy-Chicken-Parmesan-1024x1024.png?resize=900%2C900&ssl=1"
    },
    {
      "id": 66,
      "title": "Mango Sticky Rice (Thailand)",
      "ingredients": "Ingredients:\n- 1 cup glutinous rice\n- 1 1/2 cups coconut milk\n- 1/2 cup sugar\n- 1/4 teaspoon salt\n- 2 ripe mangoes, peeled and sliced\n- Toasted sesame seeds for garnish",
      "prepare": "Preparation:\n1. Rinse the glutinous rice in cold water until the water runs clear.\n2. In a pot or rice cooker, combine the rinsed rice, coconut milk, sugar, and salt.\n3. Cook the rice mixture according to the rice cooker instructions or bring it to a simmer on the stove, stirring occasionally to prevent sticking.\n4. Once the rice is cooked and the liquid is absorbed, remove it from the heat and let it sit for a few minutes to steam.\n5. Meanwhile, make the coconut sauce: In a small saucepan, heat the remaining coconut milk over low heat.\n6. Stir the coconut milk constantly until it thickens slightly.\n7. Serve the sticky rice on plates or in bowls, topped with the sliced mangoes.\n8. Drizzle the coconut sauce over the mango sticky rice.\n9. Optional: Sprinkle toasted sesame seeds on top for added flavor and presentation.\n10. Enjoy this sweet and tropical Thai dessert!",
      "img": "https://www.thailanguagehut.com/wp-content/uploads/2010/06/mango_sticky_rice.jpg"
    },
    {
      "id": 67,
      "title": "Shakshuka (Middle East/North Africa)",
      "ingredients": "Ingredients:\n- 1 tablespoon olive oil\n- 1 onion, chopped\n- 1 red bell pepper, chopped\n- 2 cloves garlic, minced\n- 1 teaspoon ground cumin\n- 1 teaspoon ground paprika\n- 1 teaspoon ground cayenne pepper\n- 1 teaspoon ground coriander\n- 1 can (28 ounces) crushed tomatoes\n- 4-6 large eggs\n- Salt and pepper to taste\n- Fresh parsley for garnish\n- Crusty bread for serving",
      "img": "https://i.pinimg.com/564x/30/74/66/307466cadcbbd3afc5172c8e62037f0b.jpg"
    },
    {
      "id": 68,
      "title": "Ramen (Japan)",
      "ingredients": "Ingredients:\n- 4 packs of ramen noodles (discard the seasoning packets if using instant ramen)\n- 6 cups chicken or vegetable broth\n- 2 tablespoons soy sauce\n- 1 tablespoon miso paste\n- 1 tablespoon sesame oil\n- 1 tablespoon vegetable oil\n- 4 soft-boiled eggs, halved\n- 1 cup sliced cooked pork (chashu) or cooked shredded chicken\n- 2 cups fresh spinach leaves\n- 1 cup sliced bamboo shoots\n- 1 cup sliced green onions\n- Nori seaweed sheets for garnish\n- Toasted sesame seeds for garnish\n- Chili oil or Sriracha for added heat (optional)",
      "prepare": "Preparation:\n1. In a large pot, bring the chicken or vegetable broth to a boil.\n2. In a separate pot, cook the ramen noodles according to package instructions. Drain and set aside.\n3. In a small bowl, mix together soy sauce, miso paste, sesame oil, and vegetable oil to create the soup seasoning.\n4. Stir the seasoning mixture into the boiling broth.\n5. Divide the cooked ramen noodles among serving bowls.\n6. Ladle the hot broth over the noodles in each bowl.\n7. Top the ramen with halved soft-boiled eggs, sliced cooked pork or shredded chicken, fresh spinach leaves, sliced bamboo shoots, and sliced green onions.\n8. Optional: Drizzle chili oil or Sriracha on top for added heat.\n9. Garnish with torn nori seaweed sheets and toasted sesame seeds.\n10. Serve the ramen hot and enjoy this comforting Japanese noodle soup!",
      "img": "https://uploads.prod01.london.platform-os.com/instances/232/assets/images/recipes/CN_JapaneseRamenSoupSquare.jpg?updated=1574697083"
    }
  ]
}
